{
    "horoscopes": [
        {
            "sign": "Aries",
            "title": "Aries Weekly Horoscope Starting December 7",
            "content": [
                "The transit Sun, Mercury and Venus are moving through the eighth house, and Mercury will move into ninth house by the mid-week. Financial matters are very importance, you will have gains as well as expenses, but there will be a very little balance between gains and expenses. You will find new ways to make more income, so this is a good period to look for a part time or a freelance project. There will be a bill to clear, it can also be a repayment, or you will try to restructure your tax, PF and insurance plans. There will be some sudden changes like a risky event or an expense.",
                "On tenth the Neptune will start its direct mode in Pisces, and that will be a great relief for you. This cosmic event will act as a healing session, so, you will be much relaxed that earlier. This Neptune will aspect the sixth house of work, and colleagues, situations at work also will improve and your health too. You will witness concrete shifts like clearing a misunderstanding, a delay involving paper work, or health issue moving forward. This direct mode will also bring good dreams, which will signal you about good events going to happen soon.",
                "By mid-week, Mercury will move into the ninth house and Mars is there, so you will have foreign collaborations, long trips, opportunities to enrol in a course, write and publish your article. There will be a lot of projects from media related domain too. By the weekend, Mars will move into Capricorn, which will be in its exalted mode, so this Mars will have a high voltage impact on your career. This Mars will accelerate growth, so, you will start working hard. New projects, and new job role also can come up during this time. However, there will be some issues with your managers, and kindly avoid that."
            ]
        },
        {
            "sign": "Taurus",
            "title": "Taurus Weekly Horoscope Starting December 7",
            "content": [
                "There will be two transits this week, as Mercury will move into Sagittarius and Mars will move into Capricorn, but the impact will be visible by next week. The tenth house of career will be highly activated with Sun, Mercury and Venus. You will find new clients, collaborators, or people who like your work, and there are chances to start new personal or business relationships. There will be multiple opportunities for attending such programs, and you will meet new people too. If you are going through any relationship issues, then you will find some solutions for them as well. Due to the solar transit, you can expect arguments in the relationships too.",
                "The god of oceans, Neptune will turn direct on your eleventh house, so this is certainly a good news. You were having some blocks in the long-term plans, and they will slowly vanish, and you will see progress. A friendship or a long-term relationship which went through unclear pattern will get the clear direction. New people with spiritual, artistic and creative skills will enter your life, and that will add value to your life as well. This direct transit will bring support from your friends, network circles, and elder siblings too. You will also get chances to join a new job or a new team.",
                "Mars will be in Sagittarius which rules the eighth house for some days and by weekend it will move into Capricorn which is the exaltation sign of Mars. Your financial matters will surely improve, and that will be a great relief for you. For the past days you had a lot of expenses, and those will get subside slowly. You will also have final discussions about repayment, tax, PF an insurance related domain. After when Mars moves into the ninth house, you will have gains, foreign collaborations, and opportunities for higher studies."
            ]
        },
        {
            "sign": "Gemini",
            "title": "Gemini Weekly Horoscope Starting December 7",
            "content": [
                "During the second week of December, Mercury and Mars will be changing the signs. The Sun, Venus and Mercury will be in the sixth house of work, diseases and enemies when the week starts. The stress can come up, especially from the over expectation from your colleagues, so you need to be diplomatic with your colleagues, so make sure you don’t take part in any unhealthy competition at work. There will be opportunities for new job, or a new project, so you should be prepared. Along with that, your health also will be important.",
                "The transit Mars is moving through the seventh house, and it will change the house in the weekend. So, you have few more days to form new joint ventures, new relationship and attend social gatherings. You will be around other people, there will be heated arguments, which is the signature mode of Mars, and it can damage the existing relationship, so make sure you are diplomatic when you deal with others. Join projects will move forward quickly, and someone will step up with initiative that gets stalled plans move again.",
                "Your tenth house of career will get a boost as Neptune will turn direct in the tenth house. The plans will change, and you will have clear idea about your role too. You will see new career paths, projects, or responsibilities too. Your managers will give you some new tasks, but the scope may not be very clear now, but you will find clarity by next week. Neptune is known as the planet of oceans, hence emotions, please don’t take any emotional steps in your career. You will be working in some projects which involve creativity and imagination."
            ]
        },
        {
            "sign": "Cancer",
            "title": "Cancer Weekly Horoscope Starting December 7",
            "content": [
                "The second week of December is all about forward motion as Mercury and Mars will change signs, and Neptune will turn direct. When the week starts, the Sun, Venus and Mercury will be in your fifth house, and that will fill your mind with a lot of creativity and fun. You will get public attentions, invites, and romantic opportunities, where you feel naturally noticeable. There will be fun activities, dates, celebrations with a younger group too. However, this is a risky period for speculative ventures, so make sure you don’t invest huge amount in any such projects. If you are a parent, there will be events involving children like school functions, activities, or update in their schedule.",
                "Mars is in the sixth house, so your workplace is very much activated, and you will have multiple tasks which are short yet complex. There will be an increase in the meetings, deadlines will tighten, and coworkers or clients will push for faster results. There will be small conflicts or disagreements on the job, and you will have to take leadership roles at work. There are chances for lower abdomen related minor health issues, which will vanish after when Mars moves into Capricorn. There will be more time with pets, or vet visits, extra care of sudden needs for pets.",
                "Your faith and wisdom will increase as Neptune; the god of oceans will turn direct during this week. This will bring events connected to travel, study, legal matters, and beliefs. Travel plans will progress, and you will meet good people during these trips. Travel packages will be affordable, and you will also get some discounts too. You will also find foreign collaborations and profits through them. You will enrol in a course or you will appear for an exam, most probably for a back paper. This Neptune also will give a spiritual inclination too."
            ]
        },
        {
            "sign": "Leo",
            "title": "Leo Weekly Horoscope Starting December 7",
            "content": [
                "Leo Sun, Moon, rising signs will have a lot of work at home as the Sun, Venus and Mercury all will be in the fourth house. You will be looking at every nook and corner of your house, as you will there something incomplete at your home. These planetary trio will show you the need of repairing, relocation and real estate deals too. The elderly figures at home will surely need your support, so try to help them as much as you can. The Sun is a separative planet, so there are chances for arguments at home, especially with elderly male figures.",
                "Martian transit is moving through last degrees of Sagittarius, and by the weekend, it will enter its exalted Sign Capricorn, until then, you will have a lot of activities with youngsters or children. If you are parent, you will have school visits or entertainment programs or with children. Single Leos will have dares, messages or disagreements about their relationship. Creative projects will pop up quickly, and you will have to act accordingly. You will start something new, return to a hobby or push to finish something that has been delayed. There will be social plans, like outings, sports, or entertainment events with your friends and network circles too.",
                "The financial matters will start growing in a positive mode as transit Neptune will turn direct in the eighth house. You will get some financial support from others and it can also be from unknown people too. Insurance, settlements, or banking issues will shift often clearing up after a long period of uncertainty. Hidden information about finances, personal life of partnership will surface, and that will help you to understand what need to be fixed."
            ]
        },
        {
            "sign": "Virgo",
            "title": "Virgo Weekly Horoscope Starting December 7",
            "content": [
                "Your week will be full of communication and travel as the Sun, Mercury and Venus will be in the third house. There will be a lot of conversations with siblings, neighbours, or coworkers will become more frequent. There will be short travels, quick drives, local outings, small trips, and it can be with friends, family or alone. You will start learning new things, there will be online and offline meetings too. Due to this multitasking, you may even have neck to shoulder related issues.",
                "Mars will be in Sagittarius until Saturday, so your family matters will be active. Something at home will need fixing, repairing, or rearranging. It can be moving furniture, cleaning projects or sudden maintenance work, or even a real estate deal. Family members will be active, or demanding, and you will have to take quick decisions, or occasional disagreements, inside the household. There will be some plans for renovation, or change in the living arrangements too. Guests or relatives will pay sudden visits, or you will travel back to your family home, for a specific reason.",
                "After a long phase of retrograde, Neptune will be turning direct in Pisces, and this will be a great move for Virgos, as their relationships will move forward. You will get good support from the people, but make sure you don’t blindly as they will give you fake ideas. Please take time to understand everyone, otherwise you may fall prey to the evil plots. Joint plans that were stuck will begin moving again, often through expected support. You will  also attend some social gatherings like parties; marriage or a business meets too. Those who work in fashion, movie, creativity or foreign collaborations will have more opportunities."
            ]
        },
        {
            "sign": "Libra",
            "title": "Libra Weekly Horoscope Starting December 7",
            "content": [
                "The second week of December will bring the end to the financial woes, as Mercury will move out from the second house, so the pressure of expenses will be less, but it cannot be said that you are totally out of problem zone. You will surely get new income opportunities, or small financial boosts, and payments that were delayed will come through. Since Venus is in the second house, you will buy some luxury objects, but it will be good if you stay away from that. You may also meet a financial consultant to  get a better saving plan, or you will complete a payment with a delay.",
                "The third house of multitasking is highly activated with Martian transit. Get up and ready to work in multiple projects as the third house shows multitasking. You will have short trips, online and offline meetings too. You will deal with sudden tasks involving siblings, neighbours, or coworkers, and few disagreements or heated discussions also will pop up. You may even go for a course, or a debate where you learn new things. Please control your speech, otherwise you will have to argue with others.",
                "Neptune will turn direct after a long phase of retrogression, and this will bring subtle, but noticeable events at your work, as it is moving through the sixth house.  You had some tough situations at work, but that will grow smoother, and pressure will subside. This Neptune will arrange a supportive environment at work, and your colleagues also will be supportive. However, you should study all the projects in detail too. Your health also will improve slowly, as you become more sensitive to what your body needs. You will adjust your habits, drop unhealthy patterns, or discover a better health practice."
            ]
        },
        {
            "sign": "Scorpio",
            "title": "Scorpio Weekly Horoscope Starting December 7",
            "content": [
                "The transit Sun, Venus and Mercury are in your sign, and you are going through a transformatory period, which cannot be label as very good. The threshold will be less during this week, as Mercury will be moving out from this trio. People will notice you more, and treat you warmly, and respond quickly to what you say or do. You will also get invites, some messages, and friendly interactions will increase and be active and outgoing without any external push. There will be small improvements in appearance, like new clothes, refinements, or compliments from others will come up naturally. Your plans also will move forward during this phase.",
                "Mars is moving through the last degrees of Sagittarius, and by the weekend it will move into the third house. Expenses will rise suddenly like repairs, purchases, or necessary replacements will come up without warning. At the same time, you will push harder to earn more, and a new income opportunity, a side job, or extra task will appear that helps you boost your finances. You will be sort out some money matters do some budgeting or you will buy something important. This is also a good time to control your diet, and you must do that.",
                "Transit Neptune will turn direct during this week, and this is a positive transit. This will bring more fun and romance into your life, so get ready to be relaxed. Creative projects will reopen or flow more easily, and you will receive ideas, invites, or opportunities related to arts, music and entertainment too. There will be social gatherings and you will feel the life being more meaningful, with pleasant outings relaxing gatherings, or taking up new ventures. Parents will take up a lot of responsibilities connected to their children."
            ]
        },
        {
            "sign": "Sagittarius",
            "title": "Sagittarius Weekly Horoscope Starting December 7",
            "content": [
                "Your personal life is going through a silent mode, as the Sun, Venus and Mercury are moving through the water sign of Scorpio. Still, you are in a silent zone, but after when Mercury moves into your sign, you will start making new plans for your life, will take up some refinement’s sessions for your appearance like a new haircut, or buy new dresses. However, there will be minor health issues like cold or a flue, which will diminish in the next week. You will also take part in prayer and meditation sessions too.",
                "Martian transit is moving through your sign, and by weekend, Mars will be in the second house. This Mars will push you to be a pioneer, so make sure you take up only possible efforts. Mars in your sign will make you harsh, and it can hurt people. Your schedule will be busier, and sudden task or responsibilities will pop up. You will also take up new tasks with courage, but make sure you end them with perfection. Mars in your sign can make you a bit arrogant too.",
                "Transit Neptune will turn direct in your fourth house, which will bring a gentle, positive and supportive environment at home. Your family members will have better bond, so, that will make you happy and peaceful. There will be some events like home improvements, décor changes, or a peaceful atmosphere will naturally develop. A housing matter that was stuck or unclear will start moving forward, such as repairs, approval, relocation steps or property discussions. You will be drawn to create a comforting space, and helpful people will show up to guide you."
            ]
        },
        {
            "sign": "Capricorn",
            "title": "Capricorn Weekly Horoscope Starting December 7",
            "content": [
                "The tenth house of team settings and long term projects will be highly active as three planets are moving through your eleventh house. There will be some discussions with your team and friends. You will also look forward to join a new team, and in the professional perspective, you may join a new company or attend an interview for that. There will be team events, some updates from your friends, or there will be group interactions which can be online or offline. You can also expect interviews and discussions for a new job. The Sun can make you an egoist, so there are chances for arguments within the team.",
                "Mars is still moving through Sagittarius and it is a bit complex transit. You were having some emotional and physical challenges in the past weeks, all that will subside. Your workplace issues also will get sorted out and that will make you more confident too. Your imagination was in a negative mode, but slowly it will turn into positive mode, and you will see better things happening around you. This is a good phase to go for a therapy, meditation or a prayer session.",
                "The god of oceans, Neptune will turn direct in the third house during this week, so the blocks in the tasks will be removed. This is a good phase for your siblings, and their life will be eventful. You will be working hard, and there will be multiple tasks, majorly from communication-based projects. So, you can expect a lot of paper work, messages, and projects from media too. Short trips, transfers or relocation can come up when you least expect it. Learning, writing, and publishing will also be the part of this transit. Due to the hard work, you may get minor health issues related to neck to shoulders too."
            ]
        },
        {
            "sign": "Aquarius",
            "title": "Aquarius Weekly Horoscope Starting December 7",
            "content": [
                "The tenth house of career is activated by the Sun, Venus and Mercury. You can expect noticeable activity and movement in your career, reputation and public life. There will be new job opportunities, and you will receive more attention from your managers, clients or influential people. This is a golden opportunity for unemployed people, as they will get closest opportunity to get a new job or attend an interview and present themselves better.",
                "The transit Mars is moving through the eleventh house and by weekend it will move into the twelfth house. So, you have a few more days to plan long term events. Group projects will speed up, and you will take a leading role or handle situations which needs quick decisions. A disagreement or strong opinion inside a group will surface, pushing you to stand your ground. Your goals will get a boost as you will feel driven to make progress and something you wanted for a while will move forward suddenly. You will remove yourself from a group, or some of your friends may leave you for the best.",
                "The good news of this week is transit Neptune will turn direct in your second house so this will bring positive developments in money, resources, and material stability. Financial flows that were unclear or delayed will start moving forward. You will also get some discounts, gifts, or unexpected help from known and unknown people. You will get new income opportunities from creativity, compassion and finance related domain too. This Neptune will help you to get good deals, beautiful items, or things that genuinely improve your daily life. This is also a good time to meet a financial consultant for budgeting."
            ]
        },
        {
            "sign": "Pisces",
            "title": "Pisces Weekly Horoscope Starting December 7",
            "content": [
                "The Sun, Mercury and Venus are moving through your natal ninth house, and by mid-week, Mercury will move into your tenth house. Travel plans will come up, and they will be smooth also. Those who work in travel related domain will have more opportunities. You will receive helpful news about education, exams, courses, or training, and teacher, fatherly figures or mentor will offer guidance or support. Long-distance communication will increase, and someone from afar will increase contact you with good information or plans. Legal or paperwork matters will move forward with ease, and your projects will get approved. There will be some projects from writing, publishing, and studies too.",
                "Mars is moving through the last degrees of Sagittarius, and by the weekend it will move into the earth sign of Capricorn. The career sector is highly active, and you have more days to attend interviews or discussions. Your projects will be more and deadlines will be tightened, new tasks will be handed to you or a project will require urgent action. You will step into leadership role, even if temporarily, because something will demand quick decisions. There will be a career shift, opportunity or challenge will appear, and you will act boldly during this time.",
                "The good news of this week, is Neptune turning direct in your sign, so you will have positive events in your life compared to the last days. You will attract new people who offer support, guidance, or helpful opportunities without much effort on your past. Your personal projects, appearance, or self-expression will improve silently, and someone will compliment you, a small change in style or routine will make a positive impression, or a chance to encounter will benefit you. Misunderstandings will clear and any issues in the personal or business relation also will silently vanish."
            ]
        }
    ]
}