{
    "horoscopes": [
        {
            "sign": "Aries",
            "title": "Aries Weekly Horoscope Starting December 14",
            "content": [
                "The third week has come so fast, and the newmoon in the fire sign of Sagittarius will enlighten Aries, Sun, Moon or rising. The newmoon indicates new beginnings, so you will be getting new opportunities to learn new things, Mercury and Venus are also in the ninth house, and they will aspect the third house, so they will bring pleasant and active events connected with communication, short trips, and learning. You will get more friendly messages, invites, or positive conversations, and someone close like a sibling or a neighbour will reach out with supportive news or plans. You will surely enjoy your daily life, but there will be multitasking and you will be busier. Paperwork, meeting, or discussions will surely go smoothly, and you will get new opportunities without much stress. You may also buy an electronic gadget or repair the one you have. There will be a lot of social media and online activities too.publish your articles or a new opportunity from the media. The impact of this lunation will last for six months, so for the next six months, you can expect opportunities for long trips, global ventures or pilgrimages too. You will also get some guidance from your teachers, mentors and fatherly figures which will surely change your life in the right direction.",
                "Mercury and Venus are also in the ninth house, and they will aspect the third house, so they will bring pleasant and active events connected with communication, short trips, and learning. You will get more friendly messages, invites, or positive conversations, and someone close like a sibling or a neighbour will reach out with supportive news or plans. You will surely enjoy your daily life, but there will be multitasking and you will be busier. Paperwork, meeting, or discussions will surely go smoothly and you will get new opportunities without much stress. You may also buy an electronic gadget or repair the one you have. There will be a lot of social media and online activities too.",
                "Mars will move into Capricorn during this week, and it will be in its exalted mode, which will bring noticeable events in your career. There will be new tasks, urgent deadlines, or pressure from bosses will appear without warning. A project which was quiet will speed up, and you will have to take charge or make fast decisions. Someone in authority will push you harder, or you will be placed in a role where you will have to prove your capability. New opportunities or some arguments will also come up during this time."
            ]
        },
        {
            "sign": "Taurus",
            "title": "Taurus Weekly Horoscope Starting December 14",
            "content": [
                "The third week of December will witness a powerful new moon in the eighth house, so this will trigger fresh beginnings and new developments in volving shared money, joint finances, loans, taxes, inheritances, or private matters. A new financial step will open like starting a new shared account, applying for a financial support, reorganizing debts, or beginning a process with insurance taxes or paperwork. A partner’s money related discussion also will happen, so there will be new financial plans or adjustment for both of you. A private conversation or secret matter will come to light, helping you start a new chapter with clarity.",
                "The transit Mercury and Venus will aspect the second house, so it will bring pleasant, practical, and financially helpful events. You will get good news about money payments, discounts, small gains, or financial support. There will be conversations about income, purchases, or budgeting will flow smoothly, and someone will offer advice or a helpful solution. You will buy something very useful and beautiful too. New job opportunities can also come up, and you should accept them as they will be a relief for you during this time. You may also attend family functions or meet someone special within the family.",
                "Mars will enter Capricorn, and that will bring quick travel plans, and foreign collaborations. These trips will come up suddenly, and you will book trips, deal with travel documents, or making fast decisions to cancel the plan as well. A situation involving visas, paperwork, or legal process will demand immediate attention. Studies, exams, or legal processes will also come up, and you need to cross check everything and it will be good if you ask an expert to review your work. There will be foreign collaborations, and you will get some benefit out of this. You will also get opportunities to publish your work."
            ]
        },
        {
            "sign": "Gemini",
            "title": "Gemini Weekly Horoscope Starting December 14",
            "content": [
                "The third week of December will have more activity in the public domain as the newmoon will rise in the seventh house. This newmoon will initiate a fresh cycle in relationships, partnerships, and one-to -one connections. You can expect new relationships, partnerships, romantic, business, or collaborations will emerge, or an existing relationship will progress towards the next phase. You will try to redefine the boundaries in the relationships, let it be personal or professional. There will be social gatherings, some business meets, or one-to-one meeting and you will get valuable contacts too. The impact of the newmoon will last for the next six months, so you will have a long term to plan for such collaborations.",
                "Mercury and Venus will aspect the first house , so this will bring charm, clarity, and harmony to the way you express yourself. You will try to update your look and appearance, for that you will buy some cosmetics, try a new haircut, or you may get a new dress. This planetary combo will bring more charm to you, and that will bring good things in your life. You will also get new professional and business opportunities too, so use these favourable transits wisely.",
                "Mars will move into Capricorn, which rules your eighth house, which is definitely going to be a complex transit, so make sure you save some money for the rainy days. Mars itself is the planet for financial liabilities, and it will be in the house for finances, so this is a very complex transit, and you will have a lot of expenses. Kindly avoid all risky expenses, and stay away from anything like offering financial aid to someone or, taking new loans. There will be some discussions regarding your financial matters with your spouse or business partner too."
            ]
        },
        {
            "sign": "Cancer",
            "title": "Cancer Weekly Horoscope Starting December 14",
            "content": [
                "The last newmoon of this year will rise in Sagittarius during this week, and for Cancer, Sun, Moon and rising will have new developments at workplace and in some difficult situations at home. The impact of this lunation will last for the next six months, so you will have a long duration of time to deal with these issues. This is not a great Moon to deal with some stressful things, so prevention is better than cure. The chances to get a new job is very high, so this is a good opportunity for job seekers, and these opportunities will last longer for the next six months. Please avoid unwanted conversations at work, and take care of your diet as well.",
                "Mercury and Venus will aspect the twelfth house, so you will naturally get interest in spiritual matters. There will be a lot of private conversations, quiet realizations, or behind the scenes exchanges. This is the time for secret dating or browsing through the dating apps or setting up an anonymous profile in that. Mercury and Venus say that you will be focused on healing yourself, so there will be activities like prayer, meditation and hospital visit can also happen during this time.",
                "Mars will enter Capricorn, which rules your seventh house, that means your relationships will have a lot of importance for the next forty plus days. The number of people you interact with will increase throughout this transit. You will be assertive, but make sure you are gentle when you draw the boundaries. Please be a little reserved and don’t share any of your private information with anyone. You will also attend social gatherings, private meetings and business meet as well. During this time, you will find new agreements and contracts too, but make sure you cross check the conditions before you give the approval."
            ]
        },
        {
            "sign": "Leo",
            "title": "Leo Weekly Horoscope Starting December 14",
            "content": [
                "The last newmoon of this year will appear this week in your fifth house, so definitely this is a golden opportunity for fun and entertainment. This newmoon will bring a strong desire to play, create and follow what you like, so you will be spending more time in creative activities. The specialty of newmoon is new beginnings, so from this new moon onwards, you will have many opportunities to start a new project so that you can make more money. Parents will have more activity with their children too, and children will also have new projects as well. Single natives will have the closest opportunities to find someone special.",
                "Transit Mercury and Venus will aspect the eleventh house, so you will find easier to find new friends, and collaborate with them. You will get supportive people, and these opportunities will last for the next six months. There will be team conversations, and that will help you to strengthen bonds, and form new alliances, which can give you long term benefits. This transit will give you a golden opportunity to join a new team, which can be official or personal too. Those who work in foreign companies, technological and finance companies also will get new opportunities.",
                "Mars transit will move into the exaltation sign of Capricorn, and this will intensify your focus on work, routines, and health. You will tackle tasks that have piled up, organise your schedule and try to get maximum results from your work, this is a complex placement as for Leo Sun, Moon and rising signs, Mars is in a negative house which indicates struggles are there from work, health and finances, but you will be able to manage them. This is a good time to find a new job, get a better diet and spend more time with your pets."
            ]
        },
        {
            "sign": "Virgo",
            "title": "Virgo Weekly Horoscope Starting December 14",
            "content": [
                "The last newmoon of this year will appear in the fire sign of Sagittarius, which will leave a good long lasting impact in your fourth house of home and family. The newmoon indicates new beginnings, and the impact of the newmoon will last for the next six months. So, you will have some real estate deals, relocation, and home improvement plans, and it can happen this week of in the next six months too. There will be some discussions for a family event, and you will meet your relatives or friends at home, or you will go to meet them. You will initiate documentation regarding home, land, or family matters.",
                "Mercury and Venus will aspect the tenth house, so it will create visible developments in your career, public image and long term direction. There will be some communication regarding your profession, and they will move forward smoothly. You will get support from supervisors, clients, or influential people and they will bring growth in your career. Your work will gain positive attention, and your skills will be recognised publicly. This is a golden opportunity for those who work in creative and communicative sector. Job seekers will get the opportunities to get a new job as well.",
                "Martian transit will enter Capricorn, which is the exaltation sign for Mars, so your fifth house will be active. Single natives will have many opportunities to find someone special. You will also spend time in projects from creative sector, so actors, writers and directors will have new opportunities. There will be an increase in activities with the children, such as events, responsibilities, or new plans centered around them. There will be social outings, dates, or pleasure focused activvties and they will be frequent. However, there are chances for arguments with your team members, so make sure you don’t trigger anyone."
            ]
        },
        {
            "sign": "Libra",
            "title": "Libra Weekly Horoscope Starting December 14",
            "content": [
                "The last new moon of this year will rise in Sagittarius this week, and that will impact your communication, learning and daily interactions. The new moon indicates new beginnings, so there are chances for you to get new projects or you may start a new business venture. There will be important conversations about new groups, and team activities, which can last for a short term. You will also read new documents, contracts, or you will have some paper work. Short distance travel with friends or a solo short trip can also come up. Learning, coaching, and writing also will be the part of this transit. Matters involving siblings, neighbours, or close relatives will enter a new phase through mutual discussions.",
                "The transit Mars will enter its exaltation sign Capricorn during this week, so the family matters will be of ultimate priority. Mars will push you to discuss the family matters, but there will be some clashes, so make sure you keep your calm. There will be plans for renovations, repairs, or you will make physical changes to your living space. There will be some plans for relocation also, but this will be very complex as Mars indicates struggles too. You have to take care of the family members as they will have a lot of needs.",
                "Mars will aspect your relationship sector, so there will be more activities in the public, but please make sure you handle everything with patience. You will have a lot of desire to establish your opinion over others, but there will be some challenges if you try to do so. Please be patient and try to wait for the right moment and give your opinion when someone ask for that. At work also there will be more responsibility, and there will be new projects. Job seekers have the closest opportunities to attend interviews."
            ]
        },
        {
            "sign": "Scorpio",
            "title": "Scorpio Weekly Horoscope Starting December 14",
            "content": [
                "The new moon will rise in the fire sign of Sagittarius, and for Scorpio Sun, Moon and rising will focus more on the financial matters. The impact of the new moon will last for the next six months, so you have a long time to get a good financial plan. You may get a new income source, or you will restructure your financial arrangements. It can be like updated pay, pricing, or budgeting, but you should not follow your ideas, but it will be good if you follow the expert opinion. The second house also indicates career, and earnings, so unemployed people will have the closest opportunities to get appraisals or change in the earnings through full time or part time job.",
                "Mercury and Venus will aspect the eighth house, so there will be some positive developments in the financial matters, which will be for short term. There will be some discussions regarding loans, debts, taxes, insurance, or joint accounts will move forward, and reach agreement. You will get some financial aid or emotional support, but please don’t rely on that fully. A deep and personal talk with in-laws also can happen, which will be very important and the impact will last for the next six months.",
                "Mars, your ruler will enter the exaltation sign Capricorn during this week, and that will impact your third house. Mars will be here for the next forty plus days, so you will have a lot of activities, which needs a lot of physical energy. You will have a lot of communication with your team settings and siblings, but make sure you don’t offend anyone. Short trips, foreign collaborations and cancellation of travel plan also can come up. You will take part in some competitive events, like sports or interviews. Learning, writing and publishing also will be the part of this transit."
            ]
        },
        {
            "sign": "Sagittarius",
            "title": "Sagittarius Weekly Horoscope Starting December 14",
            "content": [
                "Mercury and Venus will energize the seventh house through a powerful aspect, so this transit will bring new relationships, partnerships and agreements. There will be some conversations with a partner, and it will lead to commitment in a long term manner. There will be online and offline meetings for personal and business matters, so get ready with your profile. Single Sagittarius Sun, Moon and rising will think about starting a profile in the dating app, as the situations are very much favourable to start a new relationship. There will be public functions like parties, weddings or business meet too.",
                "Mars will enter your second house and it will be there for the next forty plus days, and this cannot be seen as a green flag as Mars indicates financial liabilities, so you will have to be careful with your money matters. This transit is not favourable for savings so you can expect some expenses, so don’t buy anything which is not necessary. Mars is a fiery planet, and it is in the second house of speech, so, you will have the tendency to be harsh, and that will naturally bring clashes at work or at home, so make sure you use kind words."
            ]
        },
        {
            "sign": "Capricorn",
            "title": "Capricorn Weekly Horoscope Starting December 14",
            "content": [
                "The last new moon of this year will rise in the twelfth house, so this will bring closure and behind the scene developments. An ongoing private situation will end, or you will put a closure to that with your consent. The impact of the new moon will last for the next six months, so for the next six months, you will try to start a new project with a foreign client. Those who wanted to move abroad will also get some updates in the next six months. You will also start processing confidential paper works, legal files or administrative matters and that will be initiated or finalized away from public view. Someone or something will exit your life quietly, creating space for a new cycle. Prayer, meditation and other healing practices also can happen.",
                "Mercury and Venus will aspect the sixth house, so the difficulty at workplace will be less, as both are natural benefics. There will be clear developments in work, routines, and health matters. There will be conversations at work will lead to new task assignments, schedule changes, or improved working conditions. You will get some opportunities to find a new job or get some easy project at work as well. Health appointments, treatments or wellness plans also will be the part of this week.",
                "Mars will rise in your sign, so, for Capricorn rising, Sun or Moon signs, will have new beginnings for the next forty plus days. You will start new projects, confront situations, directly and take the lead in matters that impact your life. There will be more physical activity through exercise, travel, or demanding tasks. At the same time, you will have to speak harshly with others, so please control that nature. You will also try to change your appearance by changing your style, you will change your routine, or personal life will change in the coming days."
            ]
        },
        {
            "sign": "Aquarius",
            "title": "Aquarius Weekly Horoscope Starting December 14",
            "content": [
                "The last new moon of this year will rise in the fire sign of Sagittarius, so there will be a lot of events in the long term plans as this new moon will rise in the eleventh house. Aquarius Sun, Moon or rising signs will get new connections through meetings, group activities, or online platforms. An existing friendship will enter a new phase through collaboration, commitment, or separation based on practical decisions. There will be group projects, community efforts, or organisational roles will begin and require active participation. You will get support from friends or associates will lead to opportunities tied to career growth, funding or future pans too.",
                "Mercury and Venus will aspect the fifth house, so this will be a pleasant time with your children or youngsters. The fifth house indicates creative self-expression, so for the next six months, you will get ample opportunities to start a new project with your creative skills. There will be social gatherings like parties, or business ventures with your friends. Single Aquarius natives will have the closest opportunities to find someone special, and start a new relationship but please take some more time to take a final decision in these relationships. Parents will have more fun time with children too.",
                "Mars will move into the earth sign of Capricorn, which is the exaltation sign for Mars, but Mars is in the twelfth house. This transit is a bit complex one, so there will be some emotional issues for the next forty plus days. You may go to meet people who live in isolated places like hospitals or therapy centres. This Martian transit can also make you feel a bit moody and clumsy, so you should focus on your emotional and physical health too. You will be spending time in prayer, meditation and some therapy."
            ]
        },
        {
            "sign": "Pisces",
            "title": "Pisces Weekly Horoscope Starting December 14",
            "content": [
                "The new moon will rise in the tenth house, and that means for the next six months there will be new developments at work. A new professional role, title or responsibility will begin, or a clear shift in your career path will be set into motion. Job offers, promotions, or leadership opportunities will emerge and require decisive action. There will be important meetings with authority figures, employers, or institutions will take place and lead to formal decisions. Your work will get appreciated, and there will be some announcements regarding that. You will sign some documents about new projects or contracts too.",
                "With Mercury and Venus influencing the fourth house, your attention may shift towards home decoration and improving your surroundings. This beneficial planetary alignment encourages positive domestic experiences, including enjoyable interactions with friends and relatives, both visiting and hosting. Financial resources appear sufficient to meet family requirements, potentially enabling the acquisition of new devices for the household. Consideration of home improvement plans, relocation, and the signing of property-related documents is indicated. Professionally, this period may also bring recognition and appreciation for your contributions to projects. Younger members of the household may experience a period of contentment, marked by pleasant meals and familial affection.",
                "Martian transit will enter Capricorn, which is the exaltation sign of Capricorn. This transit will bring new opportunities for long term collaborations which can be very profitable. Group projects will speed up, and leadership roles within teams or organisations will be coming up. There will be some conflicts or competition within social circle , and you should address with patience. You will get new friends, or some of your friends may leave you, but try to keep a good equation with everyone. This is the time for group events, charity programs and especially for long term financial plans"
            ]
        }
    ]
}