{
    "horoscopes": [
        {
            "sign": "Aries",
            "title": "Aries March Horoscope",
            "content": [
                "This month marks a beneficial shift as Jupiter, a planet associated with fortune, turns direct after its extended retrograde period. Its ongoing presence provides additional time to address matters concerning your home and family. A significant lunar eclipse in your sixth house indicates the culmination of important work projects. Individuals seeking employment may discover new opportunities emerging within the coming six months. You may also experience an improvement in overall well-being. With Venus in your first house for an extended duration, you are supported in establishing your personal presence and influence.",
                "Planetary influences suggest the emergence of new opportunities for both professional and personal relationships. You may feel motivated to update your appearance, perhaps through new clothing or a different hairstyle, to invigorate your personal energy. The twelfth house, associated with introspection and solitude, will exert a significant influence for much of the month. While initial days may present some challenges, these will gradually lessen as the period advances. The New Moon's presence here indicates a potential for freedom from emotional concerns.",
                "Until twentieth, Mercury, the planet for communication and travel will be in a retrogression mode, and that will bring technical glitches, so you need to take care of your electronic devices. There are travel blocks until twentieth. You have to be careful with your coworkers, and job offers during this retrogression phase, as there are chances for lag in the projects and fake job offers too. However, Jupiter’s direct mode will support you throughout his month. This month is especially important for job seekers, as they will have the closest opportunity to get a good job."
            ]
        },
        {
            "sign": "Taurus",
            "title": "Taurus March Horoscope",
            "content": [
                "March will bring more surprises as the house of desires, the eleventh house will be active throughout this month. As per tropical astrology, Jupiter will turn direct in Cancer, which will take your life is a fast mode, which will be better than the last few months. A powerful lunar eclipse will trigger your fifth house, and that means you will complete some projects like a business venture or a project with your creative skills. This also indicates problem solving sessions in your love life, or you will propose some one whom you were seeing for a long time, or you will quit the relationship. This Moon will bring special event in your children’s life as well, like they getting a project or they leaving a team.",
                "Venus will be moving into the twelfth house, and both will be for some time, so throughout the month, you may feel a bit detached, but that’s ok as it is a cosmic reset, as the universe know that you need some rest and restoration. You will take care of your physical and mental health, so you will be going for therapy, and spending more time in reflection too. Additionally, you will have short travels, learning sessions and important conversations with your siblings.",
                "The newmoon will rise in your eleventh house, and that will surely bring new friendships, and team invites, so from the second week onwards, you will be part of multiple online and offline discussions. There will be new job opportunities, or you will also try to start new ventures, and this is a good time to discuss business ideas with your friends. This newmoon will also bring foreign collaborations, and opportunities to work in domains like space, finance, and technology. Venus will move into your sign on thirtieth, and that make your next month also memorable.Until twentieth, Mercury, the planet for communication and travel will be in a retrogression mode, and that will bring technical glitches, so you need to take care of your electronic devices."
            ]
        },
        {
            "sign": "Gemini",
            "title": "Gemini March Horoscope",
            "content": [
                "Gemini Sun, Moon and rising signs, will have very significant month for career, profits, home and healing. The month will start with a powerful lunar eclipse in the fourth house, so, you will have important events taking place at home and work for the next six months. There will some completions in real estate deals, and problem solving sessions too. The lunar eclipse also shows that you will take up new responsibilities at home, and there will more project at work too. Venus will be in the eleventh house, so you will get new long term associations in the personal and professional sector.",
                "These associations will be like new job opportunities, new friends who can give new directions to your ambition. You will be the part of team work and people will be even from far places. There will be programs like cultural exchanges, learning sessions, social media activities, online as well as offline discussions too. During this transit, single Gemini natives may also start liking someone. For the last few months, the financial matters were a bit challenging, but from this month onwards, there will be growth in the financial matters. There are also some chances for appraisals or freelance projects too.",
                "The newmoon will rise in your tenth house, and that shows that you will think about new job, and the job will be very important. There will be important discussions with your managers, and colleagues. Until twentieth, Mercury, the planet for communication and travel will be in a retrogression mode, and that will bring technical glitches, so you need to take care of your electronic devices. Please make sure this Mercury is not impacting your career negatively. You can also expect some freelance projects, and they will give you some money as well."
            ]
        },
        {
            "sign": "Cancer",
            "title": "Cancer March Horoscope",
            "content": [
                "The month of March will be very important for Cancer Sun, Moon and rising natives, as according to tropical astrology, Jupiter will turn direct in your sign, so this will bring a ray hope in all the areas of your life. To begin with the lunar eclipse in your third house, and that shows you will complete a deal, or a major conversation or communication related project will reach the climax. You can also expect an emotional confrontation with a sibling or a relative. Short trips, enrolling in a course, and writing project also can happen during this month.",
                "Venus will be in your tenth house, which is a very promising transit, so, get ready to find a better job, or work hard in the current job. Both the planets will bring opportunities from creative, admin, armed forces and government sector. However there will be some issues, but Venus will try to solve them. There will be important discussions with your managers too. Until twentieth, Mercury, the planet for communication and travel will be in a retrogression mode, and that will bring technical glitches, so you need to take care of your electronic devices. Please make sure this Mercury is not impacting your career negatively.",
                "The newmoon will bring long distance travels, and foreign collaborations as it will rise in the ninth house, so you can expect such things from the second half of this month. Learning and upskilling will be the inevitable part of March, so students will be able to use this month very effectively. These study programs will help professionals to qualify for promotions. However, if you are going through any legal issues, then you have to be alert, as the Sun will show you the best way to deal with them."
            ]
        },
        {
            "sign": "Leo",
            "title": "Leo March Horoscope",
            "content": [
                "Jupiter, the planet for luck and blessing will turn direct during this month, and that will fix a lot of emotional issues which you were going through. Your health also will improve, and sleep pattern also will get better. This Jupiter transit also will bring opportunities to get long distance travel, and you will get updates about foreign collaborations. The first mega cosmic event of this month will be the lunar eclipse in Virgo, which will shape up your finances, and a financial situation like you getting bonus, or a payout can happen. There will be some opportunities to sell or release your possessions. You need to safeguard your savings, as there are chances for extra expenses as well.",
                "Venus will be in the ninth house for a long period of time, so you will get many opportunities for foreign collaborations, so, make use of this time to make better connections with foreigners. There will be some learning or programs like cultural exchange, but make sure you are not offending anyone through your blunt speech. You will pursue new courses, visa or immigration process will move forward. Additionally, you will be working in some projects connected to writing and publishing.",
                "Mercury will be retrograde until twentieth, so there are chances for travel blocks, technical glitches and communication issues. Your financial matters will be very important as the newmoon will rise in your eighth house, so there will be new financial arrangement like starting a new loan, starting a joint account, or dealing with shared resources. Some of the secrets may surface gradually, but make sure you don’t forcefully extract someone’s secrets. This newmoon will bring emotional detox process, and healing will be an important process in this phase. If you were going through relationship issues, it will subside in the next six months."
            ]
        },
        {
            "sign": "Virgo",
            "title": "Virgo March Horoscope",
            "content": [
                "The first cosmic event of March, will be the Mars transit into Pisces but the lunar eclipse in your sign will be the major game changing event for you. This lunar eclipse is going to bring a major identity shift, physically and emotionally, so you will try various methods to improve your appearance. The lunar eclipse indicates closures, so you will complete some of the projects, so that you start something new after two weeks when the new moon appears. Until then you will work on yourself, solving some personal issues, and recovering from some health issues too. If you were going through relationship issues, you will find a closure in the next six months.",
                "Your financial matters will be better as Venus will enter Aries, which rules your eighth house, so you will have to plan ahead. Since Venus is the planet for diplomacy, you will handle your financial matters diplomatically, especially if it involves shared resources. There will be discussions about your joint accounts, new loan schemes, tax, PF, and insurance. You will also go for therapies to heal yourself, so there are huge chances for you to meet a healer. However, Mercury will be in retrograde until twentieth, so there will be travel blocks, technical glitched and communication issues too.",
                "The newmoon will rise in the seventh house and that will bring major shift in the relationships. This is the time to start a new personal or business relationship, and it can even be a new job. Mars and Sun are in the seventh house, and both are malefiics, so you will have to be careful with what you do with your partner, and how you speak. There are chances for arguments, and kindly avoid that, otherwise it will bring long term hassles. Mercury retrogression may bring your ex partners back to you."
            ]
        },
        {
            "sign": "Libra",
            "title": "Libra March Horoscope",
            "content": [
                "The month of March will be full of responsibilities for Libra Sun, Moon and rising as the lunar eclipse will occur in your twelfth house, and finances will be very important too. To begin with , Venus, your ruler will move into your seventh house, so, whatever you will achieve, it will be through your diplomatic nature. This Venus will bring some offers for new business, or a new job. The lunar eclipse in the twelfth house will bring serious thoughts about your physical and mental wellbeing. For that purpose, you will take up some healing or new diet too. You will also get some update from the foreign lands, and that can be official or personal.",
                "The direct movement of Jupiter in your tenth house indicates positive career momentum. Past professional difficulties are expected to lessen. Individuals seeking new employment are particularly favored, with increased potential for interview invitations and job offers. Until the twentieth, Mercury's retrograde period advises careful attention to communication, networking, and electronic devices to avoid potential complications.",
                "The new moon will rise in the sixth house, so the workplace will gain importance, and you can expect new projects. This is a complex planetary placement, so you need to be very careful with what you do at work, as there are chances for arguments with colleagues. From the last week onwards, your financial matters also will improve, as Venus will move into Taurus, so there will be sudden financial benefits, and someone will offer financial support too. In the beginning of the month, you will have some expenses, so, you need to be prepared for that. Overall, this month will bring more responsibilities and the universe expect you to be working hard."
            ]
        },
        {
            "sign": "Scorpio",
            "title": "Scorpio March Horoscope",
            "content": [
                "The month of March will witness the direct mode of Jupiter in the ninth house, which will be a kind of solution for most of the problems. Your life will move forward, and most of the blocks will be automatically removed, still, you have some challenges. To begin with, the lunar eclipse will rise in the eleventh house, so, you will complete some projects which you were working for a long time. The impact of the lunar eclipse will last for the next six months, so the completion can take place in this time span as well. Some of your friends or a long term business association will leave you, but new people will come to you.",
                "This eclipse also will bring some expenses for your business, so you need to control that. Venus’s transit will enter your sixth house, will solve the workplace issues, but don’t blindly trust anyone at work, and please keep a hand’s distance from problematic colleagues. Your health also will improve, but kindly avoid junk diet, as the lower abdomen will be sensitive. Job seekers will have the closest opportunity to start a new job as well. You can also expect some opportunities for long distance travel, but Mercury will be retrograding until twentieth, so there will be travel issues, communication problems and technical glitches.",
                "The new moon will rise in your fifth house, and that will bring new business opportunities, but remember Mercury will be retrograde in this house, so please think twice about starting new ventures. If you were discussing about such projects much before the retrogression, then you can move forward. Some unexpected romantic relation can develop, and you may also get chances to meet your ex-lovers. Children will also bring new academic and non-academic projects, and you will support them."
            ]
        },
        {
            "sign": "Sagittarius",
            "title": "Sagittarius March Horoscope",
            "content": [
                "For Sagittarius Sun, Moon and rising signs will have a special focus on your tenth house of career, as on the first week of March will witness a powerful lunar eclipse there. A major turning point in career will come up like you leaving a job, or joining a job after a long gap. Your professional duties will be visible to the public, so make sure you follow the protocols. This eclipse can also put your managers under stress, so you need to be careful when are in meetings. Venus will move into the fire sign of Aries, so the fifth house of children will be active for the entire month. This is a great opportunity for conception and child birth, so couples will have good results in such matters.",
                "Your creative energies will be noticed by people, and there will be someone to support you in this pursuit. New love relation can start or the existing relationship will become sweeter and romantic. You will be attending parties, birthdays, and other social gathering with your friends. Mercury will be retrograding until twentieth so, you will go through communication issues, technical glitches and travel blocks, so make sure whatever you do is error free.",
                "Your family matters will get triggered from the second week onwards due to a powerful new moon. For the next six months, you will plan for relocation or a shift in the workplace. You may plan to buy a house or a rent a property in this duration as the impact of the new moon will last for the next six months. A new family members will come through birth or marriage, as the new moon indicates new beginnings. You will buy some devices for home to improve your lifestyle. There will be family functions, where you meet your relatives and friends too."
            ]
        },
        {
            "sign": "Capricorn",
            "title": "Capricorn March Horoscope",
            "content": [
                "The month of March will witness the direct mode of Jupiter and retrogression of Mercury. The direct mode of Jupiter will be a blessing, as you will see the progress in the relationship. Mercury retrogression will bring technical glitches, communication problems and travel blocks. During the first week itself, a powerful lunar eclipse will occur in the ninth house, so that will bring completion of a course, or you will complete a certification. There will be finalization in the legal process like visa, immigration or foreign travel. This is also the time for spiritual awakening, and you will attend such programs. There will be some conflicts with your mentor figures due to ideological differences.",
                "Venus will impact the fourth house, for the major part of the month, and that will bring renovating the house. You will feel better at home, as there will be more peace and harmony, and you will get more time to spend with family members. You will be buying some furniture, décor, or luxury household items too. There will be family functions, and problem solving sessions at home. However Mercury will be retrogression until twentieth, so there will be technical glitches, communication problems and travel blocks.",
                "The new moon will rise in your third house, and that will bring multiple projects from writing, teaching and publishing. You will start a new blog, vlog or an online course. During this week, you may also try to launch a new social media page, or online marketing campaign. Traveling will be one of the major events during this month, so get ready for unexpected traveling. Siblings, cousins or neighbours will start a new venture, and they will ask some support from you. The neck to shoulder area will be a bit sensitive, and you have to take care of this part."
            ]
        },
        {
            "sign": "Aquarius",
            "title": "Aquarius March Horoscope",
            "content": [
                "For Aquarius Sun, Moon and rising signs, March will bring more focus on financial matters as from various angles the houses related to finances will be activated. A powerful lunar eclipse will rise in your eighth house, so the financial matters will be of utmost importance, and also sensitive. You will also take final decision in the relationships and finances, so, make sure you don’t take any risk. There will be active discussions regarding inheritances also, and you can expect some arguments with your in-laws and own family members too. You will restructure your tax, PF, insurance or loans as well.",
                "Mercury will be in retrogression until twentieth, so there will be technical glitches, travel blocks or communication problems too. Venus will be moving through your third house, so there will a lot of short trips, and it can be for vacations as well. Despite Mercury retrogression, you will have a very good diplomatic communication with people around you. Your ex-lovers or friends can come up, and there will be online or offline meetings. There will be marketing campaigns, writing and teaching related activities online. You may also buy electronic gadgets, and some gifts for your siblings too.",
                "The new moon of March will rise in your second house, so the financial matters will again come into prominence. Please avoid any kind of instant money making plans, as they will fail and will bring zero returns. Prospects for new job is also seen in this month, so please make sure you update your resume in ATS mode and send out. Jupiter will start its direct mode in the sixth house will solve most of the workplace issues, and you will be able to perform better, but please avoid over commitment at work. Throughout this month, you will be looking for making more money."
            ]
        },
        {
            "sign": "Pisces",
            "title": "Pisces March Horoscope",
            "content": [
                "The month of March will be pushing you to focus more on personal life and relationships, as the lunar eclipse will impact the seventh house, and the new moon will rise in the first house. The mega cosmic event of March will be the lunar eclipse and that will bring a culmination in the relationships. Engagement or marriage will be most discussed topic in March, breakups too. Due to the Mercury retrogression, there are chances for your ex-lover to come back. There will be finalisation in business contracts, or negotiations, so you will have to cross check the documents. Retrograde Mercury will bring technical glitches, communication problems or travel blocks.",
                "Venus will impact your financial matters, and that means new job, changes in earnings, and appraisals. There will be an increase in the income opportunities through freelance projects too. You will be spending on cloths, jewellery, or beauty products, and you may even go for cosmetic treatments. During this week, you will open a new savings plan, but make sure they are legit. There will be many opportunities for public speaking and life coaching related opportunities too. However, you can be a bit lazy due to comfort seeking, so please avoid that.",
                "The new moon will rise in your sign showing the strong desire for an image makeover as your sign indicates your entire personality. This is the time for personal transformation, and so health will hold utmost importance. This is the time to take initiatives, so you will start new ventures, and it can be personal or professional. You will redefine your goals, and your friends and family will support you in this pursuit. New Moon indicates new beginnings, so new people will come to your life, and you will be going for social gatherings where your presence will be highly appreciated."
            ]
        }
    ]
}