{
    "horoscopes": [
        {
            "sign": "Aries",
            "title": "Aries January Horoscope",
            "content": [
                "When the new year starts. Sun, Mars, Venus and Mercury will be in your tenth house, and this will highlight your career, public life, and long term direction, so these will be the main stage of activity in January. Visibility will increase and your actions will be noticed by employers, authority figures, clients and the public. There will be important conversations related with work will happen, so, they will lead to clear decisions, announcements or changes in the professional direction. You can also expect meetings, interviews, presentations, and negotiations, which will directly affect your status and responsibilities. The Sun and Mars are natural malefics, and them in the tenth house also indicates potential conflicts, so you need to be careful at work.",
                "On the third, the full moon will rise in Cancer and on eighteenth the new moon will rise in Capricorn. That means your home and career will be the most important themes in January. The full moon will bring some problem solving sessions at home, and you will be working hard to keep balance between home and career. You will also work in home improvement projects, repairs, relocation and renovation. The family members also will need a lot of attention.",
                "During the third week, most of the planets will move into your eleventh house, so you will see this as a great time to join a new organisation, or you getting a new job, or you getting a new friend. The eleventh house indicates your social sphere will be highly active and produce visible results. There will be group activities, collaborations, and team efforts will move forwards, so get ready to attend multiple meetings, planning sessions, and shared projects. Neptune, the planet for illusions will enter your sign, and it can slightly impact your wisdom, so try to be realistic as much as you can."
            ]
        },
        {
            "sign": "Taurus",
            "title": "Taurus January Horoscope",
            "content": [
                "Buckle up your belt for a busy life, as the ninth house will be loaded with multiple planets, and each one has an important role in your life. When the month starts, the Sun, Mars, and Venus will be in your ninth house and on the first, Mercury also will be there. Travelling, short as well as long distance will be the main part of this transit, that will bring exposure to new environments and cultures. Academic pursuits, certifications, courses, or teaching roles will begin, so you will be busy in such preparations. Publishing, broadcasting and writing long form articles also will be the part of this transit. The ninth house indicates learning, so you will start learning, so teachers and mentors will have an active role in your life during this month.",
                "On the third the full moon will rise in Cancer, which will impact your third house, so this will be special day, but remember the full moon is a one day phenomenon, so from the next day, it will be waning. This Moon will support you in completing some work like finishing a project, which will be from communication based domain. There will be a lot of messages, phone calls, and meetings with your siblings, neighbours or network circles.",
                "By the third week, all these planets will shift into the tenth house, so your career will be very significant for the next forty plus days. There will be new opportunities, but multiple planets in one house also indicates challenges like workload, arguments, and multiple meetings. You need to have a proper plan, otherwise there will be confusion and you will not be able to work properly. Unemployed Taurus, Sun, Moon and rising sign natives will have the closest opportunity to have a new job, so make sure you use this opportunity wisely."
            ]
        },
        {
            "sign": "Gemini",
            "title": "Gemini January Horoscope",
            "content": [
                "The first month of this year will teach you to be financial disciplined as majority of the planetary transits will be triggering the houses for financial matters. The Sun, Mars, Mercury and Venus will be in Capricorn, which rules the eighth house, so you will have a lot of financial needs, and this is not a safe month for financial matters. Yes, you are starting this month with some financial hiccups, so you should first save as much as you can, but there will be expenses. That doesn’t mean you will have total loss, but there will be some minor gains, but expenses will be on the higher side. You can also expect private meetings, complex dreams and healing sessions too.",
                "On the third the full moon will rise in Cancer, and that also will impact your second house, and this transit will bring some completions like you withdrawing a fund, or fixing and investment plan. You will have to be careful while investing, as this Moon indicate you finalising a plan, but make sure you do that with the help of an expert. If you were waiting for an interview call or job update this Moon will bring that. Learning and public speaking also can come up.",
                "By the third week, your ninth house will be loaded with multiple planets, so you will have a lot of travelling opportunities. The ninth house indicates higher studies, so you will also be interested in learning new skills, or updating the existing ones. The transit Sun, Mars and Mercury will bring global ventures. Publishing, broadcasting and promotional efforts will gain momentum, and you will be able to place your ideas in front of a large crowd. Neptune will move into the fire sign of Aries, which will impact the eleventh house, so you will also start getting some long term personal and official relationships."
            ]
        },
        {
            "sign": "Cancer",
            "title": "Cancer January Horoscope",
            "content": [
                "The first month of this year will bring multiple events in the relationship sector as multiple planets will be in the seventh house, so the personal and business relationships will be very important. The Sun, Mars, Mercury, and Venus will be moving through Capricorn, so you will have to deal with existing relationship issues, but you should take the inputs from your well-wishers. This transit will keep you in the limelight or right or wrong reasons, so your discretion is highly important. You can also expect contracts, negotiations, parties, and business meets during this week. Single Cancer natives will have the closest chances to find someone they like.",
                "The first full moon of this year will rise in your sign, so this will be a double doze for Cancer Moon sign, but Cancer rising and Sun signs also will get the benefit of this Moon. Some issues in the personal life will end and you will be much relieved. The full moon indicates closures, so you will also get relief from the emotional and physical issues, but make sure you try to detach from the negative people otherwise the issues will continue. You will complete some projects, and change your life style as well.",
                "By the third week, the planets will move into the eighth house, which will be a bit challenging for your financial matters. When multiple planets are in the eighth house, you will have expenses, so you need to save some money. You will also try to restructure your tax, PF, and other financial plans too. This is a complex time for your in laws, so make sure you behave well with them. There are strong chances for getting some financial aid as well. Neptune will move into the tenth house, so at work, you will get some projects which doesn’t have any guidelines on how to work on it."
            ]
        },
        {
            "sign": "Leo",
            "title": "Leo January Horoscope",
            "content": [
                "For Leo Sun, Moon and rising signs, the sixth house of work, and challenges will be active for the major part of this month as these planets will be moving through the sixth house. You will have to be very careful with your work, as there will be multiple projects, and these projects will be very complex. The work environment also will be very challenging, and there are chances for competition at work, so please make sure you keep yourself away from office politics or any unwanted talks. Your health also will be very important, and you need to control bad diet. Job seekers must expand their job search, as there are very strong chances to get a new job.",
                "On the third the full moon of this first year will rise in your twelfth house, that means you will finish some projects behind the scenes. A long running private situation will end, close out or reach a point of no return. It can be someone leaving you, you leaving someone, or some illness ending or end of an expense. There will be matters involving hospitals, institutions, isolation and confidential files. During this time, you will get some intuitive dreams, which will signal you about your future.",
                "The transit Sun, Mars, Venus and Mercury will move into the seventh house on the third week, so the focus will be naturally shift towards relationships, partnerships, one to one dealing. There will be important meetings, discussions, and negotiations will take place, which will lead to clear agreements, commitments, or separations. New partnerships, from personal and professional life will come up, and you will meet new people through meet ups. Single Leos will have the closest opportunity to find an ideal partner. You will also get new opportunities for foreign collaborations as well."
            ]
        },
        {
            "sign": "Virgo",
            "title": "Virgo January Horoscope",
            "content": [
                "Virgo Sun, Moon and rising natives will start this month with a very playful note as the Sun, Venus, Mars and Mercury will be in the fifth house of creativity. Being a Virgo, you are a bit stubborn, but the planetary transits will bring the creative and fun person within you. Single Virgo Sun, Moon and rising signs will have the closest opportunity to start a new relationship. Creative projects will move into active production, promotion or public display, and it will need constant effort. You will have a lot of activities with children, and if you are a parent, you will attend academic and non-academic activities with children or you will be busy with team events which involves youngsters.",
                "The first full moon of this year will rise in the water sign of Cancer, and this lunation will result, conclusions, and developments within friendships, groups and long-term goals. A group project, collaboration, or team effort will reach completion, announcement or final outcome. Some of your friends leave you for a new group or you will leave a group, for better growth. This is a complex time for your long term projects, as some projects may end without a notice.",
                "From the third week onwards, the Sun, Mars, Mercury and Venus will be in your sixth house, which will bring some competitive events like interviews, debates, or sports events. From the third week onwards, the work atmosphere can be a bit challenging, so make sure you stay away from judging anyone at work. Job seekers among you have the closest chances to get a new job, so use this time wisely. The lower abdomen will get some sensitiveness, so you have to take care of your diet as well. You need a better plan for your daily activities, otherwise you will be worried about the deadlines."
            ]
        },
        {
            "sign": "Libra",
            "title": "Libra January Horoscope",
            "content": [
                "The first full moon of this year will rise in Cancer, which rules your tenth house of career, which will be a very significant event in your life. Some of the projects will get finished, as the full moon indicates completions. This can also be like you leaving a job in the next six months as the impact of the full moon will last for six months. The focus will be on you and if you were doing well, then you will get public attention in a positive manner, otherwise this Moon phase can bring complex events. Your managers and people in authority will give you more inputs.",
                "The Sun, Mercury, Venus and Mars will be in the fourth house, so your family matters will be of utmost importance during this month. These planets will be bringing repairs, and other home improvement related activities, like buying a new device for home, or replace a device. Signing real estate documents, meeting with a builder, or try to get a loan for construction or renovation. There are malefic planets involved in this, so there will be some arguments at home, so you need to be very careful. You can also expect some guests at home, or you will be also going to meet someone.",
                "From the third week onwards, the planets will move into the fifth house, from then onwards you will get more chances to interact with youngsters, so there will be more energy within and around you. You will plan for team ventures, rooted in creativity, and hobbies. However, you should not get involved in any risky ventures, which involves huge investment. Single Libran natives will think about start dating, and they will aggressively search for someone online too. This is a very good time to attend social gatherings for fun and entertainment too."
            ]
        },
        {
            "sign": "Scorpio",
            "title": "Scorpio January Horoscope",
            "content": [
                "When the new month starts, your third house will be loaded with multiple planets, so this is definitely going to be a very busy one. You will be very busy in communicating with your team mates, friends, network circles, and siblings, and it can be online or offline. You will go for long as well as short trips, alone or with friends for study, job or personal purposes, but there are chances for blocks too. Throughout the month, you will have projects from writing, teaching, counseling and networking also. Those who waited for a transfer will have the closest chances to get that, so they should use this opportunity.",
                "The first full moon of this year will rise in the water sign of Cancer, which will impact the ninth house of higher studies and belief systems. You will be interested learning spiritual and philosophical matters, which will help you dealing with your life’s crisis. This transit can also highlight some legal issues, that doesn’t mean you will be the party to a legal issue. Publishing, training and foreign collaborations will be the part of this transit for sure, and you will get some updates from the foreign lands too. There will be more interaction with your gurus, mentors and fatherly figures.",
                "From the second week onwards, the Sun, Mars, Mercury and Venus will be moving into your fourth house, which indicates changes at home and important events. You will be working hard to maintain peace and harmony at home, but there will be some issues which needs immediate attention. This is also a time for various real estate deals, home improvement, and relocation. You will also buy some devices to improve your standard of living too. These planets will aspect the tenth house, so you will have some important meetings at work, and new projects can also come up."
            ]
        },
        {
            "sign": "Sagittarius",
            "title": "Sagittarius January Horoscope",
            "content": [
                "The financial matters are very important as multiple planets are in your second house, so you will have to be careful with your money. You are not supposed to take any risk, otherwise there will be financial issues throughout this month. This is not the time to take up any new financial plan, but this is a good time to review your existing financial matters and get feedback from a financial consultant. The transit Sun, Mars, Mercury and Venus will surely bring some gains, but there will not be a balance between gains and expenses. Please try to control your speech as well, otherwise you will have to argue at home as well as at work place. Job seekers will get new job, or a part time job, so this will be a of a great relief.",
                "The first full moon of this month will rise in the water sign of Cancer, which will impact your emotional self. You will try to review your tax, PF and insurance related plans. This transit also will bring full stop to a relationship, and it can be personal or business. The communication with in-laws will be very emotional, and you can also expect arguments based on money and property too. You will pay back a full loan amount or someone will give you a financial aid.",
                "On the third week, the Sun, Mars, Mercury and Venus will bring an impact on your third house, so you will become very busy from then onwards. There will be multiple tasks, travelling, and communication. This is the time to discuss about your business ventures, or you will make some plans for own ventures too. Travelling, enrolling for a course, or teaching also will be the part of this transit. During this month, your health can also have some minor issues, which will vanish after this transit."
            ]
        },
        {
            "sign": "Capricorn",
            "title": "Capricorn January Horoscope",
            "content": [
                "The first month of the new year will be very important for you as the Sun, Mars, Venus and Mercury will be in your sign, so this is a game changing month for you. You will have new events like you meeting new people, and forming new alliances. There will be a desire to have a new hair cut or changing your style so that you can have an image makeover. Single Capricorn natives will have the closest time to find someone special too. However, due to multiple planetary transits, you can have minor health issues like headache or weakness too.",
                "The first full moon of this year will rise in the water sign of Cancer, which will trigger your seventh house of relationships. The full moon indicates completions, so you will complete a cycle and it can be in a relationship, official or personal. The impact of the full moon will last for the next six months, so you can expect significant changes in the relationship sector for the next six months. Those who are going through a relationship crisis, will find a solution for that. The full moon in the seventh house also shows you will leave a team, a relationship so that you can start a new one. Additionally, you will attend social gatherings, parties or business meets.",
                "The Sun, Mars, Venus and Mercury will move into the second house from the third week onwards, and from then onwards, your financial matters will be very important. You will complete a financial plan, like breaking a fixed deposit or start a new investment plan. Multiple planets in the second house indicates expenses, so for the next thirty plus days, expenses will be on the higher side. This is not a great transit for financial matters, so make sure you save some money for the bad days. You can also expect new job, part time projects or freelance work."
            ]
        },
        {
            "sign": "Aquarius",
            "title": "Aquarius January Horoscope",
            "content": [
                "The first month of this year, may start a bit slow as the Sun, Venus, Mars and Mercury will be in your twelfth house, which indicates isolation and detachment. These planets are asking you to be a bit careful as they are moving through the twelfth house, so you will naturally feel detached. That doesn’t mean you will be left out, but you will choose to stay away from the crowd, so that you can be peaceful and happy. The sleep will be full of intuitive dreams, which can give you some signals about the future. Prayer, meditation, and healing also will be the part of this transit",
                "The first full moon of this year will rise in the sixth house of work and colleagues, so you will complete some projects. It can also be like you finding a new job in the next six months, after leaving the current job. The impact of the full moon will last for the next six months, so get ready to embrace this energy to make significant changes at work. Your lower abdomen can also have some irritation, so make sure you have a good diet. At work you will have to stay alert, as the colleagues will be very demanding too.",
                "From the third week onwards, your personal life, and health will gain more focus as the Sun, Mercury, Mars and Venus will move into your sign, and this is the solar return time for Aquarius Sun signs. Still Aquarius rising and Moon signs also will get the benefit like new beginnings in personal and business relationships as well. You will go for a makeover like changing a new hair cut or buying new dresses for yourself. People will appreciate your presence, but you will also have a harsh speech due to the presence of the Sun and Mars."
            ]
        },
        {
            "sign": "Pisces",
            "title": "Pisces January Horoscope",
            "content": [
                "When the new year starts, the Sun, Mars, Mercury and Venus will be in your eleventh house, so you will find new long-term opportunities which will be a positive event for you. These long-term relationships can be official or personal, so that means you have the chances to get new friends, new job or a new long-term project in the existing job. You will get some updates from the foreign lands, or you will meet some one from the foreign lands. This month will be full of group meetings, online or offline too. You will also get some support from your friends or elderly siblings.",
                "The first full moon of this year will rise in the water sign of Cancer, so you will be working hard to complete some projects with your creative skills. The full moon indicates completions, so for the next six months, you will complete a long-term project, so that you can start something new. If you are a parent, you will fulfill the desires of your children, like helping them to complete an academic and nonacademic project. If you are committed, then you will take the relationship into a next level, or if you are going through a relationship issue, you will settle it.",
                "From the third week onwards, the Sun, Mars, Mercury and Venus will be in your twelfth house of isolation and detachment, and that will bring a feeling of isolation. You will choose to be alone so that you can recharge your batteries to receive the next solar return. These planetary transits will make you like a philosopher, or a spiritualist, as you will be interested in both. You will visit people lives in isolated places like hospitals or counseling centers and comfort them. The sleep will be full of dreams, and they will signal you about the future."
            ]
        }
    ]
}