{
    "horoscopes": [
        {
            "sign": "Aries",
            "title": "Aries Weekly Horoscope Starting December 21",
            "content": [
                "The last full moon of this year will rise in Gemini, which rules your third house, so this is a potential time for transfer or relocation for those who wanted both. However, this full moon will bring a lot of communications, which can be about new team associations, short projects, and short trips. Some important messages will be delivered through friends, network circles or siblings. The full moon indicates completions, so you will finalize some paper work as well. It's normal to have distraction during the full moon as you will have to focus at multiple things. You have to take care of your health, so that you can be active, especially the neck to shoulder area will be very sensitive.",
                "Mercury is still moving through the eighth house, and it will soon move into the ninth house. You will have financial issues, and that should be the main focus during this week. Since Mercury indicates communication, you will discuss multiple financial matters regarding tax, PF and insurance. There will be some paper work as well, and you will submit some financial plans for approval. This is a good time for sharing your emotional woes, and go for healing as well. You can also expect sudden changes, and sudden expenses too.",
                "The Sun, Mars and Venus are moving through the ninth house, so you will feel confident and optimistic despite the situation. There will be multiple opportunities for long as well as short distance travel, which can also come up spontaneously. You will also attend some religious and spiritual functions in a distant place as well. Learning, teaching, and knowledge sharing will be the part of this transit as well. This is a very good time for those who work in the foreign countries, as foreign collaborations will get new opportunities."
            ]
        },
        {
            "sign": "Taurus",
            "title": "Taurus Weekly Horoscope Starting December 21",
            "content": [
                "The last full moon of this year will rise in the air sign of Gemini, so you will focus more on financial matters. The full moon indicates completions, so you will finalise an investment plan during this full moon phase. The impact of the full moon will last for the next six months, so you have enough time to choose your financial plans. You may also close a loan, or help someone financially, but make sure you are not risking your financial stability for others. Gemini Sun, Moon and rising signs also will try to get a new job, or update their skills so that they can get a new job.",
                "Mercury is moving through the seventh house of contracts and business associations, so you will be working hard to form new business associations. This transit will bring potential business partners, so you will have the closest opportunity to meet such people. Mercury indicates communications, so you will have a lot of conversations, but make sure you don’t share any of your private information with anyone. There will be negotiations connected to business partnerships, clients or legal experts. You will also attend some public gatherings like parties, or you will have foreign collaborations.",
                "Martian aspect will fall on your tenth house, so you will focus on your career, and you want solid results from your work. This transit will bring a lot of work related pressure, but you will also be trying to get more work. Job seekers will have the closest opportunities to get a new job, but the interview process will be very hard. Mars is a fiery planet, so you will be a bit aggressive at work, but that will not help you at work. You will also get many opportunities to get long term projects, and get new friends too."
            ]
        },
        {
            "sign": "Gemini",
            "title": "Gemini Weekly Horoscope Starting December 21",
            "content": [
                "This is a very special week for you as the last full moon of this will rise in your sign, and this Moon will help you in settling some of your personal issues. The full moon indicates completions, so you will complete a cycle of events in the next six months. Some of your health issues also will diminish, and you can expect a total relief in the next six months. If you are going through any relationship issues, those issues also will come down in the next six months. You will also try to change your style and appearance by doing an image makeover.",
                "Transit Mercury is moving through the sixth house, and that will bring more work, and team discussions at workplace. During this week, you will focus on the projects, and they will be highly complex and you need to look at every detail. The rate of communication will increase, but make sure you don’t take part in any kind of unhealthy talks at work. Your diet and health will be very important, so you should control your diet. This Mercury transit will push you to address some conflicts or legal issues, and it can also be in your favour.",
                "The Sun, Mars and Venus will impact the seventh house, so your relationships will be important. Important conversations will happen with your spouse, and you have to be patient as the Sun and Mars will make you very aggressive. Since Venus is also present here, so you will be able to solve the relationship issues, and you will be able to support each other. You will also attend social gatherings like business meets and personal functions, where you meet new people. Some business associations will come quickly, and you have to take quick decisions too. This is also a great time for those who work in fashion, media and foreign collaborations."
            ]
        },
        {
            "sign": "Cancer",
            "title": "Cancer Weekly Horoscope Starting December 21",
            "content": [
                "The last full moon of this year will rise in Gemini, which rules your twelfth house of isolation and detachment. There will be a natural push to go into isolation and meet people in private as the twelfth house indicates isolation and detachment. There will be some updates regarding your foreign collaborations, which was delayed. The full moon indicates completions, so you will get relief from some of your emotional and physical issues. The impact if the full moon will last for the next six months, so you will find more peace and happiness in the coming days. You will have dreams which will be very intuitive and they will highlight you about your future.",
                "Mercury is moving through Scorpio, which indicates more creativity, and time with youngsters. You will have a lot of communications with your team members regarding a new creative project and they will support you. These projects will advance through writing, brainstorming, promotion or public sharing of ideas. There will be growth in business, but make sure you are not taking any risk while taking up big projects. If you are a parent, you will spend more time with children, otherwise Cancer Sun, Moon and rising will spend more time with youngsters. This is a potential time for single natives to find someone special. There will be team gatherings like parties, or variety entertainment purposes.",
                "The Sun, Mars, and Venus are moving through the sixth house of work and colleagues so there will be some complex projects at work. Your workload is going to surely increase, and responsibilities will need consistent effort, so you will have to be proactive. Some delayed tasks will move into execution, and you will have to meet deadlines. There will be some conflicts at work place, so handle them wisely and stay away from all kind of unhealthy talks. New job opportunities can also come up, but make sure you don’t quit your job out of your emotion. Your lower abdomen can be a bit sensitive too."
            ]
        },
        {
            "sign": "Leo",
            "title": "Leo Weekly Horoscope Starting December 21",
            "content": [
                "The last full moon of this year will rise in the air sign of Gemini, which bring completions in some long term projects. The full moon indicates endings, and the impact will last for the next six months, so you will release some of your work to the public in the next six months. The eleventh house where the full moon is sailing indicates organisation, community or social network, so some of them will shut down, or some facts about them will get revealed. You will quit a team or some of your friends or team mates may leave your company during this lunation. This full moon will clarify what aligns with your future plans, and you will be prepared to start a new long term project in the next new moon day.",
                "Transit Mercury is moving through the fourth house, so it will bring some developments at home, family and in property matters. There will be some conversations with family members and you all will sit together and take some decisions regarding family disputes, real estate deals, or renovation. Some of you also may go for relocation or even try to change the country. There will be short or long trips connected to family matters. During this transit, you will also attend some family functions or conduct some at home.",
                "The Sun, Venus and Mars are moving through the earth sign of Capricorn, so you can expect some events connected with children. If you are a parent, there will be a lot of responsibilities connected with children. If you are a single, you will be mostly with youngsters and there will be team gatherings too. Single Leo, Sun, Moon and rising natives will have the closest opportunities to meet someone special, ad to start a new relationship. Creative projects will move forward, but there will be some challenges as well."
            ]
        },
        {
            "sign": "Virgo",
            "title": "Virgo Weekly Horoscope Starting December 21",
            "content": [
                "The last full moon of this year will rise in the air sign of Gemini which rules your tenth house, so your workplace is very important. The full moon indicates endings, so a professional matter will end, or you will complete a project now or in the next six months. The impact of the full moon will last for the next six months, so you have a long time to complete a project. If you are giving an interview during this week, the process or update will get delayed for the next six months. You will also get recognised for your past efforts as well, but there are chances for you leaving the current job as well.",
                "Mercury is moving through the third house, so you will be very busy week this week, as there will be a lot of activity. There will be messages, calls, emails, and meetings, and they will require quick responses too. You will have important conversations with siblings, neighbours, colleagues or acquaintances, and they will end in some concrete decisions. This is a week to conduct study workshops, paperwork, for your upcoming projects. You will also get opportunities for short as well long trips, online and offline meetings too.",
                "The Sun, Mars and Venus will impact the fourth house, so there will be more responsibilities at home. There will be a lot of conversations at home, regarding an existing issue. The Sun and Mars are natural negative planets, so you will have some concerns regarding the relationships and elders at home. There will be home improvements regarding discussions, relocation or you may even plan to leave the country. You will also have some civil disputes, and if you are not patient, this issue will become aggravated. There will be family functions, or some of your friends will come to your home."
            ]
        },
        {
            "sign": "Libra",
            "title": "Libra Weekly Horoscope Starting December 21",
            "content": [
                "The last full moon of this year will rise in your ninth house, as it is in Gemini, so your faith and belief system will be very important. There will be some spiritual or religious functions, where you meet enlightened people and you will learn from them. Foreign collaborations and some updates from the foreign lands also will come up. The full moon indicates completions, so you will get the results of the exams, and you will finalise some courses, you will take some certifications as well. Those who were searching for a publisher will get the best publisher and get their work published. Media related projects, learning and coaching also will be the part of this week.",
                "Mercury is moving through Scorpio, which will impact your financial matters, so get ready to solve some of your financial issues. There will be some discussions about your investment plans, loans and new business plans. This is a great time for business owners, as they will try to get new business partners or expand their own business. There will be discussions with financial consultants too, you will buy new devices or there will be some purchases for your home or for business too. During this week, you will be talking to more people, and life coaches also will get new work.",
                "The Sun, Mars and Venus will move through the third house, which will impact your third house, so you will have short trips, or you will have some options for transfer as well. This is a busy time for you as the third house indicates multitasking, so you will have a lot of work from personal and professional domain. You will also take up own ventures, and freelance projects too. There will be a lot of discussions with siblings, network circles and team mates as well."
            ]
        },
        {
            "sign": "Scorpio",
            "title": "Scorpio Weekly Horoscope Starting December 21",
            "content": [
                "Financial matters will be the highlight of this full moon as it will rise in the air sign of Gemini, which rules the eighth house. There will be some discussions regarding finances, loans, tax, PF and insurance. The full moon indicates completions, so you will complete some financial transactions. It can be like full repayment of a loan, you getting some approvals, or starting a joint account. The Moon indicates emotions, so you will be a bit emotional about your personal life. Those who going through relationship issues will try to solve them through discussions, and you will get more time to solve them.",
                "Mercury is moving through your sign, so there will be more focus on your communication, and personal life. You will start some conversation about a new relationship, and it can be personal or professional. You will also try to move out from your current location or transfers and short trips also can come up during this time. Mercury is the planet for multitasking, so you will have multiple tasks during this phase, which can make you a bit restless, and scattered. You will also try to change your appearance, and update your style. Meetings, public appearances, and online meetings also can come up during this phase.",
                "The Sun, Mars and Venus will be moving through the second house of money matters, so you will have a lot of work regarding your investments. Venus will surely bring gains, but there will be some expenses as well as the Sun and Mars are natural malefics. So, there will not be a balance between gains and expenses, but you will be able to manage. You will try to find a new job, part time job or a freelance job during this time, and it is very much possible to get it."
            ]
        },
        {
            "sign": "Sagittarius",
            "title": "Sagittarius Weekly Horoscope Starting December 21",
            "content": [
                "The full moon will rise in the air sign of Gemini, which rules your seventh house, so your relationships will be important for the next six months. For the next six months, you will try to set new goals in the relationships. If you are a single you will try to end your single hood in the next six months, if you are a committed person, you will take up your relationship to the next level like getting engaged or married. If you were going through some physical issues, that will end at any time within the six months. This is the time to evolve as a new person.",
                "Mercury, the planet for communication and media will impact the twelfth house, so you will have some concerns regarding your wellbeing as the twelfth house indicates isolation and detachment. You will be interested in studying science, fiction and spiritual matters. This is a good time to go for healing, and meditation, which will bring some happiness in you. You will get some updates about your foreign collaborations or long trips as well. Mercury will aspect the sixth house of work and colleagues, so there will be a lot of communication with them as well.",
                "The Sun, Mars and Mercury are moving through the first house, so your personal life is also important. From various angles your personal and spiritual life will be going through a transformational phase. The transit Sun will show you what you need to update and whether you need to upskill. This is a good time to go for a makeover session, which can boost your image, confidence and ego too. The Sun and Mars in the first house are natural malefics, so there are chances to get ego clashes with your dear and near ones."
            ]
        },
        {
            "sign": "Capricorn",
            "title": "Capricorn Weekly Horoscope Starting December 21",
            "content": [
                "The last full moon of this year will rise in the air sign of Gemini which rules your sixth house, so you will have important events connected to your work and colleagues. This is a complex time, as the full moon in the sixth house indicates complexity, so make sure you are careful with your work. You must take care of your responsibilities as there are chances for reviews and feedbacks. Please make sure you complete your tasks with perfection, and discuss with your experts. Your lower abdomen also will be a bit sensitive, so you have to take care of your diet.",
                "The transit Mercury is moving through the water sign of Scorpio, which indicates some chances in your long term relationships , which are personal or professional. Scorpio is the sign of ups and downs, so there will be a fluctuation in the team settings, and there are chances for arguments. You will look for new team settings, and you will get it as well. Job seekers will surely get some interviews so, they should prepare themselves for better performance. During this time, you will set some long term goals for your personal life as well as career. You can expect new long term associations, new friends and social gatherings too.",
                "The Sun, Mars and Venus are moving through the twelfth house, so you will have some challenges regarding your emotional self. This is a good time to go for spiritual and philosophical matters, so you will have to use this time to strengthen you spiritually and emotionally, as sometimes things will not go per your expectations, but your situation will improve. The time is a bit complex, so make sure you submit yourself in the hands of the universe. You will also get some updates from the foreign lands, and there are chances for foreign trips as well."
            ]
        },
        {
            "sign": "Aquarius",
            "title": "Aquarius Weekly Horoscope Starting December 21",
            "content": [
                "The full moon will rise in Gemini, which rules your fifth house of children and creativity, so you will have a lot of activities with your children and youngsters. This vibrant energy will make you a part of entertainment programs, team ventures and this will be a good time for parents and children. The fifth house indicates creative self-expression, so you will complete some creative projects. There will be updates about children’s projects, and you will support them. This is a complex time for those who are going through a relationship issue, as there are chances for them to improve or call it quits in the next six months.",
                "Mercury is moving through your tenth house, so there will be a lot of communication at work. This is a busy time for you as there will be a lot of small tasks, and it can eventually take your time. This is a good time for job seekers, as they will get some opportunities for interviews and debates where you will be able to present the facts. You will also get new projects in the existing work too. Mercury will aspect the fourth house, so you will have work from home opportunities as well.",
                "The Sun, Mars and Venus are moving through the eleventh house, so you will get good chance to join a new team. There will be a lot of work with team, and collaborative activities with the team mates. Online and offline discussions will be plenty and you will get some clear ideas about your long term goals as well. This is a good time for those who work in fintech, IT and edtech companies too. However, there are chances for ego clashes with your team mates as the Sun and Mars are moving through the eleventh house."
            ]
        },
        {
            "sign": "Pisces",
            "title": "Pisces Weekly Horoscope Starting December 21",
            "content": [
                "The last full moon of this year will rise in the fourth house so there will be some completions at home. It can be like you settling down some issues, and you completing some formalities at home. There will be relocation or home improvement projects as well. The impact of the full moon will last for the next six months, so you will have a long term to complete the tasks at home. You will conduct family meetings, and there will be work from opportunities too. Some of your relatives will move abroad, or you will go for foreign collaborations too.",
                "Mercury is moving through the ninth house, and that will make you inquisitive about foreign collaborations, spirituality and higher studies. You will be interested in learning spiritual and philosophical matters, and you may even enrol a course. This is a good time to discuss your thoughts with others and share it with a larger group of people. Learning, writing and publishing also will be the part of this transit, and you will be appreciated or your work. Foreign collaborations, foreign trips and discussions with an international community is also shown during this time. Altogether, this is a good transit for your spiritual, emotional and philosophical pursuits.",
                "The Sun, Mars and Venus will be impacting the tenth house, so your career front will be very important. You will get new opportunities, so this is a good time for job seekers, so you will have to prepare yourself to give your best in those interviews. For professionals, this is the time for reviews and feed back too, so make sure you performance is clean. During this week, you will work hard to get into the good books of your managers. Those who work in politics, admin and creative sector also will get new opportunities."
            ]
        }
    ]
}