{
    "horoscopes": [
        {
            "sign": "Aries",
            "title": "Aries December Horoscope",
            "content": [
                "The first transit if this month will be the full moon in Gemini, which rules your third house of communication and siblings. The full moon indicates closures, so you can find some endings related to a project, or you will get a reply for an important conversation which can be online as well. This full moon will bring some changes in the short rem plans, like shift in your work schedule, a sudden travel opportunity, and some important conversation with your siblings. On the nineteen the new moon will rise in your ninth house, which will bring multiple projects from communication related domain like teaching, preaching or travel opportunities. Due to these moon phases, December will be very busy and you will be travelling and working a lot.",
                "Mercury will enter Sagittarius on eleventh, and that will make you travel for sure. This Mercury will make you curious about foreign collaborations, so you will book a trip, or unexpected travel opportunities. This month is full of such opportunities, so keep your bag packed. There will be chances to learn a new course, start some research, or there will be some legal work too. Spiritual matters also will be important, and you can also expect foreign collaborations.",
                "The Sun, Mars and Venus will be in the tenth house for a major period, so, your career will evolve. If you are an unemployed person, you will have many opportunities to have new job opportunities, so get ready to attend interviews or such sessions. You will go through evaluation tests, so please prepare yourself to face that. Those who work in sports, armed forces, police, admin and creative sector will have multiple opportunities as well. However, two fiery planets, the Sun and Mars will be in the tenth house, so you will be furious and your managers too, so try to control your aggressiveness, otherwise there will be workplace issues."
            ]
        },
        {
            "sign": "Taurus",
            "title": "Taurus December Horoscope",
            "content": [
                "The first transit of December will be the full moon in Gemini, which will rise in your second house of finances, and the new moon also will rise in the eighth house of finances. So, this entire month will be important for your financial matters, so please cut off your expenses. The full moon indicates endings, so you will complete some payments or you will be spending on something. This is not a great month to start a new investment plan too. There are chances to get a new job, parttime or a contract job too. You will also discuss the possibilities of new loans, or taking a new tax, insurance of PF related plan.",
                "Mercury will enter your eighth house on eleventh, which is again showing the importance of money matters. Since Mercury is the planet for communication, you will be mostly communicating about the financial matters. There will be communication regarding new loans, tax or PF, and you will be making some transactions but you have to be careful. Please don’t forget to document all these expenses, and file them, as you will need them later. Sudden expenses will be inevitable during this month. You may also have a breakthrough in therapy, open up someone about long held concern.",
                "The Sun, Mars and Venus will be in the ninth house for a long term, so you will have a spiritual inclination throughout this month. You will spend time in healing practices, go for spiritual trips or meetings. You will take bold actions like taking up a new course, booking a trip or fighting for your beliefs. Foreign collaborations will be coming up, so, get ready to get some benefit from that. There will be events like long trips, publishing, dealing with legal or immigration matters too. This trio in the ninth house can also spark passionate debates, sudden clarity about your life’s direction, or opportunities for personal growth."
            ]
        },
        {
            "sign": "Gemini",
            "title": "Gemini December Horoscope",
            "content": [
                "The month of December is going to be very important as the full-on will be in your sign. This is the time for regeneration as the full moon will bring self-awareness, emotional clarity and a strong urge to express your identity. This will lead to personal breakthrough, and some endings too, especially in something connected to your personal life. You will try to bring some changes in your appearance too. The new moon will rise in your seventh house and that will mark the beginning of relationships, romantic or professional. This lunar phase will bring fresh agreements, reconciliations or new partnerships too.  \nMercury will be in your seventh house, so you have a lot of opportunities to be visible in social gatherings. There will be a lot of conversations, especially about new contracts, and you will not hesitate to express your needs. If you are a single, this transit can spark meaningful conversations, networking, or introductions, making it a strong time for meeting someone. You will also sign agreements, renegotiate terms, or have crucial talks with coworkers or clients. This Mercury also will bring opportunities to attend meetings, like business meetings or parties for personal matters. Unemployed natives also have a chance to get a new job.",
                "The Sun, Mars, and Venus will be triggering your eighth house, so you will have important conversations regarding money. You are not on the safe side, so please control your expenses throughout the month. Especially Mars is the planet for financial liabilities so you will have multiple expenses, and make sure you control them. Otherwise, there will be financial issues for the new year as well. Venus will surely bring some money, but expenses will be more than gains. You will communicate about new tax, PF and insurance related plans as well. This is not a great month to start new investment plans too."
            ]
        },
        {
            "sign": "Cancer",
            "title": "Cancer December Horoscope",
            "content": [
                "The month will start with a powerful full moon in Gemini, which will trigger your twelfth house, and on nineteenth, a new moon will rise in your sixth house. These lunar phases are telling that your emotional self, health and workplace will be highly important during this month. The full moon will mark endings for some sufferings, and this is the time for renewal. This Moon will make you highly intuitive, and you will have dreams which will signal you about your future. Your lower abdomen also will be a bit sensitive, so avoid any kind of bad diet. There will be new projects at work, which will be a bit complex.",
                "Mercury will move into Sagittarius, which rules your sixth house on the fifteenth, and that will bring a lot of competitive projects at work. You will become more analytical, organised, and eager to solve problems, which will improve your workflow. There will be activities like setting a new schedule, organising your workplace, or streamlining tasks. You will also have discussions with your colleagues, but make sure you are having healthy conversations. Unemployed Cancer natives will have the closest time to get a new job as well. This Mercury will aspect the twelfth house, which will also help you to get some interested in science, technology and spirituality as well.",
                "The Sun, Mars and Venus will be in the seventh house for a long term, so your personal and professional relationships will go through a transformation. Being a Cancer, you like to rely on others, but during this transit, you will understand the meaning of self-reliance. The Sun and Mars are separative planets, so there will be some issues in the existing personal or professional relationships. Please try to avoid clashes, and try to keep your dignity. You will also be going for social gatherings and business meets."
            ]
        },
        {
            "sign": "Leo",
            "title": "Leo December Horoscope",
            "content": [
                "The month of December is full of opportunities for Leo Sun, Moon and rising signs, as the fulminant new moon will rise in eleventh and fifth houses. The full moon indicates endings, so during this month, you will complete some projects, and you will take up new long-term projects too. If you were planning for a new business, during this month, you will have final decisions regarding that. This full moon will bring some completions regarding children as well. New love relation can come up and some endings related to old love affairs also will come up. This month will be full of online and offline meetings and long-term planning.",
                "Mercury will enter Sagittarius, which rules your fifth house, that will bring a lot of communication regarding your creative skills. You will try to promote yourself as much as you can using all kind of media, and your efforts will be fruitful in the near future. People will notice your skills, so don’t let any opportunities for self-promotion go in wain. Parents will have more time with children, as the children will have an academic and non-academic projects. Networking will happen a lot throughout this December, and you will go for some entertainment programs too. The Sun, Mars and Venus will be impacting the sixth house of work, colleagues and health, so you will have multiple tasks at work, which will be very complex.",
                "The transit Sun and Mars are separative planets, so you will have to be careful with your colleagues. Venus will surely soften the intensity by making your daily routines enjoyable, it will bring solution for workplace issues, and it will also encourage self-care. You will take up new diet, and make sure you have a good diet as well. Some of you will adopt new pets as well."
            ]
        },
        {
            "sign": "Virgo",
            "title": "Virgo December Horoscope",
            "content": [
                "The month of December will have important events at home as well as at work. On the first week itself, the full moon will rise in the air sign of Gemini, and o fifteenth the new moon will rise in Sagittarius. The full moon indicates completions, so you will complete some projects at work. The full moon will reveal the results of your past efforts-recognition, completion of a major project, a shift in professional direction or important discussions at work. The new moon will surely bring home improvements, moving plans, deeper bonding with family or redefining what home means to you. Together this lunation will highlight the need of balance between your responsibilities and family.",
                "Mercury will move from Scorpio to Sagittarius and this transit will take place on eleventh. Until eleventh, you will have a lot of travelling, and short projects from communication related projects. You will enrol in a course, write an article, publish it or go for a short trip. After that Mercury will be moving into the fourth house so, you will receive guests at home. This Mercury also will bring some problem-solving sessions at home too. However, Mercury is a restless planet, so it will bring some overthinking nature too.",
                "The Sun, Mars and Venus will be moving to the fifth house, so you will be very creative, passionate and expressive. This is a bright transit for single natives to find likeminded people as Venus is also is here, making them romantic. The Sun will help you to reconnect to your hobbies, talents and activities which will spark happiness. Mars will make you a bit aggressive, so there are chances for some clashes within your team settings. This is a golden opportunity for childless couple to go for treatment too. Children will have better bonding with children as well."
            ]
        },
        {
            "sign": "Libra",
            "title": "Libra December Horoscope",
            "content": [
                "The first event of the last month of this year will be a full moon in the ninth house, on fourth, and the new moon will rise in the third house on nineteenth. These lunations will have a very strong impact on your life, so traveling will be one of the most important events in December. These trips can be short or long ones, so get ready for that. You will complete writing and publishing your articles, or you will start learning a new course. There will be important conversations with your siblings, gurus and mentors. Updates from foreign lands and foreign collaborations also will be the part of this month.",
                "Mercury will be moving from second house to the third house, so for the first few days, you will need more money. You will continue spending until eleventh, but after that the expenses will be coming down. After that you will have a lot of work, you will have to be careful, as you may miss some projects due to the workload. This transit will bring meetings which can be online and offline too. If you were looking for transfer or interdepartmental changes too. This is going to be a very busy month, so you need better planning.",
                "The Sun, Mars and Venus will be moving through your fourth house, so, this is the time to make some changes into your home. There will be some real estate deals, as Mars, the indicator for real estate deals is in the fourth house. There will be selling and buying land or buying some important devices for home as well. There will be events like repairing things, renovating, relocating or confronting long-avoided emotional patterns.  There will be guests at home, or you will be visiting some of your friend’s or relative’s house too."
            ]
        },
        {
            "sign": "Scorpio",
            "title": "Scorpio December Horoscope",
            "content": [
                "The first planetary event of this month will be the full moon on fourth in your eighth house, and the new moon will rise in the second house on the nineteenth. These lunations will have a huge importance in your finances, as both are triggering the houses for finances. To start with, the full moon will bring endings in the financial formalities. You were going through some emotional traumas and that will be ending during this day. Please avoid any kind of lending and borrowing, as your calculations can go wrong. You need to have some financial back up, as the expenses will be the major theme of the entire month.",
                "Mercury will also enter the second house, so you will have a lot of conversations about new income generation methods. You will start sending resumes, and you may also get some interview calls. There are sure chances for fulltime job, part time or contract job as well. The second house indicates speech, so you will also get opportunities for public speaking too. During this time, financial consultants to start a new financial plan, but make sure you wait until the third week of December to join such plans. You will also get opportunities for enrolling a new course.",
                "The Sun, Mars, and Venus will impact the third house, so you will have a busy life as the third house indicates multitasking. There will be multiple opportunities for learning, knowledge sharing, speaking, writing and publishing your articles. You will try to start new projects, pursue ideas, and there will be travelling opportunities as well. Short trips, transfers and interdepartmental transfers also will be the part of this transit. Siblings and neighbours will be having important events in their life, and you will be a big part of that. This is a very busy month, and you can expect a lot of meetings too."
            ]
        },
        {
            "sign": "Sagittarius",
            "title": "Sagittarius December Horoscope",
            "content": [
                "The lunations on fourth and nineteenth will be the major themes of this month, and it will happen in your seventh and first house. On the fourth the full moon will rise in your seventh house, so there will be some completions in the personal and business relationships. You will complete some formalities in the business discussions, as the full moon indicates endings. If you were planning to start a business, you will sign the final deal during this time. The new moon will rise in your sign, which will bring new events in your life from ninetieth onwards. It can be new relationships, new business ideas or even a new hair cut to improve your look.",
                "Mercury also will be in your sign from eleventh, so this is a very special transit for you. You will be seeking some knowledge, and you will join new course, or you will even start teaching. Mercury is the planet for speech, so you will start talking to a larger crowd. Mercury in Jupiter’s sign will give you an outlook of an intelligent man, so people will appreciate the way you talk. Additionally, you will also take up some beauty or health care treatments to improve your health.",
                "The Sun, Mars and Venus will be in your second house for a long time, so finances will be very important. You will see the real situation of your financial matters, so you will try the best to improve it. The second house also indicates speech, so you will communicate a lot about money, and you will also talk to a financial consultant. During this month you will also find a new job, or a part time venture, which can give you enough money.  You will also be busy in improving your appearance, and health as well."
            ]
        },
        {
            "sign": "Capricorn",
            "title": "Capricorn December Horoscope",
            "content": [
                "The last month of December will be significant due to the lunation in the sixth and the twelfth house. The full moon will rise in the sixth house, that shows completions in the workplace. You were working on a project, and that will come to and on the full moon day. The full moon indicates culminations, so you will see results from efforts you have been putting into your job, or wellness, or become aware of the habits which no longer support your wellbeing. The new moon will mark a deep and spirituality significant new beginning. This is the time for emotional reset, healing, release, and you will have intuitive dreams too.",
                "Mercury will move into the twelfth house so you will have heightened intuition, making this a reflective and quiet insightful period. You will also spend time in reading philosophical, spiritual and scientific articles. You will also spend time in journaling, meditation, dream work, spiritual study, or creative writing. This transit also will bring dreams which will signal you about your future. People from the past will resurface during this transit, and you will reconnect with them in a subtle way.  Travelling also can come up, and you will find many opportunities to get good contacts from the foreign lands.",
                "The Sun, Venus and Mars will be in your sign, so this is a highly energized and magnetic period and it will make you centre of attraction. You will be a bit distracted, as there will be a lot of tasks, and you will have to take a lot of responsibilities. Due to this workload, you may have some health issues, which is the part of the solar transit. This is the time for new beginnings, and you will have to be careful with what you speak, as Sun and Mars are natural negative planets, so that will make you highly argumentative."
            ]
        },
        {
            "sign": "Aquarius",
            "title": "Aquarius December Horoscope",
            "content": [
                "The first transit of this month will be the full moon on fourth in the fifth house. This will bring a culmination of events in creativity, children, or pleasure. Something you have been developing like a creative project a romantic connection, or a personal passion will reach conclusion. You will spend in entertainment projects, team gatherings, and also with children. The new moon will kickstart new long-term projects, which will bring you some money. The new moon will bring new people into your network, and they will support you. You will also be busy in various meetings online and offline too.",
                "Mercury also will move into Sagittarius, which will make you busier in the team ventures. So, the entire month for friendships, networking, future goals, and group ventures. You will have a lot of open communication, and you will share your ideas and your friends also will give you good inputs. This transit will bring invites, social conversations, online activity, and team work. Mercury will aspect the fifth house, so you will be spending more time with youngsters and you will learn new technology as well. Unemployed Aquarius natives will have the closest opportunities to get a new job, or they will start a new training program.",
                "The Sun, Mars and Venus are moving through the twelfth house, so you may have to go through a cosmic reset. You will have dreams, and they will carry some signals about your future. During this time, you will realise what you want from your life, and some of the hidden things will come out. It’s a time when your energy turns inward, making solitude, rest and reflection more important than usual. There are chances for minor physical issues too, but that will be temporary. You will also get some updates from the foreign lands, and there will be a spiritual inclination."
            ]
        },
        {
            "sign": "Pisces",
            "title": "Pisces December Horoscope",
            "content": [
                "The full moon in the air sign of Gemini will be the first transit of the month, and the new moon will rise in the 10th house. The transit full moon will bring some endings in the fourth house of home, family and relatives. This full moon will illuminate your personal matters, family dynamics and deep emotional foundations. If you were planning a real estate deal, renovation, repairing or relocation, it can happen on any day from the full moon day. There will be endings in a family problem too. The new moon in tenth house will bring new job opportunities, so this is a very important time for job seekers.",
                "The transit Mercury also will enter the tenth house, so you will have a lot of communication regarding your work and future of the career. There will be a lot of meetings, negotiations, planning or discussions, that shape the direction of your career. You will attend interviews, there will be more talks with authority figures, or clients, and your ideas will gain visibility. This is a good time for presentations, proposals, interviews, or launching new professional projects too. However, Mercury’s fast pace can create pressure, overthinking and misunderstandings if communication becomes rushed or overly logical. So please double check the details.",
                "The Sun, Mars and Venus will move into the eleventh house, so this period will boost your social life, friendships, networks and long-term goals too. The Sun and Mars are very aggressive planets, so you will be a bit egoist in the team discussions, but you should control that. You will get many opportunities to attend interviews, join parties and attend online and offline meetings too. If you are a single, Venus will bring some one special into your life, but this is not the time to give commitments. This is a very busy month for you, so prepare yourself accordingly."
            ]
        }
    ]
}