{
    "horoscopes": [
        {
            "sign": "Aries",
            "title": "Aries Weekly Horoscope Starting June 29",
            "content": [
                "Venus, the planet for love and fun, will enter the air sign of Gemini, which is going to be a very good transit. You will be inclined to speak up more through words, writing and social interactions. New people will also enter your network. There will be more interaction with siblings and network circles, which will make your life more productive. There will also be some content-driven projects also, and there will be some self-promotional activities through social media too. Short trips will be coming up, which will boost your intellect and happiness. Venus’s transit will mark the beginning of some happy days to spend with your teammates.",
                "The god of oceans, Neptune will start its retrogression during this week, which will happen in your sign, so Aries, Sun, Moon and rising signs will find this a time to restructure your life. This is a time to reflect deeply on who you are versus how others see you. Please make sure you are living in the reality, not in a simulation. The solar transit through the fourth house is highlighting the family matters so your family needs your attention. This is a period to take up more work at home, as there will be some projects like renovation, real estate deals or big buy for your home. The solar transit in the fourth house is not an ideal phase to have peaceful conversations with your family, especially with your elders. The Sun will aspect the tenth house, so you should be careful with your managers too.",
                "Transit Mercury through the fun sign of Leo is making you very playful, and you will explore your artistical skills. This is a very good Mercury, so this is the right time to plan a business, do some research on that, and discuss that with your trusted lieutenant. Single natives will find themselves interested in flirting, so, this is the right time to find an ideal partner for you. Spending time with children and youngsters will be the part of this transit."
            ]
        },
        {
            "sign": "Taurus",
            "title": "Taurus Weekly Horoscope Starting June 29",
            "content": [
                "Two mega transits are going to happen during this week, and the first one is Venus’s transit in the earth sign of Gemini. This is a very good time for attracting money, getting money, or gifts, this is a favourable period for attracting money or gifts, and upgrading yourself. This Venus will bring some increments through part time work, which will help you to raise your values. Venus is moving through the second house of speech, so you will be speaking wisely, which will help you in getting some deals too. This transit also increases your desire for luxury, so watch impulsive spending. However, please control your expenses, as Venus can increase them.",
                "Neptune, the god of oceans will start its retrogression, and this is a mass movement, and it is happening in your twelfth house, so this is the time to retreat inward, and reflect on your personal life and spirituality. This is the right time to leave the bad habits to refresh yourself, to embrace the new when Neptune goes direct. The solar transit through the third house will push you outside your comfort zone, so amid the havoc by Neptune retrograde, you will get some direction and you will be more communicative. There will be content driven projects, and it can be like writing, journaling your dreams, or making a PPT. There will be short trips, and some online or discussions with your personal and business alliances.",
                "Mercury is touching your family matters as it is moving through the fire sign of Leo. Being messenger of the gods, Mercury will bring some messages from your family members. You may feel the urge to reorganize your home, manage domestic paperwork, or research your ancestry. This transit supports writing or working from home, as your mind is clear in familiar surroundings. Emotional understanding sharpens, and you're more sensitive to the tone of words spoken within your household."
            ]
        },
        {
            "sign": "Gemini",
            "title": "Gemini Weekly Horoscope Starting June 29",
            "content": [
                "Venus transit in Gemini and Neptune retrograde in Aries are the main planetary events of the first week of July. Venus’s transit is surely going to work in your Favor for Gemini Sun, Moon and rising, as it is occurring in the first house, so this transit will bring charm, beauty, and a magnetic aura to your personality. If you use this aura wisely, you will get a lot of benefits in personal and social front. This transit will push you to update your appearance, buy new clothes, or indulge in self-care. Single Gemini natives will have the closest opportunities to find the best partner for themselves. Single or committed, all Gemini natives will surely attend social gatherings and some of you will bag new deals.",
                "In the first week Neptune will start its retrograde, which will happen in the eleventh house, so it can stir disillusionment around team settings and friendships. There are chances for false connections to come up, so, make sure you give time to start new projects with new people. However, this is a great time to redefine your goals, hopes and wishes. The solar transit is impacting the financial matters, so you will have a strong drive to earn more, but the expenses will also be higher. You will be trying to improve your talents, especially in terms of income generation. You will review your budget and make practical decisions, or ask for what you deserve.",
                "Mercury is moving through Leo, so there will be a boost in your communication, learning and networking skills. You will find communication-driven projects, and there will be some short trips, and meetings with siblings and your network circles. Your mind will be working faster, and you will be curious to know all things, so you will start learning new things. This phase also shows the chance for teaching, marketing and also for a social media campaign."
            ]
        },
        {
            "sign": "Cancer",
            "title": "Cancer Weekly Horoscope Starting June 29",
            "content": [
                "The first week of July will witness two major planetary moves, they are Venus entering Gemini, and Neptune retrograding in the fire sign of Aries. Venus will make you more dreamy, romantic and emotionally sensitive. You will crave for solitude, or a spiritual connection. Someone from the past can come up, but make sure they are here for the right reasons. This Venus is going to give you some opportunities to release yourself from old wounds, so that you can embrace a new self when Venus moves into your first house.",
                "You need to take Neptune retrograde in Aries seriously, as there will be some blocks at work, but it will not only for you, but also for the whole workplace. This transit can bring some blur at workplace, so you should be highly focused. However, the solar transit in your sign is here to guide you, and this is like your personal new year. You will be more visible, motivated and ready to take charge of your life. People will notice your presence more than the event. You will find some ways for self-improvement, fitness and also to redefine your identity.",
                "Transit Mercury is moving through the fire sign of Leo, so your focus will be on money, values and practical thinking. Mercury being the god of communication, you will have serious and productive communication with senior people, financial consultants and teachers. You will be making some smart purchases, and you will get a steal deal through your negotiation skills. This Mercury will spur you to update your skills so that it can bring new opportunities too. There will be some changes in the business, but make sure you don’t take solo moves, but inform all the concerned people. This is a good transit to organise your finances, and communicate with clarity around value-based topics."
            ]
        },
        {
            "sign": "Leo",
            "title": "Leo Weekly Horoscope Starting June 29",
            "content": [
                "The main transit of the first week of July will be Venus’s transit to Gemini, which rules your eleventh house. Venus being a natural benefic, will bring harmony to friendships, social circles, and group activities. There will be more networking, through clubs, parties or official meetings. You will get a push towards your long-term goals, and others will surely support you. This transit also favours romance, and it can get a spark through friend or in a group setting. You will be joining new teams, so this is a golden opportunity for unemployed people to find a new job too.",
                "Neptune will enter a long retrograde cycle this week, and it will turn your focus inward, making you question your beliefs, spiritual views, or foreign collaborations. You will cross check the possibilities enrolling new courses, and you will try to rejoin. There are chances for long distance travel but there will be some blocks too. The solar transit through the twelfth house will also make you a bit spiritual, and there will be need for isolation and self-reflection. You will try to get some advice from a healer or a therapist, so that you can prepare yourself when the Sun moves into your sign.",
                "Amid the complexities, Mercury transit through your sign is helping you to take practical decisions. You will be more talkative, curious and mentally active. You will take up content driven projects, and there will be some discussions for this. People will notice your speech, as it will carry weight and clarity. This transit will also bring new people into your network, and there will be multitasking. The schedule is very tight, which can bring minor health issues, like headache, stress or fever. Please control your overthinking nature."
            ]
        },
        {
            "sign": "Virgo",
            "title": "Virgo Weekly Horoscope Starting June 29",
            "content": [
                "The first week of July has good as well as a bit complex transits, so you can expect a lot of responsibilities. Venus, the planet for charm and grace will bring support from your managers, clients, authority figures and public. People will see you as a likable person, cooperative, and attractive in professional settings. This transit will bring some opportunities for career advancements, networking or presenting a better version of you. Those who work in creative sector will surely get new opportunities. However, it is advisable to not rely too much on charm-balance grace with your effort.",
                "Neptune, the planet for oceans will start its retrogression this week, and it will bring emotional and spiritual introspection, especially around themes like trust, and intimacy. Financial matters will be volatile so, you should not take up any risky financial projects. However, this is a good time to payback your debts. The solar transit through the eleventh house will open the door for brainstorming sessions, which can give you some long-term ideas. These sessions will give you a clear picture about your upcoming projects. However, ego clashes can bring some distances in the team, so make sure you are not initiating any divisions.",
                "Transit Mercury is moving through the fire sign of Leo which is making your thoughts inward, making you more introspective, intuitive, and sensitive to the unspoken. You will find it hard to express yourself openly. So, you will prefer solitude, journaling, or spiritual reflection. You will study esoteric subjects which will help you to understand the dreams as they will carry some signals about your future. Someone from the past or foreign lands will come up. However please control your overthinking nature, as it can add to your stress. This is also a great time to go for a healing process."
            ]
        },
        {
            "sign": "Libra",
            "title": "Libra Weekly Horoscope Starting June 29",
            "content": [
                "Two major planetary events are going to take place in the first week of July, they are Venus changing its sign to Gemini and Neptune retrograde in Aries. Venus moving into the ninth house will bring love for learning, travel and foreign collaborations. You will be drawn to beauty in philosophy, spirituality, and exotic locations. This is a very good transit to find a partner who lives in a far place, in a long-distance relationship mode. Such a relationship will deepen with the soft rays of Venus. You will have some global ventures, and there are chances to write, and publish your articles.",
                "The downside of this week is Neptune will go retrograde in the seventh house. This transit can bring some confusion in the relationships, and it will also remove your misunderstandings. This is a good time to restructure your relationships. This retrograde will reveal the hidden nature of your partner from personal and professional life. The solar transit is moving through the tenth house, so there will be a high focus on your career, and make sure you are a responsible employee. During this time, your seniors will focus on your work, so stay alert during this time.",
                "Transit Mercury is impacting your long-term relationships and social life as it is moving through the fire sign of Leo. You will be more talkative, curious and spontaneous around friends, groups, and online communities. This is a great time to share ideas, join discussions, or brainstorm about long-term goals. You will be in touch with people who work in technical domain, and they will support your projects. Tech, social media, and group projects will come up, and please make use of this opportunity. However, please stay away from group politics, gossip, or mental overload from too many opinions."
            ]
        },
        {
            "sign": "Scorpio",
            "title": "Scorpio Weekly Horoscope Starting June 29",
            "content": [
                "For Scorpio Sun, Moon and rising natives, financial matters will be very important as Venus will be moving into Gemini. This transit will bring some gains for sure, but there will be some concerns regarding existing financial liabilities. Financial gains through others-like inheritances, investments, or a partner’s support-are possible now. Emotionally, you will crave closeness, but you should stay away from being jealous or being possessive. During this time, you will discuss new partnership ventures, but make sure you cross check the terms and conditions.",
                "Transit Neptune will be retrograde during this week, and that will cause some challenges at work. Neptune is the planet for illusions, so you will have to be careful at work, and with your colleagues too. This is a great time to review your habits, uncover hidden health issues, or reassess how you serve others. The solar transit through the ninth house will bring some hope and guidance through the advice of your mentors. You will enrol in a course, which can also be an online training too. Global ventures, pilgrimages and long trips also will be the part of this transit.",
                "Transit Mercury is moving through Leo, which will bring some projects at work. This Mercury will bring opportunities for public speaking, making important work-related decisions, or networking with influential people. There will be interviews, important discussions with managers or fatherly figures. You will also have clear ideas about long term career goals. Since Mercury is the planet for communication, those who work in teaching, writing and sales will have more work. Mercury will aspect the fourth house of home also, so there will be opportunities to work from home."
            ]
        },
        {
            "sign": "Sagittarius",
            "title": "Sagittarius Weekly Horoscope Starting June 29",
            "content": [
                "Venus, the planet for love and money will change the sign this week and it will move into the air sign of Gemini. This will surely bring new people into your life in a personal and professional capacity. This is one of the favourable transits for love, marriage, or any kind of committed partnership. You will be very affectionate, cooperative and charming which will draw people closer to you. Single Sagittarius natives will have the closest opportunity to find someone special. This transit also will bring social gatherings and business deals.",
                "Another major transit of this week will be retrograde Neptune in Aries which will stir some blocks in the creative projects. This mega planet will bring market corrections, so traders should not take any risk. This is the time to reconnect with your inner child, and rediscover what truly brings you happiness. Please avoid casual flings or risky speculation, as your judgement will be clouded. The solar transit through the eighth house will bring challenges in the financial matters also. Please avoid all kinds of expenses, and save some money for the rainy days.",
                "Mercury, the planet for communication is moving through the ninth house, so you are highly active. You will be open to big ideas, higher learning and new perspectives. During this week you will be highly philosophical, and take part in such debates. This transit also will make you think about working in writing, teaching, publishing and legal projects too. At times, you can be a rebel, and you will question traditional belief systems, and try to change your perspective about them. Global ventures, long trips and interaction with an international community are also possible throughout this week. Please avoid overthinking, or getting lost in abstract theories."
            ]
        },
        {
            "sign": "Capricorn",
            "title": "Capricorn Weekly Horoscope Starting June 29",
            "content": [
                "The first transit of July will be Venus’s transit to Gemini, which will bring changes at the workplace. This transit has the power to bring unity and harmony at workplace, by making it more pleasant and cooperative. It will be easier to get support from your colleagues, especially those who work under you. You will take up physical activities like yoga, walks in nature, or trying to eat healthier meals. However, please avoid sugar cravings, and this is not the time to experiment with fancy diets appear on the social media. You will also spend more time with your pets or some of you will adopt a new one.",
                "The next major transit will be Neptune retrogression in the fourth house, so you will have an emotional reflection regarding family matters. Old memories will resurface, encouraging you to heal emotional wounds that were long buried. Please make sure you avoid risky real estate deals during this week. The solar transit through the seventh house surely brings some changes in the existing personal or business relationships. There will be social gatherings, but make sure you keep the decorum. Otherwise, there will be ego clashes and power struggles with your partner.",
                "The transit Mercury is moving through the eighth house, so you have a lot to talk about finances. This Mercury will bring some financial deals, and it will be good you do thorough research than signing the deal. Please avoid taking loans or any investment plan if you don’t know the deals and you must also read the fine print part as well. This is the time where the fraudsters can come to you as Mercury will soon get into its retrograde zone. Whatever important deals you have to sign, please do it before the thirteenth."
            ]
        },
        {
            "sign": "Aquarius",
            "title": "Aquarius Weekly Horoscope Starting June 29",
            "content": [
                "The first major transit of July will be Venus moving into Gemini, which will happen this week. They will light up your world with love, joy and creative energy. This is one of the most romantic and playful transits, so you will surely get some benefits. Love will enter your life, if you are single, that through social gatherings, so make sure you don’t skip any. You will also get opportunities to explore your creative talents, and you will engage in self-promotional activities. The time with youngsters will be highly productive, and they will bring new ideas to you. Team gatherings and new projects will be a part of this transit.",
                "The next major transit of this week will be Neptune retrograde in the third house, so you will have to be careful with the travel plans. There will be some travel blocks so it’s good to have a backup plan. You will meet with some of your relatives, or friends during this time. Technical glitches are also going to be the part of this transit, so please repair your electronic device ASAP. This is a good time to keep a journal, meditate, or explore spiritual studies but not ideal for making quick decisions.",
                "The solar transit through the sixth house will bring issues at the workplace, so make sure you are not adding to your worries. The Sun will show who is right and who is wrong at work, and make sure you don’t compromise on your work quality. This is good time to get job calls, take up new health care plan, or spending time with pets. Your relationships also will get a encourage you to meet new people through social gatherings. There will be effective communication for new deals and agreements too."
            ]
        },
        {
            "sign": "Pisces",
            "title": "Pisces Weekly Horoscope Starting June 29",
            "content": [
                "The first week of July will witness Venus moving into Gemini, so this will activate your family matters. You will be decorating your living space, make it more comfortable, and spend quality time with your family and friends. This is a great time to have more peace, make some art work, and enjoy music. You will also buy some devices for home, which can improve your standard of life. The next transit of this week will be Neptune, the planet of ocean will start its retrograde in the second house, which is a red flag for your financial matters, so you need to be careful during this week.",
                "The Sun is moving through Cancer, which will trigger your creative talents, and Sun itself is the planet for creative talents. This transit will bring new opportunities from creative sector, which will help you for self-promotion. For single Pisces natives, there are chances to find a new love life, which can be like a fresh energy. The existing relationships will also be vibrant. This is a great time for childless couple as they will get the right time to take up correctional methods.",
                "Transit Mercury is moving through Leo, which rules your sixth house of work, debt and health. This is a great time to work in short projects, which will be a bit stressful, but you will manage it. Please maintain a healthy distance from the colleagues, as there are chances for arguments, which can disturb the harmony at work. If you are an unemployed person, then this is the closest opportunity to get a new job, so make sure you keep on applying in various portals. Please make sure you take care of your health also, as there are chances for lifestyle related issues."
            ]
        }
    ]
}