{
    "horoscopes": [
        {
            "sign": "Aries",
            "title": "Aries Weekly Horoscope Starting September 28",
            "content": [
                "For Aries Sun, Moon or rising signs will have a great focus one on one relationships as the Sun and Mercury are in the seventh house. The Sun is obviously debilitated so, there can be some progress as well as issues in the relationships. Professional partnerships may show progress and important people could play a bigger role in your activities, agreements, and contracts, or negotiations could move forward, but you will need patience to maintain balance. You have the closest chances to get new contracts and you may even attend public functions, and you will get more visibility. This is a very sensitive placement, and if you are not polite, there are chances for arguments with your partners.",
                "Venus’s transit is on through the earth sign of Virgo, so your abdominal health, workplace and relationship and colleagues will be very important.  There will be some assignments which needs a lot of detailing, so you will be spending a lot of time on that. A colleague or subordinate will offer some support, which will be a great relief for you. You may have minor issues in abdominal health, so you have to take care of the diet.",
                "Martian transit through the water sign of Scorpio is on, so, you can expect financial difficulties. Please don’t accumulate debt, so make a specific debt management plan for you as this is the right time to do that. This Mars will bring situations connected to shared resources, debts, inheritances, or joint ventures. You will be a bit pressurised due to your financial needs, and some of you will need to resolve outstanding commitments. Some of the hidden issues will resurface, so you will have to handle them with caution and care. Sudden financial need will emerge and you have to manage them wisely, and also you have to be prepared for that."
            ]
        },
        {
            "sign": "Taurus",
            "title": "Taurus Weekly Horoscope Starting September 28",
            "content": [
                "Your sixth house of daily life, work and colleagues will be active as Sun and Mercury are moving through Libra. This transit will bring practical tasks, professional duties, and system-oriented activities to the front. You will be asked to complete projects on time and handle communications with colleagues or clients efficiently, so please avoid unhealthy talks at work. Situations at the workplace will move quickly, and you will have to stay alert to meet deadline. Health also will be important, so don’t ignore small discomforts or delays in medical check-up. You will also spend time in sending your resumes, and showing more love towards your pets.",
                "Venus is moving through the earth sign of Virgo, and it is also debilitated, so you will have a special focus on your creativity, romance and children. You will be more expressive in personal life, and your focus will shift towards matters that bring joy, but make sure you are not wasting time in merriment. Debilitated Venus can bring some issues in the relationships, so you should set healthy boundaries. If you were dealing with children, you will notice that they need more involvement. Speculative ventures such as stock trading or short-term investments will tempt you, but you have to be careful as there are chances for losses. There will be some projects with your creative skills.",
                "Mars is moving through own sign Scorpio and that will intensify partnerships, alliances, and contracts. You will notice that people around you are more assertive and situations involving agreements will become highly active. This is not a passive period; you will need to engage directly in negotiations or discussions to secure your interests. There will be some functions where you will get more visibility, but make sure you don’t overshare your matters with any newly met person."
            ]
        },
        {
            "sign": "Gemini",
            "title": "Gemini Weekly Horoscope Starting September 28",
            "content": [
                "For Gemini Sun, Moon and rising signs will have more focus on personal expression, creativity and matters connected with your children and romance. The Sun and Mercury will bring a lot of communication and decision-making about the above said features.  The Sun is debilitated, so you have to be careful while investing in creative projects as there are chances for losses. If you are dealing with academic pursuits, competitive exams, or presentations, there will be more opportunities but there will be challenges as well. Your love life also will be very important and you will spend time in clarifying your part.",
                "Venus is also debilitated, and it is highlighting your fourth house, so your home and family matters will be very important. You will feel the need to bring comfort and order to your domestic environment, and there will be plans for improvements, repairs, or aesthetic changes in your living space. There will be family gatherings, but there will be some arguments, as Venus is debilitated. You have to take care of the needs of the elderly female figures at home, because they will have some challenges. Financial spending connected to home or vehicles also will occur, and you must ensure that these expenses remain within the limits.",
                "Mars is moving through own sign Scorpio, and that is activating your sixth house, and this will increase activity in work, health, and daily routines. There will be a lot of tasks like completing a work, and you may be pressurised due to this. Please make sure you don’t argue with your colleagues, as there are chances for unfriendly vibes at work. You may also feel occasional fatigue, so don’t push too hard, and take some breaks in between. By the end of the week, you will be feeling better, and relaxed."
            ]
        },
        {
            "sign": "Cancer",
            "title": "Cancer Weekly Horoscope Starting September 28",
            "content": [
                "This week will emphasis home, family and personal foundations for Cancer, Sun, Moon and rising signs. You will be focusing on domestic responsibilities; property matters and emotional security. You will spend more time dealing with family concerns, and conversations with parents or elders, will become significant. There will be some activities regarding real estate, renovation, or relocation, so you will be very busy, but you have to be careful with the documentation as the Sun is debilitated. You will also have some family gatherings, but those gatherings can happen in an unfriendly atmosphere. The elderly female figures at home will need more support, so don’t hesitate to help them.",
                "Venus is also debilitated and it is moving through your third house, so this will bring a lot of communication, but make sure you don’t offend any. Since Venus is not in a good condition, there are chances for travel blocks, and technical glitches too. You will spend more time in networking, but make sure you are not in the wrong groups. There will be some problem-solving sessions with neighbours, siblings or your network circles. During this week, you will also focus on learning, writing, publishing or producing some viral content.",
                "Mars is moving through the water sign of Scorpio, which rules your fifth house, and this will bring more activity with your children or a young group. You will find more interesting factors while spending time with them. If you are a single, this week will bring bold opportunities to connect with someone, while committed people will have some arguments. Creative projects will be the part of this week, but make sure you don’t have any unreal expectations. There will be opportunities to spend time in variety entertainment programs as well. This is a week when both joy and intensity will mix in personal life."
            ]
        },
        {
            "sign": "Leo",
            "title": "Leo Weekly Horoscope Starting September 28",
            "content": [
                "The last week of September will bring a lot of focus on communication and travel as the Sun and Mercury are moving through the third house. The third house activation will bring more movement in your daily schedule, so you will be busy in multitasking. You will be engaged in discussions, negotiations, and multiple tasks, that need quick decisions. Professional life will involve increased correspondence, and you will notice minor errors too. There will be more communication with your siblings and network circles. There will be a lot of opportunities to learn new skills, write and publish.  Short trips also will be the part of this week, and there will be some travel glitches as well.",
                "Venus is debilitated, and it is moving through Virgo, and your financial matters are very important. You will feel the need to manage money more carefully, and expenses related to family needs or luxury items will come up. Virgo is the sign for thoughtfulness and practical action, so make sure you spend wisely. During this week, you will work hard to make some more money, and it is also possible through part time projects, or even a fulltime job. Please control your diet, as there are chances for food allergies too.",
                "Martian transit through Scorpio is on through the water sign of Scorpio, so your family matters will be very important. You will have strong emotions connected to your domestic environment, and this will lead to conflicts or urgent decisions. There will be discussions regarding land, property and renovations too, as Mars itself is the karaka of land. Please make sure your documentation regarding real estate deals is correct otherwise there will be some losses. You will also spend more time fulfilling the desires of your family members, which can be a bit tiring for you."
            ]
        },
        {
            "sign": "Virgo",
            "title": "Virgo Weekly Horoscope Starting September 28",
            "content": [
                "The weekly horoscope for Virgo Sun, Moon and rising signs, shows the importance of finance management, as the Sun and Mercury are moving through the second house. The Sun is debilitated which is indeed a red flag for your financial matters, so you need careful spending. You will spend more time in reviewing how your finances are and you will take some crucial decisions about purchases and investments. Please avoid impulsive buying as it can bring lack of money for the next month also. There will be opportunities to upskill, and thus you get a new job or even a contract job, which will be a relief during this week.",
                "Public attention will be on you as Venus is moving through your sign, so you will attend some public functions. Venus is debilitated, so there will be some concerns regarding your appearance, and you will go for some beauty treatments. Debilitated Venus can make you realistic, which is good, and you will have realistic expectations too. New people will come into your life, but make sure they are there with the right purposes. Some one from the past can also come up, but you need to think twice before you take them back.",
                "Martian transit is through the third house, so there will be a lot of work, as Mars is moving through the third house. You will be motivated to work round the clock and most of the projects can be from writing, teaching and publishing. Most of the project will need a lot of team work and mental activity. You can also expect projects communication, IT and sales and marketing. There will be travelling for personal and professional purposes, but it can be tiring as well. If you were looking for transfer, then you will get some updates regarding that."
            ]
        },
        {
            "sign": "Libra",
            "title": "Libra Weekly Horoscope Starting September 28",
            "content": [
                "The Sun and Mercury are moving through your sign, so your focus will be on personal direction, identity, and overall priorities. You will be very conscious about your appearance, and you will also try some beauty treatments. Sun debilitation can bring issues like ego clashes and power struggles too, so make sure you are trying to keep a calm composure. New beginnings in personal and professional life will be surely coming up, and you have to invest time and energy in getting results from that. You will take time to set long term goals for your life, and it will be good if you take expert opinion for this.",
                "Venus is also debilitated and it is impacting your rest and restoration as it is moving through the twelfth house. This will bring more reflective tone to relationships and personal desires. You will feel the need for privacy in certain areas, and you will choose to keep emotions or plans private. Hidden issues will resurface, and you will spend time evaluating whether commitments truly serve your interests. You will spend time in charity, and you will have some dreams, which will make you aware of your immediate future. You will also get some updates from the foreign lands or regarding foreign settlements.",
                "Mars is moving through Scorpio will impact your money matters, and this will be a complex transit as Mars can bring financial liabilities. You will be trying to improve your income, but expenses also will be high, so this will be a matter of concern. Please control your expenses and kindly don’t choose any new investment plans until Mars move out of Scorpio. Your speech can be harsh, and that also can trigger enmity within and outside home. Updating your skills will happen, and that will be one of the main attributes of this Mars transit."
            ]
        },
        {
            "sign": "Scorpio",
            "title": "Scorpio Weekly Horoscope Starting September 28",
            "content": [
                "This week will highlight your private matters, rest, and unfinished responsibilities. The Sun and Mercury are moving through Libra so, your twelfth house is activated. You will have some responsibilities like taking projects, but you will work in the behind-the-scenes part of that project. This is a silent time for you, so you will make some plans for your future, and try to clear away older commitments. Professional discussions also will be highly confidential and they will happen in private set up. You will have some dreams which will signal you about the future. There will be also some chance to get updates regarding foreign travel or settlements as well.",
                "Venus is moving through the earth sign of Virgo, and your eleventh house will become activated. You will be working with large groups, but there are chances for some blocks, so make sure you remove them. These blocks can come up as ego clashes, so make sure you have a good vibe between the team members. You will plan for long term projects, and they will surely bring some gains. Online and offline meetings will be one of the major events during this transit. You will be able to join new groups in personal or professional capacity.",
                "Mars is moving through the water sign of Scorpio, which is your own sign, and this transit will make you highly determined, and intensity. You will feel a surge of energy that will push you toward action, and you will notice that events happening fast. You will be interested in makeover or buying a new attire, new diet, or a new haircut. During this week, you will have new beginnings in personal or professional life. Single Scorpios will have the closest time to find someone special and start a new relationship."
            ]
        },
        {
            "sign": "Sagittarius",
            "title": "Sagittarius Weekly Horoscope Starting September 28",
            "content": [
                "The archers of the zodiac will find new friends and network circles around them as the Sun and Mercury is moving through Libra, which rules your eleventh house. This transit will be good and it can also produce some challenges as the Sun is debilitated, so make sure you keep a good relationship with your team mates. There will be team meetings, online as well as offline, and long-term projects which involves the team members as well. You will have new long-term ideas, which will give long term gains as well. Those who work in foreign collaborations will get some updates too.",
                "Venus is moving through the earth sign of Virgo, and you will find some developments at work. Your tenth house of career is active, so naturally you will have a lot of work. Those who work in creative industries will have to be careful, as Venus is not in a good condition, so you will need rework. You will be noticed for your contributions at work, and your ability to maintain harmony with superiors will help you to get progress, but there are chances for some arguments with them. Please cross check your projects before final submission, as there are chances for some errors. New job opportunities also can come up, but make sure you confirm they are legit.",
                "Martian transit through Scorpio will trigger your emotions, so you will need silent time. There will be a lot of activity in hidden matters, private responsibilities and behind the scene efforts. You will spend time in charity ventures, and you will also have a spiritual inclination. There will be confidential tasks, and you will need to remain discreet about certain matters too. Minor health issues can also come up, but you will be fine after this transit ends."
            ]
        },
        {
            "sign": "Capricorn",
            "title": "Capricorn Weekly Horoscope Starting September 28",
            "content": [
                "Capricorn Sun, Moon and rising signs will focus on their long-term goals as your tenth house of career is highly active. However, the Sun is debilitated, so you should realise that this is not a safe zone, so, make sure you are paying extra attention to your work. There will be discussions with superiors, negotiations, or decisions that affect your professional standing. Your superiors will ask to complete pending tasks, and they will test your ability for planning and execution. There will be new opportunities from business, PR, HR, and communication related domains. Unemployed Capricorns will have the closest opportunity to find a new job.",
                "Venus is moving through its debilitation sign Virgo, so you are very passionate about your long trips and adventurous side. You will be drawn to expand your knowledge, explore distant opportunities or reconnect with mentors or teachers. There will be some opportunities to join new foreign organisation, enrol in a course and also teach others. Those who work in media and publishing related opportunities also will have new opportunities. This is a great transit to spend time with fatherly figures and spiritual figures too, and they will surely influence your perspective. However, there are chances for blocks in the long trips, so you must have back up plans.",
                "Martian transit through Scorpio is impacting the eleventh house of long-term plans and collective projects, so you will get some long-term projects. You will take crucial steps in setting up your long-term plans regarding personal and professional decisions. Whatever you plan, you will need the support of your team mates, so make sure you keep a good relationship with your team mates. Please don’t forget to appreciate their efforts, as that will surely boost your relationship as well. New team ventures can come up."
            ]
        },
        {
            "sign": "Aquarius",
            "title": "Aquarius Weekly Horoscope Starting September 28",
            "content": [
                "Aquarius Sun, Mercury and rising signs will have more communication about long trips and global ventures. The Sun and Mercury are moving through the air sign of Libra, and make sure you rethink about long trips as the Sun is debilitated so there are chances for travel blocks. You will have a lot of conversations with your mentors, teachers and people from distant places. There will be multiple opportunities to learn new courses or even new languages through your foreign collaborations. Additionally, there will be opportunities for writing, teaching, publishing and preaching too. Teachers and students will work together for long term projects.",
                "Venus is debilitated, and moving through the mid degrees of Virgo, and it is impacting your financial matters as it is moving through the eighth house. There will be some financial challenges, but you will also have gains through part time projects or freelancing, so don’t miss such opportunities, as they will give some gains to balance the present financial issues. You will also try to restructure your tax, insurance and loans related plans. There will be some sudden financial needs, so you need to prepare for that as well. This Venus will also bring opportunities for better bonding with your partner.",
                "Martian transit through tenth house is going to bring more focus on your career, but there will be visible challenges due to lack of stability. You need to take the advice of your mentors or superiors in improving your career. There will be some job opportunities for those who work in engineering, marine services, research, and occult. You will be also trying to get new project, which can be a bit complicated, so make sure you do a good ground work, so that people can choose you above others. Since Mars is in own sign, so you will have the potential to overcome the struggles."
            ]
        },
        {
            "sign": "Pisces",
            "title": "Pisces Weekly Horoscope Starting September 28",
            "content": [
                "Pisces Sun, Moon and rising natives will have more focus on your joint finances as Sun and Mercury are moving through the eighth house. The Sun is debilitated, so this is a complex time for your financial matters, and there will be unexpected expenses as well. You will try to restructure your tax, PF and insurance related instruments. There will be some opportunities to settle your financial liabilities too, which will be a relief during this time. You will also have meetings with your partners, institutions, or family members, and you will also review documents. Professional life may involve hidden details or confidential discussions that need patience and accuracy.",
                "Your marital bonding is also important as Venus is moving through the seventh house, but Venus is debilitated. So, those Pisces natives who are going through marital issues will have to be very careful otherwise the issues can get intensified. Business owners also should be careful with your business contracts, as there will be some hidden clause, which needs careful review. You will attend some public functions like marriage, birth days or networking events for business ventures. However, please avoid oversharing your private matters with anyone as they will use this information against you.",
                "Martian transit through Scorpio and it will energize your ninth house, and this will bring intensity in learning, travel and future planning. You will feel a push to take decisive action in areas related to studies, international projects, or legal matters. Professional matters will involve meeting with influential people from the foreign lands. There will be some travel opportunities include foreign travels. Those who work in teaching, writing and publishing will have more such opportunities. You will also enrol some courses, which will surely help you in career progress."
            ]
        }
    ]
}