{
    "horoscopes": [
        {
            "sign": "Aries",
            "title": "Aries Weekly Horoscope Starting July 20",
            "content": [
                "Mercury has started its infamous retrogression, so be careful from this week onwards as Mercury can bring confusion. It can also damage your electronic devices, and communication. The chances for misplacing objects, and travel blocks are high. Please cross-check whether you are communicating the right thing, you are not forgetting anything, have your electronic devices checked or repaired, and make backup plans for your travels. The Sun will move into the fifth house, and the new moon also will rise here, so the fifth house matters like children, new team collaboration and creative ventures will be visibly high. However, please avoid the power struggles within the team members, or with your partner.",
                "Venus is moving through the air sign of Gemini, which is propelling your communication skills, and it will surely improve. This will also improve the relationship with siblings, neighbours or team mates. Please use this charm to get your point across. This Venusian energy will support you to be creative in writing, networking and to fine-tune your hustle. There will be some short trips, but make sure you have back up plans for that as well.",
                "Mars is moving through the earth sign of Virgo, will activate your sixth house of work, health and routine. You will be motivated to clean up your schedule, get serious about wellness or push forward with daily responsibilities. This is a great energy for knocking out tasks and staying productive-but don’t burn yourself out in the process. You can expect some complex tasks, multiple projects which are very competitive in nature. The new moon will rise in the fifth house, which will make you very playful, and make you reset your passion project, and even how you enjoy your life."
            ]
        },
        {
            "sign": "Taurus",
            "title": "Taurus Weekly Horoscope Starting July 20",
            "content": [
                "This week will turn the spotlight on your home and family matters as the Sun will enter Leo, and the new moon also will be here. These transits will bring new events like relocation, renovation, family meetings or opportunities to address long-standing domestic issues. At the same time Mercury is retrograde in the fourth house will stir up past issues, or confusion among property matters. This is not the right time to start a new real estate deal. You will be reconnecting with someone from your childhood or uncover something old that needs clarity.",
                "Be cautious with real estate deals, landlord conversations or making big home related purchases-details could be off. Venus is still in the air sign of Gemini, so it is giving you multiple opportunities to make money, and this is an ideal time to improve your finances either by asking for a raise, taking on extra work you enjoy, or monetizing a skill. Please do not hesitate to pitch your worth, but choose your words carefully. You will buy something beautiful, upgrade your wardrobe, or treat yourself. This is an ideal time for budgeting, especially with Mercury stirring potential confusion elsewhere.",
                "Martian transit through Virgo is adding fire to your fifth house, pushing you to take charge of your love life or a creative pursuit. If you have been passive in love, not anymore- you’re bold, flirty and maybe even possessive. Single Taurus natives will get the closest opportunities to meet someone new in a fun, spontaneous way. You will spend energy in projects related to children, dating, or in launching a new business. Please make sure, you are aware of Mercury retrograde, which is happening now, so please take care of your communication, electronic devices and travelling."
            ]
        },
        {
            "sign": "Gemini",
            "title": "Gemini Weekly Horoscope Starting July 20",
            "content": [
                "You are the centre of attention, as Venus is in your sign, so you will be more attractive, charming and likable. When Venus moves through your sign, you will be updating your look, take photos or speak up if you want something. You will get fans or support more easily, so this is also a great time for self-promotion. If you are single, someone could get interested in you. If you are in a relationship, your partner will become more affectionate. Please try to use this Venusian charm to make good contacts, and they will be long term support in your life.",
                "During this week, the Sun will move into Leo, which will stuff your life with intellectual projects, communication, short travels and daily standups. The new moon also will rise in the same house, so there will be a lot of new projects from writing, teaching and training. If you have been holding something important, this is the time to express it. You will restart a blog, take a class, or fix issues with a sibling or neighbour. Please be careful with your words, as Mercury is in retrograde, so you will have blocks in various ways. Please don’t sign any papers without careful analysis.",
                "Martian transit is happening in the fourth house and that will make you active, but some stress at home. Mars is not the right planet to be here, so you will have to be careful at home, as there are chances for more responsibilities. Be careful not to start fights at home. You will also repair some devices at home, there will be some real estate deals, or conduct some family gatherings. This is also a good time to clean organise, clean, or even move furniture around. Please don’t rush into major changes without thinking."
            ]
        },
        {
            "sign": "Cancer",
            "title": "Cancer Weekly Horoscope Starting July 20",
            "content": [
                "This week is all about money as three planetary transits are happening in the second house. The Sun will enter Leo, which will shine a light on your income, spending and self-worth. The new moon also will help you in making a fresh plan for your finances. If you have been careless with money, now is the time to fix it. You will get a new offer, side income, or finally decide to charge what you are worth. It’s also a good week to buy something useful-but don’t go overboard. Since Mercury is in retrogression, you must avoid taking any crucial decisions in anything including money.",
                "Due to this retrogression, you may forget bills, miss important details, or face payment delays. Please don’t lend money without thinking, and double check all your financial document. Venus is moving through the twelfth house, which will bring your hidden feelings and private matters into the surface. You will feel like pulling back from people or keeping emotions to yourself. Please avoid love triangles, or getting into confusing situations. There will be multiple opportunities for prayer, meditation and counselling sessions. You need rest and selfcare, and that will help you more than socializing.",
                "Martian transit through the third house will make you sharp and bold in your words. You will speak up, but don’t go too far, otherwise you will create arguments. If you are not careful, there will be arguments with siblings, neighbours, or co-workers. You will be getting some projects from writing, sales or marketing. This week also shows the possibilities for enrolling in a course and attend online and offline meetings too. Short travels will be the part of this week, but you should have back up plans as there will be some travel blocks. Stay alert, and ask questions if things are not clear."
            ]
        },
        {
            "sign": "Leo",
            "title": "Leo Weekly Horoscope Starting July 20",
            "content": [
                "This is your week to shine, Loe, as the sun will move into your sign, and you will feel more alive, confident, and ready to take the charge. The new moon also will rise in your and it will give a clean slate. You will set some personal girls, and start fresh in areas where you have felt stuck. You will change your look, update your profile, or begin a new project that reflects the real you. At the same time, Mercury is retrograding in your sign too, don’t rush. Others will misunderstand you or you will say things you don’t mean. Due to this retrogression, there will be technical glitches, or delays.",
                "Since the new moon also will be rising in your sign, despite the retrogression, there will be some new developments. You will find new people as well as old ones coming back. Venus is still in Gemini, so your social groups and friends circle will have a say during this week. The chances to expand your social circle and thus get new long-term projects. You will also reconnect with your old friend or get support from people who believe in you. If you are working on a goal, your team or network will play a big role. You will also start a new long-term relation or a project.",
                "Martian transit through Virgo will light up your second house of money and values. You will be motivated to earn more or fight for what you deserve, but please make sure you are realistic, and seek advice from an expert on which direction you should move. Overspending will be a definite matter during this time. You will spend fast, so paise before making any costly decisions. Mars in the second house will make you speak harsh, and if you don’t avoid that will bring complexities."
            ]
        },
        {
            "sign": "Virgo",
            "title": "Virgo Weekly Horoscope Starting July 20",
            "content": [
                "For Virgo Sun, Moon and rising signs will have a mix of endings and fresh starts. The Sun has moves into the twelfth house, and it is asking you to slow down and reflect. It is not the time to push hard or chase attention. The new moon will rise in the twelfth house, shows that you will start healing yourself, and this moon will help you to let go of what’s draining you-bad habits, toxic people or old guilt. This is the time to reset your life. At the same time, Mercury is in retrogression, so you will have some technical glitches, communication issues, confusion, and your mind will be cluttered. Please be cautious about what you do or seek advice.",
                "Please keep simple plans and avoid sharing anything online or offline. Your dreams or gut feelings will carry strong messages now-pay attention. Venus is moving through the tenth house, so you will get ample opportunities to project yourself as a careerist. People will see your talents now, and that will increase your popularity. A manager of client will praise your work, or an old job contact will reach you out. Please don’t mix work and romance, unless you are ready for complications. You will spend time in rewriting your social media profiles to get more viewers, and will get new connections through that.",
                "Mars has moved into your sign, so you will be active. You will feel more confident and ready to take action. Please don’t let pressure turn into stress, instead you will spend this energy to work on your body, setting daily goals, or start something important. When Mars is in your sign, you will be pretty fast which can give you injuries, so make sure you control your pace. During this time, you may feel that you are highly competent, and that can bring arguments."
            ]
        },
        {
            "sign": "Libra",
            "title": "Libra Weekly Horoscope Starting July 20",
            "content": [
                "Leo season has starteed, so your eleventh house is very much alive now. The Sun is in Leo which rules your eleventh house, helping you to connect with friends, groups and networks. The new moon also will rise here, so this is a perfect time for starting new team projects or to set fresh goals. If you have been thinking about joining a club starting a project at home, or building an online community, this is the time. You can also expect foreign collaborations, and they will be beneficial. On the flip side, Mercury is retrograding in the same house, so be careful with group chats, team meetings, or promises from others. There will be technical glitches, communication issues, and some old friends can come back.",
                "Transit Venus is moving through the ninth house, making you curious and open to new ideas. You will have plans to study new things, plan a trip or explore different belief or a new culture. Foreign collaborations, finding new people from distant lands, or falling for someone during a class or online conversation is also possible. You will also have the zeal to know more about various theologies, so you will be meeting with such people. Elderly figures and mentors will be watching your life closely. The ninth house indicates media related activities, so you will be writing some articles and publishing them.",
                "Transit Mars is moving through your twelfth house, which can stir up hidden stress or anger. You will be annoyed and not know why, and it can be majorly because of unhealed emotions. During this time, you will naturally pick up fights, but you should avoid that. You will find time to rest, journal, or do gentle workouts. Please try to find some alone time so that you can recharge your batteries when Mars moves into your first house."
            ]
        },
        {
            "sign": "Scorpio",
            "title": "Scorpio Weekly Horoscope Starting July 20",
            "content": [
                "The weekly horoscope is highlighting your career and public image. The solar transit will enter the tenth house during this house, so your goals will shine, as well as your job and reputation. The new moon also will rise here, so you will have a fresh start in your professional life. You may get a new job offer, start a new offer, or decide to change your career path. It is the right time to take your ambition seriously and set new goals for the long run. However, Mercury is in retrogression in the tenth house, so don’t rush into big career moves, there could be some delays, miscommunication with managers, or errors in the work.",
                "You don’t have to trust the promises someone gives, as they may not be always genuine. Please read all the document in detail before signing them. There will be some travel blocks and technical glitches due to Mercury retrogression as well. Venus is moving through the eighth house and it will highlight the importance of finances. There will be a meeting with your financial consultant, and you will make some plans. You will also discuss the possibilities for loans, tax, PF and insurance. If you share money or resources with a partner, make sure everything is clear. Please avoid borrowing or lending large sums unless you fully trust the other person.",
                "Martian transit is triggering your eleventh house of friendships, team work, and goals. You will step up and lead a group or fight for a cause you care about. Mars is the planet for action, so you will be fully active with your teams during this week. You will join a mission, or push forward on a group project. There will be disagreements, especially if you feel they are not pulling their weight, but try not to argue."
            ]
        },
        {
            "sign": "Sagittarius",
            "title": "Sagittarius Weekly Horoscope Starting July 20",
            "content": [
                "This week is all about relationships, goals and growth, as Venus is moving through your seventh house. It will surely bring charm and peace into your partnerships. If you are in a relationship, then things will be more loving and open. If you are a single, someone interesting might show up, possibly through a conversation, or shared activity. This is the right time to improve your connection with someone special, but do not rush into promises, especially if you are unsure about their past. You will also attending some meetings or social gatherings for personal or business purposes.",
                "The Sun will enter Leo, which rules your ninth house, giving you a strong push to expand your mind. Travelling, studying, pilgrimages and debates are very much possible during this week. The new moon will rise in the ninth house, and that will bring new opportunities from media, or in global ventures. Since Mercury is in retrogression, you should be careful with your communication, as there will be some misunderstandings. You can also expect technical glitches, or travel blocks too. Please avoid booking expensive trips, or jumping into legal talks or contracts. Please double check details and if it’s something important, wait a bit before finalising.",
                "Martian transit in your tenth house is lighting up your career and status. You will feel a strong push to prove yourself at work. You will take charge of projects, handle tough tasks, or fight for your rights. Please don’t be aggressive with coworkers, or managers- keep things professional. If you have been waiting for a move in your career, this week will give you the fire, but take one smart step at a time. This Mars will aspect the fourth house, so you will get some opportunities to rearrange your living space and hold family gatherings."
            ]
        },
        {
            "sign": "Capricorn",
            "title": "Capricorn Weekly Horoscope Starting July 20",
            "content": [
                "This week will push you to focus on deep changes and personal growth. The Sun will enter your eighth house, so that will bring your attention to shared finances, emotional bonds and hidden fears. The new moon will rise in the eighth house, so it will give you a chance to reset something important-like a joint account, loan or your emotional matters in the relationship. You will also start a new investment plan like tax, insurance or PF. Mercury is retrograding through the same house, so take extra care with the financial agreements or any such documents. Please stop sharing personal information too quickly. Additionally, there will be technical glitches and travel blocks.",
                "Venus is moving through your sixth house will help you to solve your workplace issues. You will get some support from your colleagues, or feel more comfortable in your daily routine. If you have been stressed, someone might offer to help or lighten your load. This is also a good week to focus on health in a gentle way like eating better, getting treatment, keeping a schedule to your life. Please avoid any kind of involvement in your office politics too. Some people will adopt a pet as well.",
                "Martian transit is moving through the ninth house, so you will be hungry for something more-knowledge, travel or purpose. You will join a class, or you will train someone, go on a trip, or speak up about your beliefs. This energy is powerful, but make sure you are not pushing your views too hard on others. You will spend time in writing, vlogging and publishing your articles. There will be some global ventures, or long trips, and they will give you some profits as well. Please don’t forget that Mercury will be retrograding until August second week, and that will be very tricky for your long trips, as there will be travel blocks."
            ]
        },
        {
            "sign": "Aquarius",
            "title": "Aquarius Weekly Horoscope Starting July 20",
            "content": [
                "The Leo season will start during this week, so you will focus more on your partner, close friends, or business deals. The Sun is not an ideal planet to be in the seventh house, so you will take some serious decisions during this time. The new moon will rise in the seventh house, so there will be a fresh start in your one-on-one bonds. If you are in a relationship, you can fix issues and build something better. Single Aquarius natives will have the closest opportunity to meet someone special. The weekly horoscope also shows the chances to attend some functions.",
                "Mercury is retrograding in the seventh house, so, be careful with communication in all relationships. There will be some technical glitches and misunderstandings too. Someone from the past could pop, and it can be your ex or your friend. Venus’s transit will bring some projects with your creative skills. This Venus will definitely make you charming and flirtatious too, and you will attract many people. There will be multiple opportunities to spend time with young groups as well. There will be new opportunities to spend time in entertainment programs, watch a movie, or start a new team venture.",
                "Mars is moving through the eighth house, which will stir some stress regarding money and relationships. Please be smart with shared finances, and avoid lending and borrowing. There will be some sudden financial needs and you should be prepared for that. You will speak about hidden fears, and speak up things if something is bothering you. Mars itself is the planet for financial liabilities, so there are chances for having arguments over money. If you are already facing any relationship issues don’t bottle up emotions, deal with calm. From various angles, we can see that relationships are very important, so make sure you are not being aggressive while dealing with them."
            ]
        },
        {
            "sign": "Pisces",
            "title": "Pisces Weekly Horoscope Starting July 20",
            "content": [
                "This week is all about routines, responsibilities, and your close relationships. The Leo season will start this week, and the Sun will shift your focus to your health, work and daily tasks. You will want to clean up your habits, fix your schedule, or take better care for your body. The new moon will rise here, and there will be a new project or you will have a new work device too. This is a good week to docus on small things, that make a big difference. Mercury is also in retrogression so, don’t expect everything to go smoothly. There will be mistakes, delays, or mixed signals at work are possible.",
                "Mercury retrograde will bring technical glitches, misunderstandings and travel blocks. Venus is moving through your fourth house, so your family life will be much better and peaceful. You will redecorate your home, spend time with your family and friends and even buy some devices for home. This Venus will support you in solving family disputes too. However, Mercury retrogression can block some real estate deals, travels, so make sure you carefully sign the documents. Health issues from past can return, so make sure you take care of your health.",
                "Martian transit through the seventh house will stir things up in your close relationships. You will be more reactive with your partner or someone important in your life. There are chances for verbal spats, so please avoid and stay calm. You will attend social gatherings and meet new people, but please don’t share any private information with them. If you are a single, this transit can bring sudden attraction, but take your time before jumping in. This week will help you get life in order and strengthen emotional ties. You will have some global ventures, but they will be very complex, but you have the power to get it done."
            ]
        }
    ]
}