{
    "horoscopes": [
        {
            "sign": "Aries",
            "title": "Aries Weekly Horoscope Starting October 26",
            "content": [
                "The last week of October will end with Sun, Mars and Mercury in Scorpio, which rules your eighth house, but by mid-week Mercury will move into your ninth house. The planets in eight houses are not very positive, as there will be some expenses, that too medical expenses, but such expenses will end when Mercury moves out of this trio. You may also go through some emotional challenges, but all those will end slowly, so make sure you keep your confidence. This is also a good week to settle your liabilities, restructure your tax and insurance related plans.",
                "Mercury will move into the fire sign of Sagittarius on mid-week, and it will have an opposition with Uranus in Gemini. This transit is definitely going to stimulate your mind, so you will be a bit restless, and open to new ideas. During this week, you will take part in online or offline classes, writing and publishing. You will think beyond your religion and culture you grew up, and accept different ideas. There will be global ventures, long trips and association with foreigners, which will help you to adopt new ideas.",
                "Venus is continuing in your seventh house, so you will think about new personal and business relationships. This is a good time for love, cooperation and mutual understanding in both personal and professional ties. Single natives will attract new people, but make sure you don’t blindly trust anyone. You will attend social gatherings, and people will surely notice your presence. However, be mindful not to overlook practical realities or idealize others too much. If you have any relationship issues, this is the right time to solve all those issues too. Existing relationship will find a renewed closeness and peace during this week."
            ]
        },
        {
            "sign": "Taurus",
            "title": "Taurus Weekly Horoscope Starting October 26",
            "content": [
                "When the week begins, the Sun, Mars and Mercury will be in your seventh house making you noticeable in the public. These three planets will put a strong emphasis on your relationships, and collaborations. You will be the part of one-on-one meetings, so prepare yourself to present the best. However, these three planets are aggressive, so there are chances to be impatience and angry with your partners. New people will come into your life, but that doesn’t mean you ignore those who are already in your life. Kindly avoid oversharing about your personal matters too.",
                "Mercury will move into your eight houses during the mid-week, and it will have a very strong opposition with Uranus, so this can be a red flag, especially about your financial matters. Since Mercury is the planet for logical thinking, you will analyse your financial matters logically, and reach a conclusion. You will also restructure your tax, PF and insurance related plans too. Mercury will remind you about the need of strategic planning, and deeper understanding about various financial plans. There will be meetings for new business collaborations or about your personal relationships too.",
                "Venus is moving through own sign Libra, which will solve the issues at workplace, as Venus is a natural benefic. However, there are chances for minor arguments with colleagues, but they will also. There will be some opportunities to get new job, or interview calls, so you need to be alert. You will be also trying to beautify your workplace, or make your tasks more enjoyable. Venus can also make you overeat, and that can be a real challenge for your health. You must follow sugar cut, as Venus can tempt to you to consume more sugar. This week will show you that your productivity will improve when you find harmony between effort and wellbeing."
            ]
        },
        {
            "sign": "Gemini",
            "title": "Gemini Weekly Horoscope Starting October 26",
            "content": [
                "The weekly horoscope for Gemini is showing a lot of work, as these planets are moving through the sixth house. When the week begins, Mercury also will be here and by mid-week it will move into the seventh house. There will be a lot of work, and it can bring some conflicts the colleagues or overexertion. So, you need to control your aggressiveness, and focus on the quality of your work. Minor issues like acidity can happen due to the hot planets transiting through the sixth house. Please have controlled diet and have enough water. There are chances for getting a new job or an add on project too.",
                "Mercury will move into Sagittarius and that will bring a lot of communication, and social activity. This is a period where discussions with spouse, business partners or close collaborators become more frequent and mentally stimulating. You will go for public meetings for personal and business purpose, but make sure you don’t overshare anything about yourself. You will be able to sign contracts, clear misunderstandings or planning a long-term venture. However, Mercury can make you a bit restless, and your spouse can complain about that.",
                "Venus is moving through Libra, which rules your fifth house, so you are going to win many hearts This Venus will make you very charming, and this is a favourable period for love, dating and deepening emotional bonds, as affection will flow naturally. You will also spend time in creative activity, self-promotion activity, partying and being with youngsters. If you have children, your relationship with them may become more harmonious and affectionate. You will be trying to spend money in speculative ventures, but make sure you don’t take huge risks. There will be a team work, and you will have an important role in that."
            ]
        },
        {
            "sign": "Cancer",
            "title": "Cancer Weekly Horoscope Starting October 26",
            "content": [
                "The last week of October will have Sun and Mars in the fifth house, just like the last week. You will be highly motivated to pursue hobbies, artistic projects or personal goals with confidence and determination. Both the planets are fiery planets, so you may be a bit expressive and a bit aggressive to prove yourself as well. Kindly avoid any kind of such talks with anyone, especially if you are working in a team venture. There will be discussions about speculative ventures, but over-assertiveness can lessen the profits from them. You will also have more work with youngsters, and children too.",
                "The transit Mercury will move into Sagittarius, which rules the sixth house, so you will have a lot of communication at work. This is a period for improving efficiency, organizing tasks, and focusing on details at the workplace. There will be a lot of team work, so you will need the help of your colleagues, so make sure you keep a balanced relationship with them. If you were a job seeker, you will get updates about a new job. Your health also will be very important, and there are chances for minor digestive issues, stress or fatigue.",
                "Venus is moving through the air sign of Libra, so it is giving more peace at home amid the chaos by Sun, Mars and Mercury. You will have a stronger desire to beautify your living space, redecorate, or invest in home related purchases. The relationship between parents and relatives will improve, and you can expect some guests at home. There will be favourable outcome for buying, selling or renovating property. The female family members also will have some good news to share. Overall, this transit will bring comfort, love, and stability to your family environment."
            ]
        },
        {
            "sign": "Leo",
            "title": "Leo Weekly Horoscope Starting October 26",
            "content": [
                "For Leo Sun, Moon and rising signs will have a lot of activity at home, as the Sun, Mars and Mercury are moving through Scorpio. You will naturally notice every nook and corner of the home, and you will feel that your house needs a makeover. Mars is the indicator of real estate deals, so you will get some opportunity to talk about buying or selling a piece of land. Other than this, you will also renovate your house, buy some devices for home, but make sure you inform your family members. There are chances for arguments with family members, so make sure you keep a balanced relationship with them.",
                "Mercury will move into Sagittarius, and it will have an opposition with Uranus in Gemini. You will enjoy this transit, as the universe has given you this beautiful transit to display your skills. Being a Leo, your soul intention is to show your skills to others to get their respect. Your creative skills will get noticed by the crowd, and that will give you some benefits as well. Speculative activities like investments or stock trading, can benefit from careful analysis. You will also spend time with youth, go for entertainment activities, and single Leos will also find someone special.",
                "Venus transit through Libra will surely make you busier, as it is moving through the third house of multitasking. So, you need to have a special plan for your day-to-day activities. There will be many opportunities to study, teach, write and publish your articles. Learning is a signature theme during this transit, and it can be online or offline. Additionally, you will connect with your siblings, neighbours or network circles. If you were looking for a transfer, then this is the right time, as short trips are showing in the chart."
            ]
        },
        {
            "sign": "Virgo",
            "title": "Virgo Weekly Horoscope Starting October 26",
            "content": [
                "The last week of October will bring a busy schedule, as they both will activate the third house, so, there will be a lot of communication. You will also have some projects from communication, media and teaching related domain. The Sun and Mars are planets which indicates leadership, so you will get leadership opportunities in team work, or you will take the responsibility of your siblings. There will be short travels, but make sure you avoid rash driving, as there are chances for minor injuries. There will be more work in the media, and you can also expect community activities.",
                "Mercury will move into Sagittarius, and it will have an opposition to Gemini, which will impact your fourth house of home and family. Since Mercury indicates communication, so you will talk a lot about your home, family and childhood. There will be some short trips for family related matters like real estate deals. You will also handle some documents regarding real estate deals, legal matters or contracts related to property. You will also buy some new devices for home, to make your life easier. Your friends or relative will visit you and there will be a lot of guests at home.",
                "Venus is moving through its own sign Libra, and that will impact the financial matters. Venus is good as well as complex here, because gains and expenses also will come up simultaneously. There will be a lot of financial needs and you will not have shortage, but the money you get will also flow fast. This is a complex situation, so make sure you manage it properly. This is a good time to search for a part time job, as there is chance to get it. Please control your food intake, otherwise there are chances for food allergies too."
            ]
        },
        {
            "sign": "Libra",
            "title": "Libra Weekly Horoscope Starting October 26",
            "content": [
                "For Libran Sun, Moon and rising, the second house is very much active with Sun and Mars. Both are fiery planets, so your speech will become very aggressive, and there are chances for heated conversations with family members. Please think twice before you speak, so that you can be peaceful. Money matters will be very important, and there will be a lot of expenses, which can be unexpected too. This is not the time to have any new investment plans, so make sure you don’t fall for any new scheme which gives immediate returns. Part time, contract and full-time jobs are also possible.",
                "Mercury will move into Sagittarius, and it will have an opposition with Uranus in Gemini. This transit is going to make you very active, and you will be very busy for the next two weeks. Please have a specific plan for your daily needs, otherwise, you will miss your projects. Most of the projects will be from communication, media or teaching as well. You will also have some short or long trips, transfers, which can also be interdepartmental transfer too. Since you are running around a lot, it will be natural to have some physical issues.",
                "Venus, your ruler is in your sign, which is a very good transit, and it shows new beginnings. Venus is the planet for charm and beauty, your charm will increase, and you can also be the talk of the town. People will praise you for your wits, but make sure you are not becoming obsessive. This Venus can also make you a bit unhappy as your expectations are unrealistic. Please try to respect people around and you never consider them as insignificant. This is a very good time for singles to find their ideal person, but it will be good to take some time before giving any commitment."
            ]
        },
        {
            "sign": "Scorpio",
            "title": "Scorpio Weekly Horoscope Starting October 26",
            "content": [
                "For Scorpio, Sun, Moon and rising signs, the environment is very charged, as two fiery planets are moving through the respective sign. Both are male planets and you will feel charges, and confrontation oriented than being diplomatic. Please make sure you are not haste to talk, otherwise the atmosphere will be hostile. You will have a lot of energy, and this energy can bring physical issues also. There will be new business plans, but you should be patient enough to read the terms and conditions carefully. If you were going through any relationship issues, you will be able to solve them.",
                "Mercury will move into Sagittarius, and it will have a strong opposition from Uranus which is in Gemini. This aspect is going to bring financial concerns, so make sure you have enough money for the next two weeks. Since Mercury has an opposition to Uranus, you will have sudden expenses and gains, but nothing will be easy. This is not the time to sign any financial document, but you can analyse them. There are chances for new job, or freelance project, which can be a big relief for you. Please avoid all kind of lending and borrowing without good planning.",
                "The twelfth house of isolation and detachment is triggered by transit Venus, and you will feel like being a bit detached, and there is nothing wrong in that. Whenever any planet moves through the twelfth house, you will feel like spending time in spiritual matters, and this is a call from the universe to connect with the divine energies, and they are trying to help you out to solve your emotional issues, so make use of this time. You will also get some updates about your foreign collaborations or long trip. This transit will trigger the interest towards arts too."
            ]
        },
        {
            "sign": "Sagittarius",
            "title": "Sagittarius Weekly Horoscope Starting October 26",
            "content": [
                "The solar transit is on through the twelfth house, and Mars is also there, so you feel a bit detached from the hustle and bustle of life. This transit is not so great, as two fiery planets are in the twelfth house, which both planets dislike to be in. Firstly, you need to take care of your health, as there are chances for minor health issues during this time. These issues will vanish as soon as the Sun moves out of Scorpio. You will spend time in silence, listening to spiritual lessons, and going for healing sessions.",
                "Mercury will move into your sign, and it will have an opposition from Uranus in Gemini. This is a very good transit, as people will notice your personality through your speech and your knowledge. Mercury likes to be here, as it feels the freedom, so you will find new people around, especially from distant locations. There will be new business ideas, but make sure you are not in a hurry to invest in any risky ventures. There will be some restlessness, and it is due to the transit, which will subside as it progresses. You will feel like having a new haircut, or buy new attire for you, so that you can update the appearance.",
                "Venus is moving through its own sign, but this is a good transit as Venus is moving through the eleventh house of friendships and collective projects. Even though Sun and Mars are giving you a tough time, Venus will bring hope and make you feel good. New long-term project will come up, and this will be for a long time. You will get new friends or team mates during this week. Those who work in NGO s or foreign companies will get new project as well."
            ]
        },
        {
            "sign": "Capricorn",
            "title": "Capricorn Weekly Horoscope Starting October 26",
            "content": [
                "The transit Sun and Mars are moving through the water sign of Scorpio, and it is impacting the eleventh house, so there will be a lot of activity with your team. However, you have to be careful as there are chances for ego clashes within the team, so you need to control what you say. Being a Capricorn, despite Sun, Moon or rising, you are a bit stubborn and always have high self-esteem. During this time, your friends may pull your leg, but you may take it seriously. There are chances to get new long-term project, or you may get a new friend too.",
                "Mercury will move into Sagittarius during the midweek, and that will bring a desire to detach, as it will be in the fire sign, so you will have emotional issues. You may not like something or someone going against your plan. Please make sure you are not being unrealistic, as there are chances for clashes with people around you. You will be interested in reading spiritual, scientific and philosophical texts, so you will be highly intuitive too. This is a very good time to spend in nature, and make solid plans for your future.",
                "Venus transit though Libra is triggering your tenth house, so you will have a lot of work. However, your creativity will be noticed by the public, so if you are working in arts or own business, this is the right time to project yourself, so plan for promotional activities. You will also get new job calls, so this is a positive time for job seekers, or for those who look for promotions too. Venus can also make you unnecessarily optimistic, and lazy, so make sure you don’t misuse this transit. Your managers will have some serious discussions with you."
            ]
        },
        {
            "sign": "Aquarius",
            "title": "Aquarius Weekly Horoscope Starting October 26",
            "content": [
                "The transit Sun and Mars are moving through the tenth house of career, so this is a very important time for professionals. Despite, Sun, Moon or rising signs, the Aquarius natives will get new career opportunities, but it may take some time to produce results, so you should use this time to apply for job, and be alert with every job call. Your managers will have new project for you, and you should be dedicated, as this project will be very complicated. Both the Sun and Mars are fiery planets, so the workplace will be very stressful.",
                "Mercury will move into the fire sign of Sagittarius during this week, and it will be impacting your eleventh house, so you will have many opportunities to be in the crowd. There will be new long-term plans, and you will be one of the contributors to such projects. There will be new friends, new team mates, and the environment will be very communicative. You will also get opportunities to work with foreign companies, so, those who work in such organisations will get new projects too. This transit will help you to locate a long-term financial plan too.",
                "Venus is moving through Libra, so your ninth house is active, and that will reflect as long trips and foreign collaborations. You will be meeting people from far locations, and it can be online or offline as well. There will be many opportunities for scholars, students and teachers for working in new assignments. If you are a writer, then you will get many opportunities to write and publish your articles which will bring you name and fame. Those who work in media, law and government also will get some benefits. This Venus transit will also make you spiritual so, you will go for pilgrimages as well."
            ]
        },
        {
            "sign": "Pisces",
            "title": "Pisces Weekly Horoscope Starting October 26",
            "content": [
                "The Sun and Mars are moving through the ninth house, so you will be thinking in unusual ways. The ninth house indicates expansion and magnification, so you will have the desire to break the barriers. Some of you will go for long trips, and some will get foreign collaborations. Pilgrimages, study tours or leisure trips are also possible during this week. Students will find a bit difficult to learn new subjects and clashes with teachers and mentors will be normal during this time. You will also learn new skills, write and publish your work.",
                "Your career is very important as Mercury will move into Sagittarius by mid-week, and that shows you will have to multitask. Mercury and Sagittarius, both indicate communication, so those who work in this domain will have many opportunities. If you are an author, then you will get your work published. Those who work in finances, teaching, and spirituality related domain also will get new opportunities. Discussions with clients, managers and also with your juniors will come up, so prepare yourself with valid points. This is a very good time for job seekers, as they will get updates about their applications.",
                "Venus is moving through Libra, and that will impact your financial matters. There is a challenge as a lot of expenses will come up, but you will also gain some money. The eighth house indicates fluctuation, so there will be ups and downs, but you will be able to balance it. You will also discuss the possibility of restructuring the plans related to tax, PF or insurance too. You will get many opportunities to improve the bonding between you and your spouse, or with business partner as well. This is a good transit as Venus will solve a lot of emotional, physical and financial issues."
            ]
        }
    ]
}