{
    "horoscopes": [
        {
            "sign": "Aries",
            "title": "Aries Weekly Horoscope Starting October 19",
            "content": [
                "The new moon will rise in your seventh house, and Venus is also there, so your partnerships and love life will be highlighted. You will notice a fresh energy in both personal and professional relationships, and this period will bring new personal and professional relationships. The impact of the new moon will last for six months, so your commitments will surely move forward or business associations also will continue for the next six months. You will also go for some functions and people will notice your presence. This is a very good time to have global ventures, so please make a sincere effort for that.",
                "The impact of the new moon will reflect as new contracts, and at least one negotiation will convert into a formal agreement in the next six months. The Sun will move into Scorpio, and will join Mars and Mercury there.  These planets will trigger concrete developments around shared resources, liabilities and private negotiations. There will be some update about tax and financial plans, or such institutions will issue formal requests for documentation, or they will deliver check list for immediate submission. You can also expect sudden expenses, so please be prepared for that. Please avoid any kind of risky sports or business ventures during this week.",
                "Neptune will enter Pisces, so you will close at least one long pending issue related to your global ventures, and physical issues. You will also complete one back ground matter-an old project, confidential assignment, or emotional tie- and officially move forward. There will be some interactions with institutions like hospitals, foreign governments, or spiritual institutions too. One old issue that was unresolved will silently end through written confirmation and settlement. You will have better sleep patterns, and you will have dreams, which are highly intuitive. By the end of the week, the background noise that has been blocking your progress will start to clear."
            ]
        },
        {
            "sign": "Taurus",
            "title": "Taurus Weekly Horoscope Starting October 19",
            "content": [
                "This week will bring real movement in your daily life, and work routines, as the new moon will rise in the air sign of Libra and Venus is also there. The new moon will open new projects and responsibilities, so you will start a new schedule or change in work structure. There will be a new client, a project timeline or a shift in your team. Please try to have a healthy conversation with your colleagues, otherwise there will be long term issues with them. You will also fix a health routine, may be a diet plan, a new exercise, or a medical check-up which will show clear results. Some of you will spend more time with pets and that will refresh your mind.",
                "The Sun will move into Scorpio by the mid-week and it will join Mars and Mercury, and this is a bit complex transit. You will try to get a new relationship which can be personal or official. If you are in a business, you will sign or finalize a deal that has been in review for weeks. You will also attend some parties or business meets, and you will find new contacts. There will be global ventures or you may even move to a distant place.",
                "During this week, dreamy Neptune will enter Pisces, which will make you reconnect with people, and that will bring new opportunities for you. There are clear chances for new job, or your elder siblings also will have a new job. You will get invites to join new groups online or offline, and there will be foreigners among the. A social or professional contact will mention an idea that will later turn into a career or investment path. You will be highly futuristic and you will make realistic plans for your financial gains. Those who work in advanced technology, finance and charity organisations will have more opportunities."
            ]
        },
        {
            "sign": "Gemini",
            "title": "Gemini Weekly Horoscope Starting October 19",
            "content": [
                "This week will open with New Moon in Libra, and this will activate the fifth house, and Venus is also there. The new moon will start a new chapter in your creative career, and such opportunities will last for the next six months. You will start a new creative project, hobby or content idea that will grow in coming week. For those who have children, an event or development around them will bring pride or new responsibility, possibly a performance, a school update or a milestone. Your love life also will move forward, and singles will find someone charming. However, this is not a good phase to invest in risky ventures, wait for a favourable time. You will also go for parties or entertainment programs.",
                "The Sun will join Mars and Mercury in Scorpio, so your sixth house of work, debts and daily systems will get activated. This will bring visible activity and structured progress in your routines. You will get new tasks, deadlines, or leadership responsibilities that will need precision and planning. This transit also can bring up issues with your colleagues, so try to keep a good equation with them. The health also will be your priority, and some of you will take up new health care regime.",
                "Neptune will enter Pisces, and this will surely influence your career, so this will bring your attention for long term planning in career. You will start aligning your outer work with inner purpose. This week, will bring an early sign, a conversation with a senior, a new client or shift in company plans that will open a subtle yet important opportunity. You will get ample opportunities to improve your status, so you will get more validation from your managers. Job seekers also will have the closest opportunities to get a new job."
            ]
        },
        {
            "sign": "Cancer",
            "title": "Cancer Weekly Horoscope Starting October 19",
            "content": [
                "This week will bring concrete movement in your personal life, and family as the new moon will rise in Libra, and Venus is also there. The new moon indicates new beginnings, so you can expect guests coming in and this will continue until the next six months. You will start a new home related matter-such as signing a lease, completing renovations, or receiving confirmation for relocations. Your family discussions will reach practical outcomes; an elder or parent will make a decision about a family dispute. Domestic responsibilities will increase, but solutions also will be coming up. You will also buy new furniture reorganize your space, or improve your utilities. Of course, the family bonds will get stronger.",
                "The Sun will enter Scorpio, which will further trigger the fire energy already produced by Mars and Mercury, so you will be more interested in displaying your creative abilities You will complete or present something with your creative skills, but make sure you don’t invest huge any unknown projects. Parents will see key developments around children, like achievements, competitions, or changes in their schedule. Your romantic life also will be active, and there will be a lot of short messages between you and your partner. A new attraction will develop quickly, but this is not the time to start a new love life, you will also have better social interactions through parties, business meet or celebrations.",
                "Dreamy Neptune will enter Pisces, which will open a long-term influence on your ninth house, of higher education, travel, and expansion. This will bring visible signs through communication from the foreign lands, global ventures or cultural exchange. You will also plan for a visa application, a course or a certification too. Publishing or media related work also will be possible, and some of you will start teaching or writing. You will spend more time with gurus, mentors or fatherly figures."
            ]
        },
        {
            "sign": "Leo",
            "title": "Leo Weekly Horoscope Starting October 19",
            "content": [
                "There will be a strong mental focus and movement as the new moon will rise in Libra, which rules your third house. This new moon will get the full support from Venus so there will a plenty of communications around you. You will get new messages, invitations, and proposals that will require quick responses. Short distance travel or meetings will be scheduled and completed within a week. A negotiation, or interview will move to the next phase, and written approvals or letters will arrive soon after. You will also reconnect with siblings, cousins or neighbours, and discussions will lead to practical cooperation and joint matters. This new moon also will bring opportunities to write, teach, and publish your work.",
                "The Sun will join Mars and Mercury in Scorpio, so it will activate your fourth house of home, family and property. There will be renovations, home repairs or furniture arrangement and you will also have real estate deals. Family discussions about shared space, ownership, or relocation will progress, and some of your relatives will move abroad or to a far place. These three planets also will bring some arguments, so make sure you are not a party to that. The elderly people at home will have more needs and you will support them.",
                "Neptune will enter Pisces during this week, and it can be a red flag for your financial matters. This transit will show the first results through financial adjustments or clarifications, regarding taxes, loans, or joint accounts. There will be a shift in the financial partnership, either by releasing old obligations or introducing new shared responsibility. There will be discussions about restructuring your tax, PF and insurance. You will also have some emotional issues, which can be for a long term, and you will go for healing practices too. Please try to keep your expenses within the limit."
            ]
        },
        {
            "sign": "Virgo",
            "title": "Virgo Weekly Horoscope Starting October 19",
            "content": [
                "The new moon will rise in Libra, which will impact your second house of self-worth and possessions. The new moon indicates new beginnings, and the impact of new moon will last for the next six months, so there will be some new investment plans in the upcoming dates. You will receive news about payment, salary adjustments, or a new earning opportunity. The pending approval about a project also will come up and that can also produce long term income. You will also purchase a device for the family, which can improve your efficiency. During this new moon you will also go for some parties and various delicacies.",
                "Three planets, the Sun, Mars and Mercury will be in your third house, so you will be very busy with communications, online and offline. You will write speak, or negotiate more than usual. The calendar will be full of emails, phone calls, or short trips, so you should have a clear plan for your daily activities, otherwise you will miss the appointments. There will be opportunities for writing, teaching and publishing, so you will have to be prepared for that. You will go for short trips and you will also reconnect with your siblings. This transit will make you to think sharper, and you will handle details with precision. You may also get some opportunities for transfer as well.",
                "Neptune will enter Pisces, so you will focus more on your personal and professional relationships. This week will bring the first signs like a significant conversation, a proposal, or a shift in personal or professional connection. You will have a collaboration or there will be some changes in existing collaboration too. If you are a single, there are chances to find a new partner, not only this week but as long as this transit continues, as this will be a prolonged process. You will also attend some public function."
            ]
        },
        {
            "sign": "Libra",
            "title": "Libra Weekly Horoscope Starting October 19",
            "content": [
                "The new moon will bring a subtle but profound reset to your personal and social life as it will rise in Libra during this week. The new moon indicates new beginnings and the impact of the new moon will last for the next six months, so you can expect a long time to reset your life. New dynamics in your identity and way others perceive you will become noticeable, and people will give you more attention. You will also try to change your attire, or try a new haircut. There will be small shifts in your daily routine, habits, or personal projects too.",
                "Your financial matters also will be important as the Sun, Mars and Mercury will trigger the water sign of Scorpio. There will be more expenses, and there will be less balance in the income and gains. You will be occupied with financial planning, budgeting and discussion about your existing financial liabilities. Mars indicates expenses, so you must avoid hasty financial decisions, and focus on long-term stability. There will be some opportunities to find a part time job, or a new full-time job as well. Minor disagreements can occur with family members, and at work also you will be concerned about how others perceive you.",
                "Neptune will enter Pisces, which will impact your sixth house of work, colleagues and health. This is a complex placement, so you have to be careful with your workplace. There will be complex tasks, which are very complex, so, you need to be careful while handling it. There will be more conversations with your colleagues, and kindly avoid any kind of office politics. Your health also will be very important, especially your lower abdomen will be sensitive, and you have to maintain a strict diet. You will feel like a bit detaching, but after some days you will be fine."
            ]
        },
        {
            "sign": "Scorpio",
            "title": "Scorpio Weekly Horoscope Starting October 19",
            "content": [
                "The new moon will rise in Libra, and Venus also will support Moon, and your emotional needs will be higher. Your will have some projects which have complex pattern, so you have to be very careful with them. You will feel drawn to privacy, reflection and moments of introspection, as a personal desires and attractions will surface quietly. Someone from your past, or an unexpected secret admirer, may come up, and interactions that begin in private or unseen channels will have lasting emotional impact. You will also spend time in learning spiritual texts or in meditation. During this week, you also get some updates about foreign collaborations.",
                "Meanwhile the Sun will enter Scorpio, which is the solar return for Sun in Scorpio signs, and this will bring a surge of energy, drive and visibility. You will radiate confidence, and people will notice your presence immediately. Your words, actions, and decisions will carry strong impact, allowing you to assert yourself decisively, in both personal and professional situations. You will also have many opportunities to attend public functions like parties or business meetings. This transit will compel you to improve your appearance, and you will take up some beauty treatments as well.",
                "Neptune, the god of ocean will enter your fifth house, so you will be inspired to explore your creative skills. You will have unexpected creative projects, and you will be able to handle them successfully. For single Scorpios, romantic opportunity will come up all of a sudden, but please make sure you are not in a hurry to make or accept any proposal. You will be drawn to artistic and spiritual pursuits, or playful activities too. At the same time, you will have a strong push to display your creative skills and invest in risky ventures, but you must avoid that."
            ]
        },
        {
            "sign": "Sagittarius",
            "title": "Sagittarius Weekly Horoscope Starting October 19",
            "content": [
                "The transit new moon and Venus will trigger your eleventh house of team settings and long-term goals. The new moon indicates new beginnings, so you will get new friends, and they will be with you at least for six months as the impact of the new moon will last for the next six months. You will get new invites for group activities or networking opportunities, and you will gain recognition for your ideas and contributions. Someone within your circle will step forward with a proposal, assistance, or support that will advance your goals. This is a great time to set new long-term goals for financial gains.",
                "The Sun, Mars and Mercury will be impacting your twelfth house, so there will be some emotional issues as well. None of these planets likes to be here, so you can be a bit worried about your present situations. You should stay away from any kind of arguments of private dealings, but make sure you take input from learned people even if you want to deal with such complex situations. The twelfth house indicates enemies, so please don’t share any of your private matter with anyone whom you get a negative vibe. You will also go for healing practices, prayer or meditation.",
                "The transit Neptune will enter Pisces during this week and this will make you emotional about your home and family. You and family may go short trips to watery areas like pools, beaches or creaks. If you were planning for relocation, you will choose a house near cold or place where a water body is there. There will be some discussions about renovation, and other real estate deals too. You will be talking about your lineage, and you will also find some old pictures of your ancestors. This is a very emotional time for you and you can also expect family meetings."
            ]
        },
        {
            "sign": "Capricorn",
            "title": "Capricorn Weekly Horoscope Starting October 19",
            "content": [
                "This is a very important week for your career as new moon and Venus will rise in the air sign of Libra. The impact of the new moon will last for the next six months, so your career will witness significant growth in the next six months. There are chances to start a new job, new project or you may even get a new manager. There will be a boost in your confidence, and your reputation will surely increase. The new moon will bring harmony with superiors, so try to improve your work as much as you can. Those who work in arts, fashion and business will get new opportunities.",
                "The Sun, Mars, and Mercury will impact the water sign of Scorpio, so your eleventh house will be highly active. This transit will spark ambition and momentum towards achieving your goals. These three planets will be very determinant, and that will increase your productivity in your projects. However, on this pursuit, you may even have ego clashes with your team mates, but avoid that. The Sun will surely bring leadership responsibilities, but make sure you keep a good vibe with team mates. You will also get new long-term projects, new team to work with and a new financial project as well.",
                "The god of ocean, Neptune will enter Pisces this week, so your third house will be highly active, so you will have short travels, short messages and a lot of meetings. You will be highly intuitive and that will help you in your work. There will be more conversations with your siblings, reconnect with your neighbours, and also some online meetings too. You will also get opportunities to write, teach, and publish your work. This is a very busy time for you, and you will have clear plans for you, otherwise there will be work related stress."
            ]
        },
        {
            "sign": "Aquarius",
            "title": "Aquarius Weekly Horoscope Starting October 19",
            "content": [
                "The new moon and Venus will impact your ninth house, so this is a very good week for teach, and explore your life. This is the beginning of a fortunate cycle as the impact of the new moon will last for the next six months. During this time foreign opportunities will rise, so those who were preparing to move abroad will get some updates. There will be plenty of opportunities for higher studies, or engage with philosophies which can shape your beliefs. Venus will bring luck through foreign collaborations, and you will meet good people from the foreign lands. You will also write and publish your articles, communicate with your gurus and this will be a good time for your father as well.",
                "The transit Sun will enter Scorpio, and Mars and Mercury are also there, so your tenth house of career will get a great amount of push. You will try to improve your work, and your managers will watch the progress. These three planets are naturally complex planets, so make sure your projects are perfect. Job seekers will have the closest opportunities to find a new one, especially if you are working in a technical domain. Please avoid all unnecessary talks at work, otherwise they will reduce the quality of your work.",
                "Neptune will enter Pisces, so your second house, so this transit will bring financial needs. There will be a lot of expenses, so make sure you control the expenses. The finances will fluctuate, so there will not be any balance between gains and expenses. However, there are chances for new job through part time or contract. Please control your food habits, otherwise there are chances for food related issues too. Please avoid lending money during this week, as there is no chance for getting it back. You will also meet a financial consultant for better budgeting."
            ]
        },
        {
            "sign": "Pisces",
            "title": "Pisces Weekly Horoscope Starting October 19",
            "content": [
                "The new moon and Venus will rise in Libra, which rules your eight houses, which is actually a complex as well as ok, as Venus is a natural benefic and Moon doesn’t like to be here. The main concern will be financial matters, so make sure you manage them well. If you are unable, you may meet a debt manager who can effectively teach you to manage your finances to solve them efficiently. There will be some challenges like sudden expenses, so prepare for them. However, this is a good time to settle your debts one by one and the universe will give you ample time to do that.",
                "The Sun will move into Scorpio, and Mars and Mercury are already there, so the ninth house of foreign collaboration is active. You will get ample opportunities to study new courses and thus empower yourself. This transit also will bring opportunities for long trips, so those who were waiting for updates regarding foreign travel will get that in the next thirty days. There will be ample opportunities for writing and publishing, so people will notice your work too. This is a great time to learn spiritual scriptures, and that will empower you to be stable and happy.",
                "Neptune will be in your sign for a long term, which will be making you spiritual, creative and intuitive. This is a highly transforming time for you so, you will change your style, your appearance, and your personal life also will start to shift. You will be physically very sensitive to your surroundings. On a positive note, this transit will make you more noticeable in the public through social gatherings and business meets. However, please make sure you don’t stress too much on the emotional side of your life. Others may feel that you are a bit complex person, but that is not wrong."
            ]
        }
    ]
}