{
    "horoscopes": [
        {
            "sign": "Aries",
            "title": "Aries Weekly Horoscope Starting November 16",
            "content": [
                "This is a very significant week, as Mercury retrograde will enter the eighth house, and Venus is also there. The past few days were a bit tough for regarding expenses, stress and worries. This situation may come back, so please be prepared to deal with them. Venus is also here, so there will solution for all these but the stress will be there. Please make sure you are practically dealing with your financial matters. You will be working for some complex projects at work, so, make sure you cross check all that before the final submission. Please don’t be in a haste to do anything regarding finances.",
                "Mercury is in retrograde, and that can bring technical glitches and communication issues. If you were having some travel plans, then you should have a backup plan. This is not the right time for any kind of risk taking, including physical sports. You will be interested in mystical sciences and you will also try to learn it. Since Mercury is retrograde and it is also with Venus, so there are chances for your ex-lover, or old business partner to come back, but you must take some time to take them back permanently.",
                "The Sun will move into Sagittarius, and Mars is also there, so despite the troubles you will be optimistic and hopeful. This is a very important phase for your father or fatherly figures in your life. They will have important event in their life, so you need their support.  There are chances for you to attend spiritual functions, learning such things and sharing what you learnt. This is a very good time to write back papers too. You will also get opportunities to write, teach, preach and publish your articles too. Altogether this week is a bit risky, so, you have to be careful."
            ]
        },
        {
            "sign": "Taurus",
            "title": "Taurus Weekly Horoscope Starting November 16",
            "content": [
                "This is a bit complex week for all the signs as Mercury retrogression will enter Scorpio, and the Sun will move into Sagittarius. Venus is in the seventh house, and it is not a great or bad combination. This period will enhance your charm, diplomacy, and ability to attract supportive people, so this is a good time to work on your existing relationships. Despite personal and professional relationships, you should focus on restructuring the relationship, then starting a new one. There will be many opportunities to go for social gatherings, like parties, business meet ups, or online meetings too.",
                "Mercury retrogression will enter the water sign of Scorpio this week, so this is the time for re-evaluation, reflection, and renegotiation. You will have multiple communication with partners, but Mercury retrogression will bring communication issues and technical glitches too. Some conversations which you have avoided earlier will happen during this week. This retrogression will also bring ex-lovers, and business partners back to you. If there are some unfinished or unresolved issues in those relationships, that also will return. This is not an ideal time for signing any documents, as retrograde Mercury will surely bring some mistakes, so make sure you read all the documents before submission.",
                "The Sun will move into Sagittarius, and Mars is also there, so you will need inner focus.  You will deal with issues connected to joint money, taxes, loans, debts, insurance or inheritances, and situations around these will need decisive actions. You will be a bit emotional and it can be due to your financial matters."
            ]
        },
        {
            "sign": "Gemini",
            "title": "Gemini Weekly Horoscope Starting November 16",
            "content": [
                "This is a very special week for Geminis as your ruler Mercury will enter Scorpio in retrograde mode. So, for Geminis, Venus is also here, advanced in degrees, so Venus will bring some beneficial events at work place, even though Mercury will make some troubles. You will feel easier to do the tasks, and you will also get some support from the colleagues. If you were looking for a new job, or a promotion, then this is the closest time to get that. You will also try to make your workplace aesthetically pleasing too, or you may even get a new device at work.",
                "Meanwhile Mercury being retrograde in your sixth house can bring delays, revisions and unnecessary expectations at your work. Mercury retrogression is known for technical glitches and communication issues, so please cross check your project before final submission. Your health also is very important, so make sure you don’t take any new diet during this retrograde phase, as Venus will tempt you to go for parties and that can damage your abdominal health. Please take care of your pets too, as there are chances for them to disappear during this retrograde phase.",
                "The Sun will enter the seventh house and Mars is also there, so your relationships, and partnership sector will be highly active. You will feel like going out and meeting people for personal and business purpose.  However, the Sun and Mars are fiery planets and your seventh house is also ruled by a fiery sign, so you need to be careful with how you initiate a conversation. You must need diplomacy, then only relationship can grow. Please don’t forget that during retrograde phase, wrong people can come to you as well. You may also meet your ex-colleagues, ex partner, or even your ex-business partner."
            ]
        },
        {
            "sign": "Cancer",
            "title": "Cancer Weekly Horoscope Starting November 16",
            "content": [
                "There are two major transits taking place this week, they are Mercury entering Scorpio, and the Sun entering Sagittarius. For Cancer Sun, Moon and rising, Mercury will be in the fifth house, and Venus is also there. This Venus will bring some benefits like new creative ideas, new team mates, and people will admire your work. However, you should be very cautious, as being a Moon person, you easily get flattered, so, make sure the people around you are genuine. There will be some opportunities for going for entertainment programs with your friends or family too. Venus will also show someone special to the single Cancer natives.",
                "The transit Mercury is in retrograde mode, so you will have to be careful with whom you meet. Please avoid getting too close with unknown people, and don’t share any personal information with them. You will have to cross check the official documents, as Mercury retrogression can bring errors, and technical glitches also can happen. The fifth house, where Mercury moves indicates love affairs, so be careful with the existing relationships, as they can go through a tough time. Parents will be spending more time with children, as they will be very needy.",
                "The Sun will enter Sagittarius, and Mars is already there, so the sixth house of work, debts, and colleagues will be highly active for the next thirty plus days, and it is not an easy transit. You have to be careful with your colleagues, as they can be a bit demanding, so try to be perfect as much as you can.  This is a good time to review your health, and you will find good diet plan to improve your health. Some of you will start new gym plan too. Please avoid any junk diet during this transit, so that you can keep yourself healthy."
            ]
        },
        {
            "sign": "Leo",
            "title": "Leo Weekly Horoscope Starting November 16",
            "content": [
                "The transit Mercury is in retrograde and during this week, it will change the sign to Scorpio. Venus is also there in Scorpio, so, you will be very keen about your family matters. There will be some family functions, and you will be the centre of those activities. You can expect some work like real estate deals, renovation, or relocation also. You will also buy some devices for home to improve the lifestyle. Mercury is also retrograding here, so you will have to be careful with what you buy, as there will be some technical glitches during this retrogression.",
                "When Mercury moves in retrogression, you will have some issues like misunderstanding and communication issues. Please make sure you well understand what others say, so that you can maintain peace at home. This is the time to reconnect with your old friends, and meet with relatives too. There are chances for electronic devices at home get damaged, so please cross check them as well. It will be a bad idea to sign any document, especially related to real estate, as there will be some errors. Please try to stay away from family politics, as this is not the right time to be the part of such environment.",
                "The Sun will move into Sagittarius, and Mars is also there, so you will be very active with your friends and team mates. You will also try to refresh your creative talents, as you will get some opportunities to display them. People will surely notice your work, and appreciate you for your hard work. You will also try to join a new team or you will go for team activities with your friends. Parents will find more time with their children, because they will have some important project as well. Single Leos will also try to find someone special but it will be good if you postpone such plans until Mercury moves direct."
            ]
        },
        {
            "sign": "Virgo",
            "title": "Virgo Weekly Horoscope Starting November 16",
            "content": [
                "You will be very busy this week, and running around a lot as Mercury will re-enter your sign during this week. Mercury is your ruler, and when it is in retrograde, it will bring confusion, technical glitches and communication problems. However, Venus is also here, so you will be able to manage it. There will be some opportunities short as well as long distance travel, but make sure you have some back up plan, as there will be some delays and blocks in the travelling. Please cross check your plans, so that you don’t miss anything like your ticket, passport or licence.",
                "You will also get opportunities to write, teach and publish your work, but make sure you cross check your work. This is not the right time to sign any official document, even if you have to, then cross check them. You will also reconnect with your siblings, neighbours, and friends, online or offline. This is a very busy week for you, and you have to plan accordingly. You may also face some technical glitches and communication issues, and cross check your electronic devices too. This is a very good time to learn something which you always wanted to learn.",
                "The Sun will move into Sagittarius, and Mars is also here, so your family life will be very significant for the next thirty days. This transit is not so great as the Sun and Mars are fiery planets so, there will be a lot of activities at home, which can be very energy consuming. There will be some real estate deals, renovation plans and you will take more responsibility at home. This is a very important phase for female figures at home. You will also conduct family gatherings, and there will be important discussions at home too.  Please avoid any kind of arguments as it can worsen the bond between the family members."
            ]
        },
        {
            "sign": "Libra",
            "title": "Libra Weekly Horoscope Starting November 16",
            "content": [
                "Libra Sun, Moon and rising will have to be careful with their financial matters as Mercury will be retrograding in Scorpio. Venus is also here, so you will have some gains as well. This transit will bring some opportunities to make more money, and it can be through a new job, freelance project or a contract work as well. You will also be curious about your beauty, and the finer things, but make sure you don’t spend much for these.  There will be some family gatherings where you meet your relatives in a very pleasant environment too. Pleasure purchase can be tempting, but you should have good budget.",
                "The new moon also will rise in the same sign, and Mercury is also retrograde, so you have to be careful with your finances and spending habits. Payments, invoices, or financial agreements will get delayed and they will need some correction. You purchase something, but you may return it due to some technical glitch. Mercury retrogression will surely bring technical glitches, forgetfulness, communication problems and confusion. You will also think about your ideas, values and self-worth, and you will notice where you have been undervaluing yourself or relying g or external validation. \nThe Sun and Mars are in the fire sign of Scorpio, so your daily interactions will speed up dramatically. This is a time of mental sharpness, urgency and heightened activity.  You will talk more, think faster, a d feels driven to express your opinion s directly, sometimes forcefully. You will connect with siblings, neighbours and people in your communities, and it can be online or offline. There will be a lot of short trips, errands, and paper work will increase, so naturally your schedule will become very tight. There will be a lot of work connected to writing, teaching and publishing your work."
            ]
        },
        {
            "sign": "Scorpio",
            "title": "Scorpio Weekly Horoscope Starting November 16",
            "content": [
                "This is a very special week for Scorpio, as Mercury will re-enter your sign, and new moon also will rise in your sign. Venus is also here, so your personal life will be very intense. The new moon will bring new beginnings, but remember, Mercury is also here, so it can bring delay as well.  Venus will make you more confident, and you will even think about starting a new beauty treatment, but it would be good if you wait until Mercury goes direct on 29th. You will surely meet new people, but please make sure you don’t promise anything during this retrograde phase.",
                "Since Mercury is in retrograde, you will have to be careful with your words, as it can bring communication issues. Technical glitches, delays and travel blocks will happen, so plan everything carefully. Plans you initiate will need revisions, and attempts to push forward quickly will run into delays. Your thinking will turn inward and you will also think about personal growth. Since Mercury, Moon and Venus are together, there are chance for you to meet new people, and your ex-lovers also. You will also try to improve your health, so you will take up new health care practices as well.",
                "The Sun will enter Sagittarius, and Mars is also there, so, your financial matters will be very prominent during this phase. You will be more aware of your income, spending patterns, and what you truly value. Both Mars and Sun are fiery planets, there will be a lot of expenses, which will be very challenging. Additionally, you will find new income generation methods, so please start searching for fulltime, freelance or contract job. You will feel motivated to organise your resources, budget more consciously, or invest in things that strengthen your stability. You will also spend on luxury items, but it will be good if you control that."
            ]
        },
        {
            "sign": "Sagittarius",
            "title": "Sagittarius Weekly Horoscope Starting November 16",
            "content": [
                "This is a very crucial week for Sagittarius, especially for Sagittarius Sun natives, as this is the solar return for you. The Sun will enter Sagittarius, and Mars is also there, so you will be driven to start new projects, push forward with personal goals, and take charge of situations that previously felt stagnant. Your confidence will surely increase, but make sure you are not aggressive. This transit will bring new people into your life, but you should not be in a haste to start a new relationship during this time. You will also spend more time in refining your appearance and health.",
                "Venus and new moon will be in your twelfth house, so this is a deeply introspective and emotionally cleansing period. You may be active throughout the day, but you will feel like detaching as something will be bothering you. Old emotional wounds or unspoken desires will become clearer, and you will be focused on healing, and forgiving. Silent connections, secret crushes, private romances, or unacknowledged feelings will go deep, and you will find some soulful ways to express yourself. You will spend more time in dealing with your past, correcting the errors and finding better plans for the future.",
                "Mercury is retrograding through the twelfth house, so you will have technical glitches and communication problems. If you were waiting for some updates about foreign collaborations, such updates will be delayed. Please avoid entertaining any new people, as they may not be genuine. This is a good time for meeting your old friends and relatives, and spend some time with them. Some of your secrets, private conversations, or hidden information will resurface, so, it will be good if you keep some restriction in public appearances. You will be interested in reading technical documents, but there are chances for missing emails, and misunderstanding as well."
            ]
        },
        {
            "sign": "Capricorn",
            "title": "Capricorn Weekly Horoscope Starting November 16",
            "content": [
                "For Capricorn Sun, Moon and rising signs, this week is very significant for team settings. The new moon will rise in Scorpio, and Venus is also here, but Mercury is also going to be retrograding here. Your friendships, and long-term goals will enter a fresh and uplifting phase filled with new beginnings. The new moon especially indicates new beginnings, so you can expect invite to join a new team. Moon and Venus conjunction is good here, as they both are naturally happy planets. You will be working in technically advanced group too. This is a good time to set new long-term goals as well.",
                "Mercury is in retrograde in the eleventh house, so you will have to be careful with your speech. Mercury will bring confusion and misunderstandings in the team meetings. Please make sure you forcefully try to project yourself, as there will be errors. It will be good if you keep silence, and give opinion when someone ask you. Mercury retrogression also can also bring fake people to you, so, you don’t have to trust anything blindly. You may also get updates from your old friends, but make sure you are clear about what they talk.",
                "The Sun and Mars are in the fire sign of Sagittarius, so you will have some emotional issues, as they both are transiting through the twelfth house of isolation and detachment. You may feel to be lonely, but this is a natural healing process as every sign goes through this once in a year, and this is your turn. You will be interested in prayer, meditation, or pilgrimages. The dreams will be highly intuitive, and you will get some signals about your future through those dreams. Please avoid entertaining unknown people as they can test your patience. You will also get some updates about your foreign collaborations."
            ]
        },
        {
            "sign": "Aquarius",
            "title": "Aquarius Weekly Horoscope Starting November 16",
            "content": [
                "This is a very important week for your career as Venus and new moon will rise in the tenth house, and Mercury will also be retrograde here. This is a tricky phase, so you will have to be careful, as the new moon will bring new opportunities to attend interviews, or get job calls. If you are working in arts and own business, then you will get some recognition also. Your managers also will have some important information to give, so you can expect sudden meetings too. However, both Venus and Moon are not very stable planets, so you have to be very careful at work.",
                "Mercury is also retrograding here, so this is a pure complex situation, as Mercury retrogression can bring technical glitches and communication issues. You need to handle your project documents very carefully, otherwise you may miss them or even delete them unknowingly. Mercury indicates communication, so you will have to control your speech, because, as an Aquarius native, your speech can be technically driven, and others may find it difficult to understand. If you get a new job call, then cross check how genuine the firm is but this is also a good time to apply in the company which you were rejected earlier.",
                "The Sun and Mars will be in the eleventh house, so you will find some opportunities to join a new team. However, make sure you are in the right place, as Mercury will bring some troubles. Both Sun and Mars are the planets for ego, so you can expect some ego clashes, within your team, and make sure you are not party to that, so that you can have a smooth sail. You will get new friends, new long-term plans, and you will set some financial plans also. This is not an easy phase as the planets are highly triggered, so manage yourself."
            ]
        },
        {
            "sign": "Pisces",
            "title": "Pisces Weekly Horoscope Starting November 16",
            "content": [
                "For Pisces Sun, Moon and rising signs, the transit new moon will rise in Scorpio, and Venus will also be there. You will experience a renewed sense of faith and optimism, and that will support you throughout the week. This transit will make you interested in exploring new cultures, and you can also expect some travel plans as well. Legal matters, academic pursuits, or long -distance connections will also begin fresh cycles now. For single natives, the chances are higher to meet some one special in the foreign lands. This is also a great to write, teach, and publish your long form articles.",
                "Mercury retrogression will also happen in this sign, and that will bring a long-term vision, and this is a phase of re-evaluation, and revision. Travel plans, especially long-distance trips-will face delays, changes, or confusion. Paper work like visas, tickets, or academic documents will require extra attention. There are chances for misunderstandings with teachers, mentors, or people from different cultures can happen, so please be careful, especially when you are away from hometown. It will be good if you keep your religious and political views to yourself for the time being, and don’t post them in a public domain.",
                "The Sun and Mars will bring more focus on your tenth house, so your career, public image, and ambitions will be highly triggered. You will feel like taking charge professionally, assert your authority, and pursue goals, with determination. This transit will make you more proactive, which will open doors to leadership roles, promotions, or new responsibilities. At the same time, it will increase your pressure as there will be high expectations from you. Please make sure you have a good workplace communication, especially with your managers, as you need their support too. Please cross check the documents before you submit."
            ]
        }
    ]
}