{
    "horoscopes": [
        {
            "sign": "Aries",
            "title": "Aries Weekly Horoscope Starting November 23",
            "content": [
                "The last week of November will witness Mercury turning direct in Scorpio, but that will be on the weekend. Until then you have to take care of your electronic devices, communication and travelling. Whenever Mercury moves in retrograde, there will be troubles due to communication and technical glitches too. Mercury is in the eighth house for Aries Sun, Moon and rising signs, so, financial matters also will be a bit complex, and you should not start a new investment plan during this time. This is the time to restructure your existing financial plans and also to understand existing plans related to tax, PF or insurance.",
                "Mercury and Venus are conjunct in the eighth house, and Venus will remove the struggles by Mercury. The cashflow will be less, but you will have money for your needs. Someone may show closeness towards you and be ready to help you during this time. There are chances for your ex-lovers to come back but make sure you take them back after a prolonged thought process, and wait until Mercury goes direct. If you were having a debt, this Venus will bring opportunities to settle them. A blocked situation also will suddenly move forward.",
                "The Sun and Mars are conjunct in the ninth house, so you will be optimistic and hopeful. A senior person, guru, mentor or fatherly figure will come out supporting you. There will be some chances to get training, get certification or higher studies too. Your role and responsibilities at work will become more visible. There will be sudden travels, but there can be blocks like visa issue, missing the flight or official approvals may get delayed. This is a good time to work in projects connected to writing, and publishing as well. Long trips and foreign collaborations will be the part of this transit."
            ]
        },
        {
            "sign": "Taurus",
            "title": "Taurus Weekly Horoscope Starting November 23",
            "content": [
                "For Taurus rising, Sun and Moon signs, the relationships will be very important as Mercury will be retrograding in the seventh house of personal and professional relationships. There are chances for a past partner, crush, ex-spouse, or someone you had unfinished conversations will reappear during this phase. Please make sure you think twice before you speak, as Mercury retrogression can bring communication issues, which can damage your relationships. You will redo discussions about marriage or a business partnership. Mercury retrogression phase is known for technical glitches and travel blocks too, so you have to be careful while you travel and use your electronic gadgets.",
                "Venus is also in the seventh house, and it is mellowing down the hardships. Venus will bring close communication with your partner. You will be able to restructure your existing business plans too. There will be social gatherings where you meet old friends and potential new contacts who can help you in the business. Those who work in arts and entertainment domain also will get new opportunities, but make sure they take care of these responsibilities as there will be some blocks by Mercury. Please don’t share anything private with people whom you meet for the first time.",
                "The Sun and Mars are moving through the eighth house of finances, so you are in a tough spot regarding finances. Both the planets are pure red flag regarding money, so please make sure you spend wisely. Mars itself is the planet for financial liabilities so there will be a lot of expenses, and you need to adjust with whatever you have. You will discuss the possibilities of various loans like tax, PF and insurance too. There will be discussions about real estate deals as well, but it will be good if you postpone the decision until Mercury turn direct. Some sudden events can happen like sudden expenses, or sudden change in the situation."
            ]
        },
        {
            "sign": "Gemini",
            "title": "Gemini Weekly Horoscope Starting November 23",
            "content": [
                "The last week of November will witness Mercury’s direct mode, in the sixth house, but that cosmic event will occur only on twenty ninth. Until then, there will be blocks at work place due to communication issues and technical glitches. Mercury itself is your ruler, so it can impact your personal life as well. You will forget important appointments and miss some important messages too. There will be rework in the completed task, and that can be complicated too. Please stay away from all unhealthy talks at work, otherwise that will back fire. Some physical issues also will come back, so this is the right time to cure them fully.",
                "Venus is also in the sixth house, and it will soften the situation at work, and your colleagues will give some support. You will be spending more time with your pets, and some of you will adopt new ones. Despite Mercury retrograde, you will enjoy your daily routine, and decorate your workplace. You may also get a new work device too. Venus is not a great planet to be in the sixth house, still, it is a natural benefic, so you will get new job opportunities too. You will take part in competitive events as well.",
                "Transit Sun and Mars are moving through the seventh house, so your personal and business relationships are very important. Both are natural malefics, so you will have to be careful with your partners and spouse, and you will be force to clarify boundaries, re-negotiate expectations, or redefine shared responsibilities. You will get more attention from seniors, through your partners, and your public image will become more visible. During this week, you will attend social gatherings like business meets, birth day parties or wedding. New business agreements can also come up, but make sure you cross check all documents before signing them."
            ]
        },
        {
            "sign": "Cancer",
            "title": "Cancer Weekly Horoscope Starting November 23",
            "content": [
                "Transit Mercury will turn direct on twenty ninth, but until then, you will have to be careful with your electronic devices, communication and travel plans. Since the fifth house, where Mercury is moving indicates love life, your ex-lovers can come back. During this week, you will re-evaluate your existing relationship, but this is not the time to take a final decision. Parents will change their decisions about the children. This is a complex transit for business owners, so you will have to avoid taking any new decisions in the existing business. You will also meet your old friends or you will go and meet them.",
                "Venus is also moving through the fifth house, so Cancer rising, Sun, and Moon signs will have more activity with friends. During these meetings you will find someone special but due to Mercury retrograde, you should avoid giving and taking commitments. You will try to make some money out of your creative talents, but it may take some time, but you can definitely research the possibilities. This Venus will bring good news from children; they will have academic and non-academic projects too. There will be small gains, which will be a relief during this time.",
                "The Sun and Mars are moving through the fire sign of Sagittarius, and your workplace will be very active, and you will have a lot of work, and work pressure will increase. Your colleagues and seniors will be very demanding too. There are chances for some frictions at work, so make sure you try to adjust with all as much as you can. There will be minor abdominal issues, so avoid junk and spicy diet, otherwise throughout this transit your stomach will be upset. You will be also starting a new health care practice during this transit. Even though the challenges exist, you will be able to overcome all that."
            ]
        },
        {
            "sign": "Leo",
            "title": "Leo Weekly Horoscope Starting November 23",
            "content": [
                "This is a very significant week for your family matters as Mercury is in retrograde through the fourth house, and on twenty-ninth, it will turn direct. Until then there will be some challenges regarding your family matters. This is not a pleasant time for your emotions, so you should take care of your emotions and family matters. Some of the old family issues will come back, and you have to solve them. This is not a great to sign any new real estate deal, as Mercury retrogression will bring technical glitches, communication problem and travel blocks. A family member you have not spoken to you will be reconnecting.",
                "Venus is also moving through the fourth house, so this will mellow down the issues in the family. Venus indicates beauty, so amid the chaos by Mercury retrogression, your focus will be on cleaning and decorating your living space. This is a good time for renovation, so you will plan for such things as well. There will be some family gatherings which will be pleasant, and you will meet your well-wishers too. There will be a good bonding between the female figures at home. This Venus can also bring work from home opportunities and some good words from your managers.",
                "The Sun and Mars are moving through the fifth house, so you will try to promote yourself. The fifth house indicates creative talents, so this is the time to explore your creative talents. Both the planets are fiery planets, so you may take some wrong steps in the investments. You must stay away from anything which involve huge investments, otherwise you will have losses. You will find new friends and get some ideas for your long-term projects. There will be team events like parties or entertainment programs too. Children and youngsters also will be willing to spend time with you."
            ]
        },
        {
            "sign": "Virgo",
            "title": "Virgo Weekly Horoscope Starting November 23",
            "content": [
                "Your ruler Mercury is in retrogression and it will turn direct on twenty ninth. Mercury is your ruler and this retrogression will have a big impact on you, so make sure your communications are proper. There are chances for technical glitches, and travel blocks too. This is a complex time, so make sure you have back plans for travel. You will have rework, so make sure you cross check the projects before final submission. If you were having some arguments, then it will be strong during this time. You will also reconnect with your siblings, and network circles too. Please avoid posting unnecessary comments in the social media.",
                "Venus is also moving through Scorpio, and it will be a relief for you amid the crisis caused by Mercury retrogression. You will start a new course which you always wanted to learn, and it can be online or offline. During this week, you will have pleasant conversation with your siblings and network circles. There are chances for some trips, which can be a short one as well. Those who work in writing, teaching and preaching will also get new opportunities too. Transfers and relocation also will be the part of this transit.",
                "The Sun and Mars are moving through the fourth house of home, so your family life also will be very important. Both the planets are not benefics, so there will be a tensed atmosphere at home. There are chances for heated arguments, so, please make sure you stay away from such conflicts. Mars is the planet for real estate deals, so you will be trying to sell or buy a land. There will also be some chances for renovation, relocation or repairing at home. There will be family functions and problem-solving sessions too. Altogether this is a busy week, and you will have to multitask."
            ]
        },
        {
            "sign": "Libra",
            "title": "Libra Weekly Horoscope Starting November 23",
            "content": [
                "Mercury will turn direct on the twenty ninth, until then you will have to be careful with your technical glitches, and communication issues. Mercury is moving through the second house, so there will be some financial issues, which can be temporary. However, you have to focus on finances, money, savings, and salary. You may try to increase your salary through appraisals, but this is not the right time for that. A past financial issue will come back like a bill, due payment or refund. This is a good time to reapply for the job which you applied earlier. Please take care of diet and old cravings will come back.",
                "Venus’s transit is also moving through your second house, so amid the chaos, you will not have financial crisis. There are chances for extra income through bonus, gift or some financial gains. You will spend on luxury items, but please avoid impulsive buying too. The second house indicates career, so during this time, there are chances to get freelance project or a contract job too. Both Mercury and Venus will aspect the eighth house, so there is a threat of huge expenses, so you should be prepared for that. There will be important conversations with partners and spouse especially regarding money.",
                "The Sun and Mars are moving through the third house, so you will have a busy schedule. Your speech will be bold, but it should not aggressive, so that you can have a good relationship with your siblings and network circles. This transit will give you leadership roles in discussions, meetings or presentations. There will be quick journeys, transfer, short trips, and it can be frequent. There will be a lot of meetings and they can be online or offline. You will start some projects from writing, teaching, sales or publishing."
            ]
        },
        {
            "sign": "Scorpio",
            "title": "Scorpio Weekly Horoscope Starting November 23",
            "content": [
                "Mercury will turn direct on twenty-ninth, so until then, you will have technical issues, and communication problems. The retrogression is happening in your first house, so Scorpio Sun, Moon and rising will have some minor physical issues. It will be temporary, so you don’t have to be worried. You may meet people from the past, old friends will try to reconnect with you or you will try to meet them. Old physical issues also may come back, but they will vanish after Mercury goes direct. During this time, you may overthink, and rethink about your past decisions. There are chances for misunderstandings, so make sure you think twice before you talk.",
                "Venus is also moving through your sign, so Scorpio Sun, Moon and rising will try to refine your appearance. You will look young and attractive even without trying. Despite Mercury retrogression, you will try to find someone special due to the Venus transit.  You will buy new dress and other accessories to improve your beauty. There will be some social gatherings and you will be the centre of attention. This is also a good time for client interactions, but make sure you cross check your documents as Mercury retrogression can bring some blocks.",
                "The Sun and Mars are moving through the second house, so your financial matters will be very important. Both are fiery planets, and natural malefics, so it is not good to have them transiting through the second house of money. Naturally you will have a lot of expenses, but there will be some opportunities to make money as well. Your speech will become aggressive and there are chances for arguments and you must avoid that. If you are planning to ask for appraisals, this is not the time for that. You can wait until Mercury goes direct."
            ]
        },
        {
            "sign": "Sagittarius",
            "title": "Sagittarius Weekly Horoscope Starting November 23",
            "content": [
                "You feel like detaching as transit Mercury is retrograding through the twelfth house of isolation and detachment. This retrogression phase will bring old memories and people back to you. Technical glitches and communication issues can also come up during this phase. You will have complex dreams, and they will signal you about your future. Please mark them down, so that you can have better plans to face the situations. During this transit, you may feel physically a but down, but this is a normal phase as the universe know that you want rest and restoration. Prayer, meditation and journaling will be the part of this transit.",
                "Venus is also moving through the twelfth house, so, the situation will not go out of control. You will keep your emotions private, and you don’t like going out. Some relationships will go through the verge of breakup and you should not forcefully hold someone back to you. There will be some updates about your foreign collaborations, but they may get delayed, so please expect them during the weekend. The twelfth house indicate expenses, so you will have a lot of expenses, so you need to control them. Venus will inspire you to take up some creative projects too.",
                "The Sun and Mars are moving through the first house, so you find this as the time to recharge yourself. Both are fiery planets, and Sagittarius is also a fire sign, so there is too much of fire element. You will have the tendency to argue with all, so make sure you stay away from that. New people will come to you and people will invite you for social gatherings. You will automatically get leadership roles, but please remember a good leader should be a good servant too. This transit also will push you to start new health care practices."
            ]
        },
        {
            "sign": "Capricorn",
            "title": "Capricorn Weekly Horoscope Starting November 23",
            "content": [
                "The transit Mercury is in retrograde, and during this weekend, it will turn direct. This retrogression will bring some technical issues and travel blocks. This retrogression is taking place in the eleventh house of long-term plans and team settings. You may meet your old friend, or they will connect you through call or a mail. There are chances for misunderstandings in the group and you may send wrong messages. This is not the time to start communication for a new long-term project as well. Mercury retrogression time is ideal for restructuring or reworking in your long-term projects. There will be some delays in payments, bonuses or benefits too.",
                "Venus is also moving through the eleventh house, and it will conjunct Mercury, and it will bring some peace into the friendships. You will find new friends, and meet with old friends too. During this transit, you will find new long-term projects, but you have to wait until Mercury goes direct in order to start working in them. There will be some gains through payments and bonus. This is a good time to search for alternative income generation method. You will be busy in brainstorming sessions and they can be online or offline.",
                "The Sun and Mars are moving through the twelfth house, so this can be a bit challenging for your health. You will feel like taking rest, and there is nothing wrong in such feeling as the universe is giving you an opportunity to recharge your batteries for the solar return. You will have to be careful with the promises which you make during this phase as it will be difficult to fulfil them. You will find someone from the past, but this is not the time to take them back. You will have complex dreams which will signal you about your future."
            ]
        },
        {
            "sign": "Aquarius",
            "title": "Aquarius Weekly Horoscope Starting November 23",
            "content": [
                "The last week of November will witness Mercury’s direct motion through your tenth house. This direct motion will happen in your tenth house of career, which will be a bit complex. There are chances for technical glitches, and communication problems too. So, there is a threat of errors, so you need to cross check your projects before final submission. You will have to be careful with your managers as they can easily get irritated due to your work as well. During this transit you will get some job calls, but make sure they are genuine, as Mercury retrogression can bring prank calls.",
                "Venus is also moving through the tenth house so this is a very important phase for your career. Those who work in own ventures will have more opportunities, but make sure you don’t take any huge risk, as Mercury retrogression will bring losses. Those who work in arts and entertainment domain will also have new opportunities. If you are carefully making moves, then you will get appreciations, and appraisals. You will plan for presentations, client meetings and public-facing tasks too. Both Mercury and Venus are aspecting the fourth house, so there will be some real estate deals, renovation and work from home opportunities too.",
                "The Sun and Mars are moving through Sagittarius, so your long-term plans and team settings will be very important. You will get lead roles in the team project; at the same time, you will have ego clashes in the team work too. The planetary transits are not so positive, so make sure you don’t argue with anyone. There will be a lot of group events like online and offline meetings too. You will be invited to join new groups; new ideas will come through the group discussions as well. This is also a good time for salary discussions and negotiations too."
            ]
        },
        {
            "sign": "Pisces",
            "title": "Pisces Weekly Horoscope Starting November 23",
            "content": [
                "The transit Mercury will turn direct during this weekend, so you will have to be cautious with your travel plans during this week as well. Mercury retrograde will bring technical glitches, and communication problems. Mercury is moving through the ninth house of long trips, so there are chances for travel blocks, so you should have a back up plan. This is a complex time for your relationship with fatherly figures, gurus and mentors, so make sure you are obedient towards them. Students with back paper will get many opportunities to complete them successfully. Some updates about foreign collaborations will get delayed.",
                "Venus is also moving through the ninth house, so from the mid-week onwards your travel blocks will get removed. You will go for pleasant journeys and you may meet interesting people during this time. This Venus will make you feel lucky and the relationship with fatherly figures and mentors will improve. You will also start learning new courses, and it can be spiritual or creative subjects as well. The ninth house indicates writing, and publishing, so you will get opportunities to write long form articles, and you will publish it. From the mid-week onwards, you will take part in spiritual activities too.",
                "The Sun and Mars are in the tenth house of career, and you will be very forceful in meeting your target. Your work will become noticeable, and your seniors will notice your work. Both the Sun and Mars are malefic planets, so you will be aggressive, which can bring clashes with colleagues or managers. Those who work in sports, admin and armed forces also will have new opportunities too. You will take charge of a team project, and you should not be like an autocrat. Please listen to others carefully, as they will have valid points as well."
            ]
        }
    ]
}