{
    "horoscopes": [
        {
            "sign": "Aries",
            "title": "Aries Weekly Horoscope Starting November 2",
            "content": [
                "The first week of November is very intense due to the full moon in Scorpio and Mars transit in Sagittarius. When the week starts Venus will be in Libra, making you to meet many people from personal and official space. You will also look for new official contracts, to form business, job or a renewing an existing contract too. The solar transit in Scorpio will make you a bit emotional, especially about finances, medical needs and there will be fluctuations in financial matters. Please avoid unnecessary expenses, but some of those will be inevitable. You will also discuss the possibility of new insurance, tax, and PF related plans.",
                "On the second the full moon will rise in the earth sign of Scorpio, which will bring an end to an expense, as the full moon indicates endings. This is a complex time, as you will be feeling a bit down about yourself, and your values, but this is also a good time to improvise yourself. You will leave some old financial practices, which was not helping you at all. Please take care of your diet, as there are chances for food related issues. Some family event also will come to an end during this full moon day.",
                "Mars will enter your ninth house, so you will have a desire to grow and be adventurous.  You don’t like any rules or restrictions, and that can make you a rebel, but make sure you give respect for everyone around you. There will be long distance travels, which can be official or unofficial, foreign collaborations and global ventures too. This transit will also give some opportunities for writing, publishing and learning as Mercury is also moving through Sagittarius, you will also have a spiritual inclination, but in a rebellious mode, so please take care of that when you talk to your mentors, teachers and gurus."
            ]
        },
        {
            "sign": "Taurus",
            "title": "Taurus Weekly Horoscope Starting November 2",
            "content": [
                "The first week of November will witness two planetary events, they are full moon in Taurus, and Mars transit in Sagittarius. Venus will be in your sixth house, so you will be focusing on work, duties, and your health. The sixth house is not the right place for Venus, so you will have some concerns like how perfect your work is and how your colleagues treating you. There are chances for new job, so job seekers have the closest time to get a new job, or there are chances for add on projects too. Your health is also very important as Venus can trigger you to have a bad diet, so make sure you follow a good health pattern as well.",
                "The full moon will rise in your sign on the second, and the Sun is in your seventh house. This cosmic dance will bring new relationships from personal and business space, so get ready to choose a new one and finish some formalities in forming another relationship. On the full moon day, there are chances for issues like headache or anxiety, but you will be fine after the full moon ends. This Moon will make you have strong efforts to improve yourself, you will leave behind some old habits, and take new steps to protect yourself differently.",
                "Mars will enter Sagittarius, and Mercury is also there, so you will have a desire to go deep into your emotional and financial matters. There will be sudden need of money, so, there will be a lot of expenses, which can make you feel restless. You can expect discussions regarding money, tax, PF and insurance, please avoid any kind of risky activities like sports, driving or anything which can injure you. You need to take care of your health, as there are chances for exhaustion or stress related issues too."
            ]
        },
        {
            "sign": "Gemini",
            "title": "Gemini Weekly Horoscope Starting November 2",
            "content": [
                "Two important transits will be the base of this week; they are full moon in Taurus and Mars transit to Sagittarius. Venus will be in fifth house, as it is in Libra, so you will spend more time in exploring your creative skills. During this week also you will spend time with your team in developing some projects with your creative skills. Children and youngsters also will be a part of it and childless couple will get the closest chances to get the updates about childbirth. There will be some entertainment events, like musical night or movie date with your loved ones too. However, you need to be careful while investing in business ventures.",
                "Transit Sun will be impacting the sixth house, and the full moon will impact the emotions as it will rise in the twelfth house. This will be a bit tough time for you as the developments at work will impact emotional self. This is a bit complex phase, so you need to be careful with how you behave with your colleagues. There will be a silent competition among colleagues, and you will have to give your best to complete the projects on time. Your physical and mental health also will be very important, and you will be highly intuitive during this week.",
                "Mars will move to Sagittarius, and Mercury will be also there, so, your seventh house of relationships will be very important. Both are fast and furious planets, so you will start expressing yourself fiercely, so you can expect some arguments with spouse or people from the public space. Please make sure your points are valid before you present Infront of others. There will be opportunities to get new offers, like job offer of new business contracts. You will also have foreign collaborations, opportunities for public meetings, or other social gatherings."
            ]
        },
        {
            "sign": "Cancer",
            "title": "Cancer Weekly Horoscope Starting November 2",
            "content": [
                "Venus, the planet for diplomacy and peace is moving through Libra, which rules your fourth house, so there will be much improvement in your family matters. This is a good time, so you will find many opportunities to celebrate at home, and you will also find some guests at home. You will also find some solutions for the existing family problems too. Venus in the fourth house means, this is the time for renovating, and decorating your house, and there will be some real estate deals like selling or buying a piece of land too. During this phase, the female members at home will have more importance too.",
                "The full moon will rise in Taurus, and the Sun will rise in the Scorpio, and that will highlight your team ventures and children. The full moon indicates completions, so you will complete some of your projects, and you will get some benefits out of it. It can also be like some of your friends leaving you or you leaving some of your teams. Please make sure your emotions are not overpowering you while dealing with your friends. You will also spend more time in team ventures, and creative projects too. Parents will find new projects for children and they surely need your support.",
                "Mars will move into the sixth house and Mercury is also there, so your sixth house is very much active. You will have to take up more work, and the projects will be very competitive. Both are fast and restless planets, so there are many chances to have arguments at workplace, so make sure you are patient with your colleagues. You will be working hard to prove your talents and people will accept it. Your health also will be very important, so you have to take care of your diet and wellbeing too."
            ]
        },
        {
            "sign": "Leo",
            "title": "Leo Weekly Horoscope Starting November 2",
            "content": [
                "The first week of November will have full moon rising in the earth sign of Taurus and Mars transit in Sagittarius. So, you will have an eventful week this time, so buckle up your belt to work hard. Venus will be in the third house like the last week, so you will be having multiple projects from writing, teaching and counselling. These projects will be very short, and you will be mostly working with your teams as well. There will be short trips, which can be for personal or business reasons. If you had any issues with siblings, or network circles, you will be solving those issues.",
                "The Sun will be in Scorpio, and the full moon will be in Taurus, so, your fourth and tenth house will be active. The full moon indicates completions, so you will complete some projects, and make sure you cross check the projects before submission. Your managers also will have some important discussions, and you will get some updates about your job. The solar transit through the fourth house shows that you will start some repairing works at home. There will be renovation, and other real estate deals as well. You will have family meetings, discussions regarding ancestral property, and you can also expect some guests at home.",
                "Mars will move into Sagittarius, and Mercury is also here, so you will have creative projects, but make sure you have a practical plan for such ventures, otherwise you may face losses. There will be team events, but there are chances for arguments in them as well, as Mars and Mercury conjunction shows that you will be very aggressive. Ego clashes are also going to take place in your love life, so you have to be cautious. You will be attending social gatherings and work for the empowerment of children or youngsters​."
            ]
        },
        {
            "sign": "Virgo",
            "title": "Virgo Weekly Horoscope Starting November 2",
            "content": [
                "The first week of November will be very intense with full moon and Mars transit will trigger your fourth house. To begin with, Venus will impact the finances, which is a good as well complex condition just like the last week. You will have money, but there will be expenses, but expenses will be on the higher side. During this transit you will find more methods to make money, but make sure they all are legit plans. You will also have an urge to spend for silly things, and kindly avoid that. There will be multiple opportunities for new job, or part time projects as well.",
                "You will be very busy throughout week as the full moon will rising in Taurus and the Sun will be in Scorpio. This transit will bring multiple opportunities for short as well as long distance travel. These travelling will nourish you, but they can be tiring as well. Learning, knowledge sharing and teaching opportunities also will be the part of this transit. There will be a lot of activities with your network circles, siblings and team mates, so you will be naturally busy. During the full moon day, you will complete some important assignments too. Foreign collaborations also will be the part of this transit.",
                "Mars will move into Sagittarius, and Mercury is also here, so you will be having important events at home. From various angles traveling is showing, so those who were looking for a transfer or relocation will have such opportunities. You will be spending time in real estate deals, and you will be talking to such consultants. Since Mars and Mercury are fast and furious planets, you should not be in a haste to take up such project. There will be discussions for renovation, or about ancestral property as well. However, there will be family meetings, but there will be conflicts as well."
            ]
        },
        {
            "sign": "Libra",
            "title": "Libra Weekly Horoscope Starting November 2",
            "content": [
                "The first week of November will highlight the need of money as the full moon will rise in Taurus, and the Sun is in the water sign of Scorpio. You will have to be careful with your money, as expenses are in a higher mode, which can be concerning. On the second, the full moon will rise in Taurus and it indicates endings. The full moon indicates completions, so you will complete some financial dealings on the full moon day. Still the impact of the full moon will last for the next six months, so you should have better finance management plan for the next six months.",
                "Martian transit will move into Sagittarius, and Mercury is also there, so your schedule is very tight, as there are multiple tasks including traveling and learning. Mars is conjuncting Mercury, so you will have a lot of meetings which will be online as well as offline. You will be the part of many groups like WhatsApp, and other social media groups, but please maintain the decorum, otherwise you will be in trouble. There will be multiple projects from communication, media, writing, sales and marketing. There will be short trips, and transfer as well, so those who were looking for transfer will have the closest opportunities to apply for that. You will also have close interaction with siblings, neighbours and communities.",
                "Venus is continuing through Libra, which will highlight your personal life and your appearance. This is a favourable transit, so, you will have new opportunities to form new relationships from personal and professional domains. If you were trying to get a new business opportunity, then the universe will bring such opportunities too. Single Libran natives will have the closest opportunities to find a good partner, but make sure you are not in a haste to give a commitment. You will buy new products to improve your appearance too."
            ]
        },
        {
            "sign": "Scorpio",
            "title": "Scorpio Weekly Horoscope Starting November 2",
            "content": [
                "This is your solar return time Scorpio, so, your personal life is going through an important phase. You will take up new projects as the Sun will give you new opportunities. Your physical health also will be important, so you will take up new health care practices and beauty treatment too. The full moon will rise in your seventh house, that means your relationships will be important. The full moon indicates completions, so you will complete some formalities in forming a new relationship. If you were going through a relationship issue, then you will find some solution for that during this time.",
                "Mars will move into Sagittarius, which rules the second house, and Mercury is also in the same house. Your financial matters are not stable now, and Mars will be here for the next forty plus days, so this is certainly a red flag regarding finances, so make sure you spend carefully. Some people will come to you with new investment plans, but this is not the right time to start a new investment. The second house indicates career, so you will have new opportunities, and there will be part time opportunities too. Please control your food intake, as there are chances for food allergies as well.",
                "Venus is moving through the air sign of Libra, which will trigger your emotional self. This transit will bring some emotional issues, so, you should spend time in identifying that and this solving it. You will have dreams which will give some signals about your future. This Venus will also make you go for spiritual practices, and you will also spend time in meditation, prayer or other healing practices. You will also get some updates about foreign collaborations, and there will be many chances for long trips too. Venus’s transit will also bring solutions for the problems."
            ]
        },
        {
            "sign": "Sagittarius",
            "title": "Sagittarius Weekly Horoscope Starting November 2",
            "content": [
                "Mercury is in your sign and Mars also will enter here during this week, and it will stay in Sagittarius for the next forty plus days. This transit will surely make you energetic, but initially, there will be some issues like head ache or fever also, but that will end gradually. You will have to take care of your health, as there will be minor issues due to the presence of fiery planet Mars and fast planet Mercury. There will be a lot of tasks, which will be complex, but you will be able to solve all of them.",
                "The full moon will rise in Taurus, and the Sun will be in Scorpio, so, you will have equal focus on work as well your emotional self. The full moon indicates endings, so you will complete some projects at work, but make sure you inform your team members as well. The sixth house indicates detailed work, so please cross check whether your work has met the standards before you submit them. If you were struggling with some abdominal issues, those issues will end during this week. You will also have intuitions and dreams during this week due to the solar transit. There will be some updates about long trips and foreign collaborations too.",
                "Venus is moving through the eleventh house, and you are getting some long-term plans. All these projects indicate some profits, so get ready to work hard to make more money. You will get new team mates, and the chances to work with team mates from opposite gender too.  There will be global ventures, and those who were looking for such opportunities, will have the closest opportunities to get that role. New team members will join you, and this will be a pleasant transit. Your elder siblings and sibling like friends also will have a good time."
            ]
        },
        {
            "sign": "Capricorn",
            "title": "Capricorn Weekly Horoscope Starting November 2",
            "content": [
                "For Capricorn Sun, Moon and rising signs will be focusing more on team ventures and creative projects as the full moon will rise in Taurus, and the Sun is in Scorpio. Both the transit shows that you will be focusing on your own ventures. The full moon indicates endings, that means you will try to finish some projects. You will also have some projects connected to children, and there will be problem solving session regarding children. However, there are chances for ego clashes with your team mates, which may ruin the vibe so stay away from anything can hamper the progress.",
                "Mars will enter Sagittarius this week, and Mercury is also here, so you will have some emotional concerns. You will also go for foreign collaborations, or will get some updates about such projects. Mars and Mercury combination in the twelfth house is not good, so make sure you stay away from all kind of scandals and controversies. These planets are restless planets, so your physical health is also very important. You will have sleep disturbances, and you will also have some complex dreams. This is a good time for going for prayer and meditation sessions too. You will also feel like learning spiritual and philosophical texts.",
                "The transit Venus will bring focus on career, as it is moving through the air sign of Libra. This is the time for career growth, as Venus is in air sign, and air element indicates intelligence. You will be working in complex projects, which really need some back ground work. Job seekers will have the closest opportunities to get a new job, so make sure you send your resumes. The transit Venus also will bring some appreciations from the managers, and you will feel confident too. At the same time, you can be a bit lazy, but please avoid that."
            ]
        },
        {
            "sign": "Aquarius",
            "title": "Aquarius Weekly Horoscope Starting November 2",
            "content": [
                "Your family and career will be very important as the full moon will rise in the fourth house this week, and the Sun is in the tenth house. There will be some updates about your family matters and career too. There will be some opportunities to get a new job, so job seekers should use these opportunities. You will get opportunities for real estate deals, renovation, and you will also buy new devices for home. Please make sure you keep a balanced relationship with your managers and team mates too, otherwise you may not be able to use these opportunities effectively.",
                "Mars and Mercury will impact your long-term projects, as they both will impact the eleventh house. These planets will bring opportunities, but the opportunities will bring a lot of struggles too. Please make sure you don’t trigger anyone, as the support of team members is very important during this time. The transit will also bring global ventures, so those who were looking for such offers will have the closest chances for that. The transit Mars and Mercury will make you interested in advanced technology, so you will new things as well. You will take part in offline and online meetings for brain storming sessions.",
                "Foreign collaborations will be a bigger part of this week, as Venus is moving through the ninth house. You will spend time in learning new subjects or sharing what you learned. This Venus will bring foreign nationals to you, and you will learn from them. There will be long trips, for personal business or spiritual purposes as well. During this week, you will be spending more time with your mentors, gurus and mentors too. You will also get opportunities to write long form articles, and get them published too. Altogether, this is a week full of opportunities too."
            ]
        },
        {
            "sign": "Pisces",
            "title": "Pisces Weekly Horoscope Starting November 2",
            "content": [
                "The first week of November will witness two planetary events, they are full moon in Taurus and Mars in Sagittarius. The Sun is in the ninth house and the full moon will be in the third house. There will be a lot of communication, which can be online and offline. You will be spending time in documentation, and publishing your work as well. There will be more conversation with your sibling, mentors and gurus, and that will be enlightening too. Long as well as short travels will be the part of this transit, so you can expect global ventures too. Learning and teaching also will be the part of this week.",
                "Mars will enter Sagittarius, which rules your tenth house, and Mercury is also there, so you will have a lot of work. There will be work related stress also, so you have to be very cautious at work. The transit is not good, so there are chances for argument with managers and colleagues too. There will be complex projects, which can be a very detailed, so you have to study a lot. Those who work in army, writing, publishing and IT will have a lot of work. Job seekers will also have the closest opportunities to get a new job.",
                "Venus is moving through the eight houses, so, the financial matters are also important. You will have enough opportunities to make enough money, but there will be expenses as well. This transit will bring opportunities for setting new plans regarding tax, PF and insurance too. You will have more conversation with your in-laws; they will be of mutual help. This is a good time for learning new healing practices, so, you will be taking some initiatives to go for such consultations too. During this week, you will have some solutions for your problems."
            ]
        }
    ]
}